LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
#define DIA_EUI                                             0x3F0010
#define DIA_EUI0                                            0x3F0010
#define DIA_EUI1                                            0x3F0012
#define DIA_EUI2                                            0x3F0014
#define DIA_EUI3                                            0x3F0016
#define DIA_EUI4                                            0x3F0018
#define DIA_EUI5                                            0x3F001A
#define DIA_EUI6                                            0x3F001C
#define DIA_EUI7                                            0x3F001E
#define DIA_EUI8                                            0x3F0020
#define DIA_EUI9                                            0x3F0022

#define DIA_TSLR                                            0x3F0024
#define DIA_TSLR1                                           0x3F0024
#define DIA_TSLR2                                           0x3F0026
#define DIA_TSLR3                                           0x3F0028

#define DIA_TSHR                                            0x3F002A
#define DIA_TSHR1                                           0x3F002A
#define DIA_TSHR2                                           0x3F002C
#define DIA_TSHR3                                           0x3F002E

#define DIA_FVRA                                            0x3F0030
#define DIA_FVRA1X                                          0x3F0030
#define DIA_FVRA2X                                          0x3F0032
#define DIA_FVRA4X                                          0x3F0034

#define DIA_FVRC                                            0x3F0036
#define DIA_FVRC1X                                          0x3F0036
#define DIA_FVRC2X                                          0x3F0038
#define DIA_FVRC4X                                          0x3F003A

/*
 * Device Configuration Information (DCI) Table
 */

#define DCI_ERSIZ                                           0x3FFF00
#define DCI_WLSIZ                                           0x3FFF02
#define DCI_URSIZ                                           0x3FFF04
#define DCI_EESIZ                                           0x3FFF06
#define DCI_PCNT                                            0x3FFF08

/*
 * Register Definitions
 */

// Register: STATUS_CSHAD
#define STATUS_CSHAD STATUS_CSHAD
extern volatile unsigned char           STATUS_CSHAD        __at(0x3880);
#ifndef _LIB_BUILD
asm("STATUS_CSHAD equ 03880h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned NOT_PD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_TO                 :1;
    };
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
} STATUS_CSHADbits_t;
extern volatile STATUS_CSHADbits_t STATUS_CSHADbits __at(0x3880);
// bitfield macros

// Register: WREG_CSHAD
#define WREG_CSHAD WREG_CSHAD
extern volatile unsigned char           WREG_CSHAD          __at(0x3881);
#ifndef _LIB_BUILD
asm("WREG_CSHAD equ 03881h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} WREG_CSHADbits_t;
extern volatile WREG_CSHADbits_t WREG_CSHADbits __at(0x3881);
// bitfield macros

// Register: BSR_CSHAD
#define BSR_CSHAD BSR_CSHAD
extern volatile unsigned char           BSR_CSHAD           __at(0x3882);
#ifndef _LIB_BUILD
asm("BSR_CSHAD equ 03882h");
#endif

// Register: SHADCON
#define SHADCON SHADCON
extern volatile unsigned char           SHADCON             __at(0x3883);
#ifndef _LIB_BUILD
asm("SHADCON equ 03883h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHADLO                 :1;
    };
} SHADCONbits_t;
extern volatile SHADCONbits_t SHADCONbits __at(0x3883);
// bitfield macros

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0x3884);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 03884h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned NOT_PD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_TO                 :1;
    };
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0x3884);
// bitfield macros

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0x3885);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 03885h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} WREG_SHADbits_t;
extern volatile WREG_SHADbits_t WREG_SHADbits __at(0x3885);
// bitfield macros

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
extern volatile unsigned char           BSR_SHAD            __at(0x3886);
#ifndef _LIB_BUILD
asm("BSR_SHAD equ 03886h");
#endif

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
extern volatile unsigned char           PCLATH_SHAD         __at(0x3887);
#ifndef _LIB_BUILD
asm("PCLATH_SHAD equ 03887h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :8;
    };
} PCLATH_SHADbits_t;
