LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile PCLATH_SHADbits_t PCLATH_SHADbits __at(0x3887);
// bitfield macros

// Register: PCLATU_SHAD
#define PCLATU_SHAD PCLATU_SHAD
extern volatile unsigned char           PCLATU_SHAD         __at(0x3888);
#ifndef _LIB_BUILD
asm("PCLATU_SHAD equ 03888h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCU                    :5;
    };
} PCLATU_SHADbits_t;
extern volatile PCLATU_SHADbits_t PCLATU_SHADbits __at(0x3888);
// bitfield macros

// Register: FSR0SH
#define FSR0SH FSR0SH
extern volatile unsigned short          FSR0SH              __at(0x3889);
#ifndef _LIB_BUILD
asm("FSR0SH equ 03889h");
#endif

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
extern volatile unsigned char           FSR0L_SHAD          __at(0x3889);
#ifndef _LIB_BUILD
asm("FSR0L_SHAD equ 03889h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0L                  :8;
    };
} FSR0L_SHADbits_t;
extern volatile FSR0L_SHADbits_t FSR0L_SHADbits __at(0x3889);
// bitfield macros

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
extern volatile unsigned char           FSR0H_SHAD          __at(0x388A);
#ifndef _LIB_BUILD
asm("FSR0H_SHAD equ 0388Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0H                  :6;
    };
} FSR0H_SHADbits_t;
extern volatile FSR0H_SHADbits_t FSR0H_SHADbits __at(0x388A);
// bitfield macros

// Register: FSR1SH
#define FSR1SH FSR1SH
extern volatile unsigned short          FSR1SH              __at(0x388B);
#ifndef _LIB_BUILD
asm("FSR1SH equ 0388Bh");
#endif

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
extern volatile unsigned char           FSR1L_SHAD          __at(0x388B);
#ifndef _LIB_BUILD
asm("FSR1L_SHAD equ 0388Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1L                  :8;
    };
} FSR1L_SHADbits_t;
extern volatile FSR1L_SHADbits_t FSR1L_SHADbits __at(0x388B);
// bitfield macros

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
extern volatile unsigned char           FSR1H_SHAD          __at(0x388C);
#ifndef _LIB_BUILD
asm("FSR1H_SHAD equ 0388Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1H                  :6;
    };
} FSR1H_SHADbits_t;
extern volatile FSR1H_SHADbits_t FSR1H_SHADbits __at(0x388C);
// bitfield macros

// Register: FSR2SH
#define FSR2SH FSR2SH
extern volatile unsigned short          FSR2SH              __at(0x388D);
#ifndef _LIB_BUILD
asm("FSR2SH equ 0388Dh");
#endif

// Register: FSR2L_SHAD
#define FSR2L_SHAD FSR2L_SHAD
extern volatile unsigned char           FSR2L_SHAD          __at(0x388D);
#ifndef _LIB_BUILD
asm("FSR2L_SHAD equ 0388Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2L                  :8;
    };
} FSR2L_SHADbits_t;
extern volatile FSR2L_SHADbits_t FSR2L_SHADbits __at(0x388D);
// bitfield macros

// Register: FSR2H_SHAD
#define FSR2H_SHAD FSR2H_SHAD
extern volatile unsigned char           FSR2H_SHAD          __at(0x388E);
#ifndef _LIB_BUILD
asm("FSR2H_SHAD equ 0388Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2H                  :6;
    };
} FSR2H_SHADbits_t;
extern volatile FSR2H_SHADbits_t FSR2H_SHADbits __at(0x388E);
// bitfield macros

// Register: PRODSH
#define PRODSH PRODSH
extern volatile unsigned short          PRODSH              __at(0x388F);
#ifndef _LIB_BUILD
asm("PRODSH equ 0388Fh");
#endif

// Register: PRODL_SHAD
#define PRODL_SHAD PRODL_SHAD
extern volatile unsigned char           PRODL_SHAD          __at(0x388F);
#ifndef _LIB_BUILD
asm("PRODL_SHAD equ 0388Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRODL                  :8;
    };
} PRODL_SHADbits_t;
extern volatile PRODL_SHADbits_t PRODL_SHADbits __at(0x388F);
// bitfield macros

// Register: PRODH_SHAD
#define PRODH_SHAD PRODH_SHAD
extern volatile unsigned char           PRODH_SHAD          __at(0x3890);
#ifndef _LIB_BUILD
asm("PRODH_SHAD equ 03890h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRODH                  :8;
    };
} PRODH_SHADbits_t;
extern volatile PRODH_SHADbits_t PRODH_SHADbits __at(0x3890);
// bitfield macros

// Register: IVTADL
#define IVTADL IVTADL
extern volatile unsigned char           IVTADL              __at(0x389D);
#ifndef _LIB_BUILD
asm("IVTADL equ 0389Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD                     :8;
    };
} IVTADLbits_t;
extern volatile IVTADLbits_t IVTADLbits __at(0x389D);
// bitfield macros

// Register: IVTADH
#define IVTADH IVTADH
extern volatile unsigned char           IVTADH              __at(0x389E);
#ifndef _LIB_BUILD
asm("IVTADH equ 0389Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD                     :8;
    };
} IVTADHbits_t;
extern volatile IVTADHbits_t IVTADHbits __at(0x389E);
// bitfield macros

// Register: IVTADU
#define IVTADU IVTADU
extern volatile unsigned char           IVTADU              __at(0x389F);
#ifndef _LIB_BUILD
asm("IVTADU equ 0389Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD                     :8;
    };
} IVTADUbits_t;
extern volatile IVTADUbits_t IVTADUbits __at(0x389F);
// bitfield macros

// Register: WDTCON0
#define WDTCON0 WDTCON0
extern volatile unsigned char           WDTCON0             __at(0x395B);
#ifndef _LIB_BUILD
asm("WDTCON0 equ 0395Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEN                    :1;
        unsigned WDTPS                  :5;
    };
    struct {
        unsigned SWDTEN                 :1;
    };
    struct {
        unsigned WDTSEN                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WDTPS0                 :1;
        unsigned WDTPS1                 :1;
        unsigned WDTPS2                 :1;
        unsigned WDTPS3                 :1;
        unsigned WDTPS4                 :1;
    };
} WDTCON0bits_t;
