LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: SCANHADR
#define SCANHADR SCANHADR
#ifndef __CCI__
extern volatile __uint24                SCANHADR            __at(0x3979);
#endif
#ifndef _LIB_BUILD
asm("SCANHADR equ 03979h");
#endif

// Register: SCANHADRL
#define SCANHADRL SCANHADRL
extern volatile unsigned char           SCANHADRL           __at(0x3979);
#ifndef _LIB_BUILD
asm("SCANHADRL equ 03979h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HADR                   :8;
    };
    struct {
        unsigned HADR0                  :1;
        unsigned HADR1                  :1;
        unsigned HADR2                  :1;
        unsigned HADR3                  :1;
        unsigned HADR4                  :1;
        unsigned HADR5                  :1;
        unsigned HADR6                  :1;
        unsigned HADR7                  :1;
    };
    struct {
        unsigned SCANHADR               :8;
    };
    struct {
        unsigned SCANHADR0              :1;
        unsigned SCANHADR1              :1;
        unsigned SCANHADR2              :1;
        unsigned SCANHADR3              :1;
        unsigned SCANHADR4              :1;
        unsigned SCANHADR5              :1;
        unsigned SCANHADR6              :1;
        unsigned SCANHADR7              :1;
    };
} SCANHADRLbits_t;
extern volatile SCANHADRLbits_t SCANHADRLbits __at(0x3979);
// bitfield macros

// Register: SCANHADRH
#define SCANHADRH SCANHADRH
extern volatile unsigned char           SCANHADRH           __at(0x397A);
#ifndef _LIB_BUILD
asm("SCANHADRH equ 0397Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HADR                   :8;
    };
    struct {
        unsigned HADR8                  :1;
        unsigned HADR9                  :1;
        unsigned HADR10                 :1;
        unsigned HADR11                 :1;
        unsigned HADR12                 :1;
        unsigned HADR13                 :1;
        unsigned HADR14                 :1;
        unsigned HADR15                 :1;
    };
    struct {
        unsigned SCANHADR               :8;
    };
    struct {
        unsigned SCANHADR8              :1;
        unsigned SCANHADR9              :1;
        unsigned SCANHADR10             :1;
        unsigned SCANHADR11             :1;
        unsigned SCANHADR12             :1;
        unsigned SCANHADR13             :1;
        unsigned SCANHADR14             :1;
        unsigned SCANHADR15             :1;
    };
} SCANHADRHbits_t;
extern volatile SCANHADRHbits_t SCANHADRHbits __at(0x397A);
// bitfield macros

// Register: SCANHADRU
#define SCANHADRU SCANHADRU
extern volatile unsigned char           SCANHADRU           __at(0x397B);
#ifndef _LIB_BUILD
asm("SCANHADRU equ 0397Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HADR                   :6;
    };
    struct {
        unsigned HADR16                 :1;
        unsigned HADR17                 :1;
        unsigned HADR18                 :1;
        unsigned HADR19                 :1;
        unsigned HADR20                 :1;
        unsigned HADR21                 :1;
    };
    struct {
        unsigned SCANHADR               :6;
    };
    struct {
        unsigned SCANHADR16             :1;
        unsigned SCANHADR17             :1;
        unsigned SCANHADR18             :1;
        unsigned SCANHADR19             :1;
        unsigned SCANHADR20             :1;
        unsigned SCANHADR21             :1;
    };
} SCANHADRUbits_t;
extern volatile SCANHADRUbits_t SCANHADRUbits __at(0x397B);
// bitfield macros

// Register: SCANCON0
#define SCANCON0 SCANCON0
extern volatile unsigned char           SCANCON0            __at(0x397C);
#ifndef _LIB_BUILD
asm("SCANCON0 equ 0397Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUSY                   :1;
        unsigned BURSTMD                :1;
        unsigned MREG                   :1;
        unsigned                        :2;
        unsigned SGO                    :1;
        unsigned TRIGEN                 :1;
        unsigned EN                     :1;
    };
} SCANCON0bits_t;
extern volatile SCANCON0bits_t SCANCON0bits __at(0x397C);
// bitfield macros

// Register: SCANTRIG
#define SCANTRIG SCANTRIG
extern volatile unsigned char           SCANTRIG            __at(0x397D);
#ifndef _LIB_BUILD
asm("SCANTRIG equ 0397Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TSEL                   :4;
    };
} SCANTRIGbits_t;
extern volatile SCANTRIGbits_t SCANTRIGbits __at(0x397D);
// bitfield macros

// Register: IPR0
#define IPR0 IPR0
extern volatile unsigned char           IPR0                __at(0x3980);
#ifndef _LIB_BUILD
asm("IPR0 equ 03980h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIP                   :1;
        unsigned HLVDIP                 :1;
        unsigned OSFIP                  :1;
        unsigned CSWIP                  :1;
        unsigned NVMIP                  :1;
        unsigned SCANIP                 :1;
        unsigned CRCIP                  :1;
        unsigned IOCIP                  :1;
    };
} IPR0bits_t;
extern volatile IPR0bits_t IPR0bits __at(0x3980);
// bitfield macros

// Register: IPR1
#define IPR1 IPR1
extern volatile unsigned char           IPR1                __at(0x3981);
#ifndef _LIB_BUILD
asm("IPR1 equ 03981h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IP                 :1;
        unsigned ZCDIP                  :1;
        unsigned ADIP                   :1;
        unsigned ADTIP                  :1;
        unsigned C1IP                   :1;
        unsigned SMT1IP                 :1;
        unsigned SMT1PRAIP              :1;
        unsigned SMT1PWAIP              :1;
    };
    struct {
        unsigned                        :4;
        unsigned TX1IP                  :1;
        unsigned RC1IP                  :1;
        unsigned                        :1;
        unsigned PSPIP                  :1;
    };
} IPR1bits_t;
