LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile IPR1bits_t IPR1bits __at(0x3981);
// bitfield macros

// Register: IPR2
#define IPR2 IPR2
extern volatile unsigned char           IPR2                __at(0x3982);
#ifndef _LIB_BUILD
asm("IPR2 equ 03982h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA1SCNTIP             :1;
        unsigned DMA1DCNTIP             :1;
        unsigned DMA1ORIP               :1;
        unsigned DMA1AIP                :1;
        unsigned SPI1RXIP               :1;
        unsigned SPI1TXIP               :1;
        unsigned SPI1IP                 :1;
        unsigned I2C1RXIP               :1;
    };
    struct {
        unsigned                        :6;
        unsigned CMIP                   :1;
    };
} IPR2bits_t;
extern volatile IPR2bits_t IPR2bits __at(0x3982);
// bitfield macros

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0x3983);
#ifndef _LIB_BUILD
asm("IPR3 equ 03983h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1TXIP               :1;
        unsigned I2C1IP                 :1;
        unsigned I2C1EIP                :1;
        unsigned U1RXIP                 :1;
        unsigned U1TXIP                 :1;
        unsigned U1EIP                  :1;
        unsigned U1IP                   :1;
        unsigned TMR0IP                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIP                 :1;
        unsigned                        :2;
        unsigned TXBNIP                 :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0x3983);
// bitfield macros

// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0x3984);
#ifndef _LIB_BUILD
asm("IPR4 equ 03984h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IP                 :1;
        unsigned TMR1GIP                :1;
        unsigned TMR2IP                 :1;
        unsigned CCP1IP                 :1;
        unsigned                        :1;
        unsigned NCO1IP                 :1;
        unsigned CWG1IP                 :1;
        unsigned CLC1IP                 :1;
    };
    struct {
        unsigned CCIP3IP                :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0x3984);
// bitfield macros

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0x3985);
#ifndef _LIB_BUILD
asm("IPR5 equ 03985h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IP                 :1;
        unsigned C2IP                   :1;
        unsigned DMA2SCNTIP             :1;
        unsigned DMA2DCNTIP             :1;
        unsigned DMA2ORIP               :1;
        unsigned DMA2AIP                :1;
        unsigned I2C2RXIP               :1;
        unsigned I2C2TXIP               :1;
    };
    struct {
        unsigned CCH05                  :1;
        unsigned CCH15                  :1;
        unsigned                        :1;
        unsigned EVPOL05                :1;
        unsigned EVPOL15                :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0x3985);
// bitfield macros

// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0x3986);
#ifndef _LIB_BUILD
asm("IPR6 equ 03986h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2IP                 :1;
        unsigned I2C2EIP                :1;
        unsigned U2RXIP                 :1;
        unsigned U2TXIP                 :1;
        unsigned U2EIP                  :1;
        unsigned U2IP                   :1;
        unsigned TMR3IP                 :1;
        unsigned TMR3GIP                :1;
    };
} IPR6bits_t;
extern volatile IPR6bits_t IPR6bits __at(0x3986);
// bitfield macros

// Register: IPR7
#define IPR7 IPR7
extern volatile unsigned char           IPR7                __at(0x3987);
#ifndef _LIB_BUILD
asm("IPR7 equ 03987h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IP                 :1;
        unsigned CCP2IP                 :1;
        unsigned                        :1;
        unsigned CWG2IP                 :1;
        unsigned CLC2IP                 :1;
        unsigned INT2IP                 :1;
    };
} IPR7bits_t;
extern volatile IPR7bits_t IPR7bits __at(0x3987);
// bitfield macros

// Register: IPR8
#define IPR8 IPR8
extern volatile unsigned char           IPR8                __at(0x3988);
#ifndef _LIB_BUILD
asm("IPR8 equ 03988h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned TMR5IP                 :1;
        unsigned TMR5GIP                :1;
    };
} IPR8bits_t;
extern volatile IPR8bits_t IPR8bits __at(0x3988);
// bitfield macros

// Register: IPR9
#define IPR9 IPR9
extern volatile unsigned char           IPR9                __at(0x3989);
#ifndef _LIB_BUILD
asm("IPR9 equ 03989h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR6IP                 :1;
        unsigned CCP3IP                 :1;
        unsigned CWG3IP                 :1;
        unsigned CLC3IP                 :1;
    };
} IPR9bits_t;
extern volatile IPR9bits_t IPR9bits __at(0x3989);
// bitfield macros

// Register: IPR10
#define IPR10 IPR10
extern volatile unsigned char           IPR10               __at(0x398A);
#ifndef _LIB_BUILD
asm("IPR10 equ 0398Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4IP                 :1;
        unsigned CLC4IP                 :1;
    };
} IPR10bits_t;
extern volatile IPR10bits_t IPR10bits __at(0x398A);
// bitfield macros

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x3990);
#ifndef _LIB_BUILD
asm("PIE0 equ 03990h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIE                   :1;
        unsigned HLVDIE                 :1;
        unsigned OSFIE                  :1;
        unsigned CSWIE                  :1;
        unsigned NVMIE                  :1;
        unsigned SCANIE                 :1;
        unsigned CRCIE                  :1;
        unsigned IOCIE                  :1;
    };
} PIE0bits_t;
extern volatile PIE0bits_t PIE0bits __at(0x3990);
// bitfield macros

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x3991);
#ifndef _LIB_BUILD
asm("PIE1 equ 03991h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IE                 :1;
        unsigned ZCDIE                  :1;
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
        unsigned C1IE                   :1;
        unsigned SMT1IE                 :1;
        unsigned SMT1PRAIE              :1;
        unsigned SMT1PWAIE              :1;
    };
    struct {
        unsigned                        :4;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
        unsigned                        :1;
        unsigned PSPIE                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXIE                   :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x3991);
// bitfield macros

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0x3992);
#ifndef _LIB_BUILD
asm("PIE2 equ 03992h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA1SCNTIE             :1;
        unsigned DMA1DCNTIE             :1;
        unsigned DMA1ORIE               :1;
        unsigned DMA1AIE                :1;
        unsigned SPI1RXIE               :1;
        unsigned SPI1TXIE               :1;
        unsigned SPI1IE                 :1;
        unsigned I2C1RXIE               :1;
    };
    struct {
        unsigned                        :6;
        unsigned CMIE                   :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0x3992);
// bitfield macros

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0x3993);
#ifndef _LIB_BUILD
asm("PIE3 equ 03993h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1TXIE               :1;
        unsigned I2C1IE                 :1;
        unsigned I2C1EIE                :1;
        unsigned U1RXIE                 :1;
        unsigned U1TXIE                 :1;
        unsigned U1EIE                  :1;
        unsigned U1IE                   :1;
        unsigned TMR0IE                 :1;
    };
    struct {
        unsigned RXB0IE                 :1;
        unsigned RXB1IE                 :1;
        unsigned TXB0IE                 :1;
        unsigned TXB1IE                 :1;
        unsigned TXB2IE                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIE                 :1;
        unsigned                        :2;
        unsigned TXBNIE                 :1;
    };
} PIE3bits_t;
extern volatile PIE3bits_t PIE3bits __at(0x3993);
// bitfield macros

