LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x3994);
#ifndef _LIB_BUILD
asm("PIE4 equ 03994h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IE                 :1;
        unsigned TMR1GIE                :1;
        unsigned TMR2IE                 :1;
        unsigned CCP1IE                 :1;
        unsigned                        :1;
        unsigned NCO1IE                 :1;
        unsigned CWG1IE                 :1;
        unsigned CLC1IE                 :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x3994);
// bitfield macros

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0x3995);
#ifndef _LIB_BUILD
asm("PIE5 equ 03995h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IE                 :1;
        unsigned C2IE                   :1;
        unsigned DMA2SCNTIE             :1;
        unsigned DMA2DCNTIE             :1;
        unsigned DMA2ORIE               :1;
        unsigned DMA2AIE                :1;
        unsigned I2C2RXIE               :1;
        unsigned I2C2TXIE               :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0x3995);
// bitfield macros

// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x3996);
#ifndef _LIB_BUILD
asm("PIE6 equ 03996h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2IE                 :1;
        unsigned I2C2EIE                :1;
        unsigned U2RXIE                 :1;
        unsigned U2TXIE                 :1;
        unsigned U2EIE                  :1;
        unsigned U2IE                   :1;
        unsigned TMR3IE                 :1;
        unsigned TMR3GIE                :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x3996);
// bitfield macros

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0x3997);
#ifndef _LIB_BUILD
asm("PIE7 equ 03997h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IE                 :1;
        unsigned CCP2IE                 :1;
        unsigned                        :1;
        unsigned CWG2IE                 :1;
        unsigned CLC2IE                 :1;
        unsigned INT2IE                 :1;
    };
} PIE7bits_t;
extern volatile PIE7bits_t PIE7bits __at(0x3997);
// bitfield macros

// Register: PIE8
#define PIE8 PIE8
extern volatile unsigned char           PIE8                __at(0x3998);
#ifndef _LIB_BUILD
asm("PIE8 equ 03998h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned TMR5IE                 :1;
        unsigned TMR5GIE                :1;
    };
} PIE8bits_t;
extern volatile PIE8bits_t PIE8bits __at(0x3998);
// bitfield macros

// Register: PIE9
#define PIE9 PIE9
extern volatile unsigned char           PIE9                __at(0x3999);
#ifndef _LIB_BUILD
asm("PIE9 equ 03999h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR6IE                 :1;
        unsigned CCP3IE                 :1;
        unsigned CWG3IE                 :1;
        unsigned CLC3IE                 :1;
    };
} PIE9bits_t;
extern volatile PIE9bits_t PIE9bits __at(0x3999);
// bitfield macros

// Register: PIE10
#define PIE10 PIE10
extern volatile unsigned char           PIE10               __at(0x399A);
#ifndef _LIB_BUILD
asm("PIE10 equ 0399Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4IE                 :1;
        unsigned CLC4IE                 :1;
    };
} PIE10bits_t;
extern volatile PIE10bits_t PIE10bits __at(0x399A);
// bitfield macros

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0x39A0);
#ifndef _LIB_BUILD
asm("PIR0 equ 039A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIF                   :1;
        unsigned HLVDIF                 :1;
        unsigned OSFIF                  :1;
        unsigned CSWIF                  :1;
        unsigned NVMIF                  :1;
        unsigned SCANIF                 :1;
        unsigned CRCIF                  :1;
        unsigned IOCIF                  :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0x39A0);
// bitfield macros

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x39A1);
#ifndef _LIB_BUILD
asm("PIR1 equ 039A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IF                 :1;
        unsigned ZCDIF                  :1;
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
        unsigned C1IF                   :1;
        unsigned SMT1IF                 :1;
        unsigned SMT1PRAIF              :1;
        unsigned SMT1PWAIF              :1;
    };
    struct {
        unsigned                        :4;
        unsigned TX1IF                  :1;
        unsigned RC1IF                  :1;
        unsigned                        :1;
        unsigned PSPIF                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXIF                   :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x39A1);
// bitfield macros

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x39A2);
#ifndef _LIB_BUILD
asm("PIR2 equ 039A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA1SCNTIF             :1;
        unsigned DMA1DCNTIF             :1;
        unsigned DMA1ORIF               :1;
        unsigned DMA1AIF                :1;
        unsigned SPI1RXIF               :1;
        unsigned SPI1TXIF               :1;
        unsigned SPI1IF                 :1;
        unsigned I2C1RXIF               :1;
    };
    struct {
        unsigned                        :6;
        unsigned CMIF                   :1;
    };
} PIR2bits_t;
