LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile PIR2bits_t PIR2bits __at(0x39A2);
// bitfield macros

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x39A3);
#ifndef _LIB_BUILD
asm("PIR3 equ 039A3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1TXIF               :1;
        unsigned I2C1IF                 :1;
        unsigned I2C1EIF                :1;
        unsigned U1RXIF                 :1;
        unsigned U1TXIF                 :1;
        unsigned U1EIF                  :1;
        unsigned U1IF                   :1;
        unsigned TMR0IF                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIF                 :1;
        unsigned                        :2;
        unsigned TXBNIF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x39A3);
// bitfield macros

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x39A4);
#ifndef _LIB_BUILD
asm("PIR4 equ 039A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR1GIF                :1;
        unsigned TMR2IF                 :1;
        unsigned CCP1IF                 :1;
        unsigned                        :1;
        unsigned NCO1IF                 :1;
        unsigned CWG1IF                 :1;
        unsigned CLC1IF                 :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x39A4);
// bitfield macros

// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x39A5);
#ifndef _LIB_BUILD
asm("PIR5 equ 039A5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IF                 :1;
        unsigned C2IF                   :1;
        unsigned DMA2SCNTIF             :1;
        unsigned DMA2DCNTIF             :1;
        unsigned DMA2ORIF               :1;
        unsigned DMA2AIF                :1;
        unsigned I2C2RXIF               :1;
        unsigned I2C2TXIF               :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x39A5);
// bitfield macros

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x39A6);
#ifndef _LIB_BUILD
asm("PIR6 equ 039A6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2IF                 :1;
        unsigned I2C2EIF                :1;
        unsigned U2RXIF                 :1;
        unsigned U2TXIF                 :1;
        unsigned U2EIF                  :1;
        unsigned U2IF                   :1;
        unsigned TMR3IF                 :1;
        unsigned TMR3GIF                :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x39A6);
// bitfield macros

// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0x39A7);
#ifndef _LIB_BUILD
asm("PIR7 equ 039A7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IF                 :1;
        unsigned CCP2IF                 :1;
        unsigned                        :1;
        unsigned CWG2IF                 :1;
        unsigned CLC2IF                 :1;
        unsigned INT2IF                 :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0x39A7);
// bitfield macros

// Register: PIR8
#define PIR8 PIR8
extern volatile unsigned char           PIR8                __at(0x39A8);
#ifndef _LIB_BUILD
asm("PIR8 equ 039A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned TMR5IF                 :1;
        unsigned TMR5GIF                :1;
    };
} PIR8bits_t;
extern volatile PIR8bits_t PIR8bits __at(0x39A8);
// bitfield macros

// Register: PIR9
#define PIR9 PIR9
extern volatile unsigned char           PIR9                __at(0x39A9);
#ifndef _LIB_BUILD
asm("PIR9 equ 039A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR6IF                 :1;
        unsigned CCP3IF                 :1;
        unsigned CWG3IF                 :1;
        unsigned CLC3IF                 :1;
    };
} PIR9bits_t;
extern volatile PIR9bits_t PIR9bits __at(0x39A9);
// bitfield macros

// Register: PIR10
#define PIR10 PIR10
extern volatile unsigned char           PIR10               __at(0x39AA);
#ifndef _LIB_BUILD
asm("PIR10 equ 039AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4IF                 :1;
        unsigned CLC4IF                 :1;
    };
} PIR10bits_t;
extern volatile PIR10bits_t PIR10bits __at(0x39AA);
// bitfield macros

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0x39C0);
#ifndef _LIB_BUILD
asm("PMD0 equ 039C0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCMD                  :1;
        unsigned CLKRMD                 :1;
        unsigned NVMMD                  :1;
        unsigned SCANMD                 :1;
        unsigned CRCMD                  :1;
        unsigned HLVDMD                 :1;
        unsigned FVRMD                  :1;
        unsigned SYSCMD                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0x39C0);
// bitfield macros

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0x39C1);
#ifndef _LIB_BUILD
asm("PMD1 equ 039C1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0MD                 :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned NCO1MD                 :1;
    };
    struct {
        unsigned EMBMD                  :1;
    };
} PMD1bits_t;
