LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile PMD1bits_t PMD1bits __at(0x39C1);
// bitfield macros

// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0x39C2);
#ifndef _LIB_BUILD
asm("PMD2 equ 039C2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCDMD                  :1;
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned                        :2;
        unsigned ADCMD                  :1;
        unsigned DACMD                  :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0x39C2);
// bitfield macros

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0x39C3);
#ifndef _LIB_BUILD
asm("PMD3 equ 039C3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned CCP3MD                 :1;
        unsigned CCP4MD                 :1;
        unsigned PWM5MD                 :1;
        unsigned PWM6MD                 :1;
        unsigned PWM7MD                 :1;
        unsigned PWM8MD                 :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0x39C3);
// bitfield macros

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0x39C4);
#ifndef _LIB_BUILD
asm("PMD4 equ 039C4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned CWG1MD                 :1;
        unsigned CWG2MD                 :1;
        unsigned CWG3MD                 :1;
    };
} PMD4bits_t;
extern volatile PMD4bits_t PMD4bits __at(0x39C4);
// bitfield macros

// Register: PMD5
#define PMD5 PMD5
extern volatile unsigned char           PMD5                __at(0x39C5);
#ifndef _LIB_BUILD
asm("PMD5 equ 039C5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1MD                 :1;
        unsigned I2C2MD                 :1;
        unsigned SPI1MD                 :1;
        unsigned                        :1;
        unsigned U1MD                   :1;
        unsigned U2MD                   :1;
    };
} PMD5bits_t;
extern volatile PMD5bits_t PMD5bits __at(0x39C5);
// bitfield macros

// Register: PMD6
#define PMD6 PMD6
extern volatile unsigned char           PMD6                __at(0x39C6);
#ifndef _LIB_BUILD
asm("PMD6 equ 039C6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSMMD                  :1;
        unsigned CLC1MD                 :1;
        unsigned CLC2MD                 :1;
        unsigned CLC3MD                 :1;
        unsigned CLC4MD                 :1;
        unsigned SMT1MD                 :1;
    };
} PMD6bits_t;
extern volatile PMD6bits_t PMD6bits __at(0x39C6);
// bitfield macros

// Register: PMD7
#define PMD7 PMD7
extern volatile unsigned char           PMD7                __at(0x39C7);
#ifndef _LIB_BUILD
asm("PMD7 equ 039C7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA1MD                 :1;
        unsigned DMA2MD                 :1;
    };
} PMD7bits_t;
extern volatile PMD7bits_t PMD7bits __at(0x39C7);
// bitfield macros

// Register: BORCON
#define BORCON BORCON
extern volatile unsigned char           BORCON              __at(0x39D0);
#ifndef _LIB_BUILD
asm("BORCON equ 039D0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BORRDY                 :1;
        unsigned                        :6;
        unsigned SBOREN                 :1;
    };
} BORCONbits_t;
extern volatile BORCONbits_t BORCONbits __at(0x39D0);
// bitfield macros

// Register: VREGCON
#define VREGCON VREGCON
extern volatile unsigned char           VREGCON             __at(0x39D1);
#ifndef _LIB_BUILD
asm("VREGCON equ 039D1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned VREGPM                 :1;
    };
} VREGCONbits_t;
extern volatile VREGCONbits_t VREGCONbits __at(0x39D1);
// bitfield macros

// Register: CPUDOZE
#define CPUDOZE CPUDOZE
extern volatile unsigned char           CPUDOZE             __at(0x39D8);
#ifndef _LIB_BUILD
asm("CPUDOZE equ 039D8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DOZE                   :3;
        unsigned                        :1;
        unsigned DOE                    :1;
        unsigned ROI                    :1;
        unsigned DOZEN                  :1;
        unsigned IDLEN                  :1;
    };
    struct {
        unsigned DOZE0                  :1;
        unsigned DOZE1                  :1;
        unsigned DOZE2                  :1;
    };
} CPUDOZEbits_t;
extern volatile CPUDOZEbits_t CPUDOZEbits __at(0x39D8);
// bitfield macros

// Register: OSCCON1
#define OSCCON1 OSCCON1
extern volatile unsigned char           OSCCON1             __at(0x39D9);
#ifndef _LIB_BUILD
asm("OSCCON1 equ 039D9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NDIV                   :4;
        unsigned NOSC                   :3;
    };
    struct {
        unsigned NDIV0                  :1;
        unsigned NDIV1                  :1;
        unsigned NDIV2                  :1;
        unsigned NDIV3                  :1;
        unsigned NOSC0                  :1;
        unsigned NOSC1                  :1;
        unsigned NOSC2                  :1;
    };
} OSCCON1bits_t;
extern volatile OSCCON1bits_t OSCCON1bits __at(0x39D9);
// bitfield macros

// Register: OSCCON2
#define OSCCON2 OSCCON2
extern volatile unsigned char           OSCCON2             __at(0x39DA);
#ifndef _LIB_BUILD
asm("OSCCON2 equ 039DAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CDIV                   :4;
        unsigned COSC                   :3;
    };
    struct {
        unsigned CDIV0                  :1;
        unsigned CDIV1                  :1;
        unsigned CDIV2                  :1;
        unsigned CDIV3                  :1;
        unsigned COSC0                  :1;
        unsigned COSC1                  :1;
        unsigned COSC2                  :1;
    };
} OSCCON2bits_t;
