LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile OSCCON2bits_t OSCCON2bits __at(0x39DA);
// bitfield macros

// Register: OSCCON3
#define OSCCON3 OSCCON3
extern volatile unsigned char           OSCCON3             __at(0x39DB);
#ifndef _LIB_BUILD
asm("OSCCON3 equ 039DBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned NOSCR                  :1;
        unsigned ORDY                   :1;
        unsigned                        :1;
        unsigned SOSCPWR                :1;
        unsigned CSWHOLD                :1;
    };
} OSCCON3bits_t;
extern volatile OSCCON3bits_t OSCCON3bits __at(0x39DB);
// bitfield macros

// Register: OSCSTAT
#define OSCSTAT OSCSTAT
extern volatile unsigned char           OSCSTAT             __at(0x39DC);
#ifndef _LIB_BUILD
asm("OSCSTAT equ 039DCh");
#endif
// aliases
extern volatile unsigned char           OSCSTAT1            __at(0x39DC);
#ifndef _LIB_BUILD
asm("OSCSTAT1 equ 039DCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLLR                   :1;
        unsigned                        :1;
        unsigned ADOR                   :1;
        unsigned SOR                    :1;
        unsigned LFOR                   :1;
        unsigned MFOR                   :1;
        unsigned HFOR                   :1;
        unsigned EXTOR                  :1;
    };
} OSCSTATbits_t;
extern volatile OSCSTATbits_t OSCSTATbits __at(0x39DC);
// bitfield macros
// alias bitfield definitions
typedef union {
    struct {
        unsigned PLLR                   :1;
        unsigned                        :1;
        unsigned ADOR                   :1;
        unsigned SOR                    :1;
        unsigned LFOR                   :1;
        unsigned MFOR                   :1;
        unsigned HFOR                   :1;
        unsigned EXTOR                  :1;
    };
} OSCSTAT1bits_t;
extern volatile OSCSTAT1bits_t OSCSTAT1bits __at(0x39DC);
// bitfield macros

// Register: OSCEN
#define OSCEN OSCEN
extern volatile unsigned char           OSCEN               __at(0x39DD);
#ifndef _LIB_BUILD
asm("OSCEN equ 039DDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ADOEN                  :1;
        unsigned SOSCEN                 :1;
        unsigned LFOEN                  :1;
        unsigned MFOEN                  :1;
        unsigned HFOEN                  :1;
        unsigned EXTOEN                 :1;
    };
} OSCENbits_t;
extern volatile OSCENbits_t OSCENbits __at(0x39DD);
// bitfield macros

// Register: OSCTUNE
#define OSCTUNE OSCTUNE
extern volatile unsigned char           OSCTUNE             __at(0x39DE);
#ifndef _LIB_BUILD
asm("OSCTUNE equ 039DEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TUN                    :6;
    };
    struct {
        unsigned TUN0                   :1;
        unsigned TUN1                   :1;
        unsigned TUN2                   :1;
        unsigned TUN3                   :1;
        unsigned TUN4                   :1;
        unsigned TUN5                   :1;
    };
    struct {
        unsigned HFTUN                  :6;
    };
    struct {
        unsigned HFTUN0                 :1;
        unsigned HFTUN1                 :1;
        unsigned HFTUN2                 :1;
        unsigned HFTUN3                 :1;
        unsigned HFTUN4                 :1;
        unsigned HFTUN5                 :1;
    };
} OSCTUNEbits_t;
extern volatile OSCTUNEbits_t OSCTUNEbits __at(0x39DE);
// bitfield macros

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
extern volatile unsigned char           OSCFRQ              __at(0x39DF);
#ifndef _LIB_BUILD
asm("OSCFRQ equ 039DFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FRQ                    :4;
    };
    struct {
        unsigned FRQ0                   :1;
        unsigned FRQ1                   :1;
        unsigned FRQ2                   :1;
        unsigned FRQ3                   :1;
    };
    struct {
        unsigned HFFRQ                  :4;
    };
    struct {
        unsigned HFFRQ0                 :1;
        unsigned HFFRQ1                 :1;
        unsigned HFFRQ2                 :1;
        unsigned HFFRQ3                 :1;
    };
} OSCFRQbits_t;
extern volatile OSCFRQbits_t OSCFRQbits __at(0x39DF);
// bitfield macros

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x39E0);
#ifndef _LIB_BUILD
asm("NVMADRL equ 039E0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
    struct {
        unsigned ADR0                   :1;
        unsigned ADR1                   :1;
        unsigned ADR2                   :1;
        unsigned ADR3                   :1;
        unsigned ADR4                   :1;
        unsigned ADR5                   :1;
        unsigned ADR6                   :1;
        unsigned ADR7                   :1;
    };
    struct {
        unsigned NVMADR                 :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x39E0);
// bitfield macros

// Register: NVMADRH
#define NVMADRH NVMADRH
extern volatile unsigned char           NVMADRH             __at(0x39E1);
#ifndef _LIB_BUILD
asm("NVMADRH equ 039E1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :2;
    };
    struct {
        unsigned ADR8                   :1;
        unsigned ADR9                   :1;
    };
    struct {
        unsigned NVMADR                 :2;
    };
    struct {
        unsigned NVMADR8                :1;
        unsigned NVMADR9                :1;
    };
} NVMADRHbits_t;
extern volatile NVMADRHbits_t NVMADRHbits __at(0x39E1);
// bitfield macros

// Register: NVMDAT
#define NVMDAT NVMDAT
extern volatile unsigned char           NVMDAT              __at(0x39E3);
#ifndef _LIB_BUILD
asm("NVMDAT equ 039E3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAT                    :8;
    };
    struct {
        unsigned DAT0                   :1;
        unsigned DAT1                   :1;
        unsigned DAT2                   :1;
        unsigned DAT3                   :1;
        unsigned DAT4                   :1;
        unsigned DAT5                   :1;
        unsigned DAT6                   :1;
        unsigned DAT7                   :1;
    };
    struct {
        unsigned NVMDAT                 :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
} NVMDATbits_t;
extern volatile NVMDATbits_t NVMDATbits __at(0x39E3);
// bitfield macros

// Register: NVMCON1
#define NVMCON1 NVMCON1
extern volatile unsigned char           NVMCON1             __at(0x39E5);
#ifndef _LIB_BUILD
asm("NVMCON1 equ 039E5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
        unsigned                        :1;
        unsigned REG                    :2;
    };
    struct {
        unsigned                        :6;
        unsigned REG0                   :1;
        unsigned REG1                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned NVMREG                 :2;
    };
    struct {
        unsigned                        :6;
        unsigned NVMREG0                :1;
        unsigned NVMREG1                :1;
    };
} NVMCON1bits_t;
extern volatile NVMCON1bits_t NVMCON1bits __at(0x39E5);
// bitfield macros

// Register: NVMCON2
#define NVMCON2 NVMCON2
extern volatile unsigned char           NVMCON2             __at(0x39E6);
#ifndef _LIB_BUILD
asm("NVMCON2 equ 039E6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMCON2                :8;
    };
} NVMCON2bits_t;
