LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile NVMCON2bits_t NVMCON2bits __at(0x39E6);
// bitfield macros

// Register: PRLOCK
#define PRLOCK PRLOCK
extern volatile unsigned char           PRLOCK              __at(0x39EF);
#ifndef _LIB_BUILD
asm("PRLOCK equ 039EFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRLOCKED               :1;
    };
} PRLOCKbits_t;
extern volatile PRLOCKbits_t PRLOCKbits __at(0x39EF);
// bitfield macros

// Register: ISRPR
#define ISRPR ISRPR
extern volatile unsigned char           ISRPR               __at(0x39F1);
#ifndef _LIB_BUILD
asm("ISRPR equ 039F1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned ISRPR                  :3;
    };
    struct {
        unsigned ISRPR0                 :1;
        unsigned ISRPR1                 :1;
        unsigned ISRPR2                 :1;
    };
} ISRPRbits_t;
extern volatile ISRPRbits_t ISRPRbits __at(0x39F1);
// bitfield macros

// Register: MAINPR
#define MAINPR MAINPR
extern volatile unsigned char           MAINPR              __at(0x39F2);
#ifndef _LIB_BUILD
asm("MAINPR equ 039F2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned MAINPR                 :3;
    };
    struct {
        unsigned MAINPR0                :1;
        unsigned MAINPR1                :1;
        unsigned MAINPR2                :1;
    };
} MAINPRbits_t;
extern volatile MAINPRbits_t MAINPRbits __at(0x39F2);
// bitfield macros

// Register: DMA1PR
#define DMA1PR DMA1PR
extern volatile unsigned char           DMA1PR              __at(0x39F3);
#ifndef _LIB_BUILD
asm("DMA1PR equ 039F3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA1PR                 :3;
    };
    struct {
        unsigned DMA1PR0                :1;
        unsigned DMA1PR1                :1;
        unsigned DMA1PR2                :1;
    };
} DMA1PRbits_t;
extern volatile DMA1PRbits_t DMA1PRbits __at(0x39F3);
// bitfield macros

// Register: DMA2PR
#define DMA2PR DMA2PR
extern volatile unsigned char           DMA2PR              __at(0x39F4);
#ifndef _LIB_BUILD
asm("DMA2PR equ 039F4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA2PR                 :3;
    };
    struct {
        unsigned DMA2PR0                :1;
        unsigned DMA2PR1                :1;
        unsigned DMA2PR2                :1;
    };
} DMA2PRbits_t;
extern volatile DMA2PRbits_t DMA2PRbits __at(0x39F4);
// bitfield macros

// Register: SCANPR
#define SCANPR SCANPR
extern volatile unsigned char           SCANPR              __at(0x39F7);
#ifndef _LIB_BUILD
asm("SCANPR equ 039F7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned SCANPR                 :3;
    };
    struct {
        unsigned SCANPR0                :1;
        unsigned SCANPR1                :1;
        unsigned SCANPR2                :1;
    };
} SCANPRbits_t;
extern volatile SCANPRbits_t SCANPRbits __at(0x39F7);
// bitfield macros

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0x3A00);
#ifndef _LIB_BUILD
asm("RA0PPS equ 03A00h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
        unsigned RA0PPS4                :1;
        unsigned RA0PPS5                :1;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0x3A00);
// bitfield macros

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0x3A01);
#ifndef _LIB_BUILD
asm("RA1PPS equ 03A01h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS0                :1;
        unsigned RA1PPS1                :1;
        unsigned RA1PPS2                :1;
        unsigned RA1PPS3                :1;
        unsigned RA1PPS4                :1;
        unsigned RA1PPS5                :1;
    };
} RA1PPSbits_t;
extern volatile RA1PPSbits_t RA1PPSbits __at(0x3A01);
// bitfield macros

// Register: RA2PPS
#define RA2PPS RA2PPS
extern volatile unsigned char           RA2PPS              __at(0x3A02);
#ifndef _LIB_BUILD
asm("RA2PPS equ 03A02h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA2PPS0                :1;
        unsigned RA2PPS1                :1;
        unsigned RA2PPS2                :1;
        unsigned RA2PPS3                :1;
        unsigned RA2PPS4                :1;
        unsigned RA2PPS5                :1;
    };
} RA2PPSbits_t;
extern volatile RA2PPSbits_t RA2PPSbits __at(0x3A02);
// bitfield macros

// Register: RA3PPS
#define RA3PPS RA3PPS
extern volatile unsigned char           RA3PPS              __at(0x3A03);
#ifndef _LIB_BUILD
asm("RA3PPS equ 03A03h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA3PPS0                :1;
        unsigned RA3PPS1                :1;
        unsigned RA3PPS2                :1;
        unsigned RA3PPS3                :1;
        unsigned RA3PPS4                :1;
        unsigned RA3PPS5                :1;
    };
} RA3PPSbits_t;
extern volatile RA3PPSbits_t RA3PPSbits __at(0x3A03);
// bitfield macros

// Register: RA4PPS
#define RA4PPS RA4PPS
extern volatile unsigned char           RA4PPS              __at(0x3A04);
#ifndef _LIB_BUILD
asm("RA4PPS equ 03A04h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA4PPS0                :1;
        unsigned RA4PPS1                :1;
        unsigned RA4PPS2                :1;
        unsigned RA4PPS3                :1;
        unsigned RA4PPS4                :1;
        unsigned RA4PPS5                :1;
    };
} RA4PPSbits_t;
