LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile RB7PPSbits_t RB7PPSbits __at(0x3A0F);
// bitfield macros

// Register: RC0PPS
#define RC0PPS RC0PPS
extern volatile unsigned char           RC0PPS              __at(0x3A10);
#ifndef _LIB_BUILD
asm("RC0PPS equ 03A10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC0PPS0                :1;
        unsigned RC0PPS1                :1;
        unsigned RC0PPS2                :1;
        unsigned RC0PPS3                :1;
        unsigned RC0PPS4                :1;
        unsigned RC0PPS5                :1;
    };
} RC0PPSbits_t;
extern volatile RC0PPSbits_t RC0PPSbits __at(0x3A10);
// bitfield macros

// Register: RC1PPS
#define RC1PPS RC1PPS
extern volatile unsigned char           RC1PPS              __at(0x3A11);
#ifndef _LIB_BUILD
asm("RC1PPS equ 03A11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC1PPS0                :1;
        unsigned RC1PPS1                :1;
        unsigned RC1PPS2                :1;
        unsigned RC1PPS3                :1;
        unsigned RC1PPS4                :1;
        unsigned RC1PPS5                :1;
    };
} RC1PPSbits_t;
extern volatile RC1PPSbits_t RC1PPSbits __at(0x3A11);
// bitfield macros

// Register: RC2PPS
#define RC2PPS RC2PPS
extern volatile unsigned char           RC2PPS              __at(0x3A12);
#ifndef _LIB_BUILD
asm("RC2PPS equ 03A12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC2PPS0                :1;
        unsigned RC2PPS1                :1;
        unsigned RC2PPS2                :1;
        unsigned RC2PPS3                :1;
        unsigned RC2PPS4                :1;
        unsigned RC2PPS5                :1;
    };
} RC2PPSbits_t;
extern volatile RC2PPSbits_t RC2PPSbits __at(0x3A12);
// bitfield macros

// Register: RC3PPS
#define RC3PPS RC3PPS
extern volatile unsigned char           RC3PPS              __at(0x3A13);
#ifndef _LIB_BUILD
asm("RC3PPS equ 03A13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC3PPS0                :1;
        unsigned RC3PPS1                :1;
        unsigned RC3PPS2                :1;
        unsigned RC3PPS3                :1;
        unsigned RC3PPS4                :1;
        unsigned RC3PPS5                :1;
    };
} RC3PPSbits_t;
extern volatile RC3PPSbits_t RC3PPSbits __at(0x3A13);
// bitfield macros

// Register: RC4PPS
#define RC4PPS RC4PPS
extern volatile unsigned char           RC4PPS              __at(0x3A14);
#ifndef _LIB_BUILD
asm("RC4PPS equ 03A14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC4PPS0                :1;
        unsigned RC4PPS1                :1;
        unsigned RC4PPS2                :1;
        unsigned RC4PPS3                :1;
        unsigned RC4PPS4                :1;
        unsigned RC4PPS5                :1;
    };
} RC4PPSbits_t;
extern volatile RC4PPSbits_t RC4PPSbits __at(0x3A14);
// bitfield macros

// Register: RC5PPS
#define RC5PPS RC5PPS
extern volatile unsigned char           RC5PPS              __at(0x3A15);
#ifndef _LIB_BUILD
asm("RC5PPS equ 03A15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC5PPS0                :1;
        unsigned RC5PPS1                :1;
        unsigned RC5PPS2                :1;
        unsigned RC5PPS3                :1;
        unsigned RC5PPS4                :1;
        unsigned RC5PPS5                :1;
    };
} RC5PPSbits_t;
extern volatile RC5PPSbits_t RC5PPSbits __at(0x3A15);
// bitfield macros

// Register: RC6PPS
#define RC6PPS RC6PPS
extern volatile unsigned char           RC6PPS              __at(0x3A16);
#ifndef _LIB_BUILD
asm("RC6PPS equ 03A16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC6PPS0                :1;
        unsigned RC6PPS1                :1;
        unsigned RC6PPS2                :1;
        unsigned RC6PPS3                :1;
        unsigned RC6PPS4                :1;
        unsigned RC6PPS5                :1;
    };
} RC6PPSbits_t;
extern volatile RC6PPSbits_t RC6PPSbits __at(0x3A16);
// bitfield macros

// Register: RC7PPS
#define RC7PPS RC7PPS
extern volatile unsigned char           RC7PPS              __at(0x3A17);
#ifndef _LIB_BUILD
asm("RC7PPS equ 03A17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC7PPS0                :1;
        unsigned RC7PPS1                :1;
        unsigned RC7PPS2                :1;
        unsigned RC7PPS3                :1;
        unsigned RC7PPS4                :1;
        unsigned RC7PPS5                :1;
    };
} RC7PPSbits_t;
extern volatile RC7PPSbits_t RC7PPSbits __at(0x3A17);
// bitfield macros

// Register: RD0PPS
#define RD0PPS RD0PPS
extern volatile unsigned char           RD0PPS              __at(0x3A18);
#ifndef _LIB_BUILD
asm("RD0PPS equ 03A18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0PPS0                :1;
        unsigned RD0PPS1                :1;
        unsigned RD0PPS2                :1;
        unsigned RD0PPS3                :1;
        unsigned RD0PPS4                :1;
        unsigned RD0PPS5                :1;
    };
} RD0PPSbits_t;
extern volatile RD0PPSbits_t RD0PPSbits __at(0x3A18);
// bitfield macros

// Register: RD1PPS
#define RD1PPS RD1PPS
extern volatile unsigned char           RD1PPS              __at(0x3A19);
#ifndef _LIB_BUILD
asm("RD1PPS equ 03A19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD1PPS0                :1;
        unsigned RD1PPS1                :1;
        unsigned RD1PPS2                :1;
        unsigned RD1PPS3                :1;
        unsigned RD1PPS4                :1;
        unsigned RD1PPS5                :1;
    };
} RD1PPSbits_t;
extern volatile RD1PPSbits_t RD1PPSbits __at(0x3A19);
// bitfield macros

// Register: RD2PPS
#define RD2PPS RD2PPS
extern volatile unsigned char           RD2PPS              __at(0x3A1A);
#ifndef _LIB_BUILD
asm("RD2PPS equ 03A1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD2PPS0                :1;
        unsigned RD2PPS1                :1;
        unsigned RD2PPS2                :1;
        unsigned RD2PPS3                :1;
        unsigned RD2PPS4                :1;
        unsigned RD2PPS5                :1;
    };
} RD2PPSbits_t;
