LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile RD2PPSbits_t RD2PPSbits __at(0x3A1A);
// bitfield macros

// Register: RD3PPS
#define RD3PPS RD3PPS
extern volatile unsigned char           RD3PPS              __at(0x3A1B);
#ifndef _LIB_BUILD
asm("RD3PPS equ 03A1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD3PPS0                :1;
        unsigned RD3PPS1                :1;
        unsigned RD3PPS2                :1;
        unsigned RD3PPS3                :1;
        unsigned RD3PPS4                :1;
        unsigned RD3PPS5                :1;
    };
} RD3PPSbits_t;
extern volatile RD3PPSbits_t RD3PPSbits __at(0x3A1B);
// bitfield macros

// Register: RD4PPS
#define RD4PPS RD4PPS
extern volatile unsigned char           RD4PPS              __at(0x3A1C);
#ifndef _LIB_BUILD
asm("RD4PPS equ 03A1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD4PPS0                :1;
        unsigned RD4PPS1                :1;
        unsigned RD4PPS2                :1;
        unsigned RD4PPS3                :1;
        unsigned RD4PPS4                :1;
        unsigned RD4PPS5                :1;
    };
} RD4PPSbits_t;
extern volatile RD4PPSbits_t RD4PPSbits __at(0x3A1C);
// bitfield macros

// Register: RD5PPS
#define RD5PPS RD5PPS
extern volatile unsigned char           RD5PPS              __at(0x3A1D);
#ifndef _LIB_BUILD
asm("RD5PPS equ 03A1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD5PPS0                :1;
        unsigned RD5PPS1                :1;
        unsigned RD5PPS2                :1;
        unsigned RD5PPS3                :1;
        unsigned RD5PPS4                :1;
        unsigned RD5PPS5                :1;
    };
} RD5PPSbits_t;
extern volatile RD5PPSbits_t RD5PPSbits __at(0x3A1D);
// bitfield macros

// Register: RD6PPS
#define RD6PPS RD6PPS
extern volatile unsigned char           RD6PPS              __at(0x3A1E);
#ifndef _LIB_BUILD
asm("RD6PPS equ 03A1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD6PPS0                :1;
        unsigned RD6PPS1                :1;
        unsigned RD6PPS2                :1;
        unsigned RD6PPS3                :1;
        unsigned RD6PPS4                :1;
        unsigned RD6PPS5                :1;
    };
} RD6PPSbits_t;
extern volatile RD6PPSbits_t RD6PPSbits __at(0x3A1E);
// bitfield macros

// Register: RD7PPS
#define RD7PPS RD7PPS
extern volatile unsigned char           RD7PPS              __at(0x3A1F);
#ifndef _LIB_BUILD
asm("RD7PPS equ 03A1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD7PPS0                :1;
        unsigned RD7PPS1                :1;
        unsigned RD7PPS2                :1;
        unsigned RD7PPS3                :1;
        unsigned RD7PPS4                :1;
        unsigned RD7PPS5                :1;
    };
} RD7PPSbits_t;
extern volatile RD7PPSbits_t RD7PPSbits __at(0x3A1F);
// bitfield macros

// Register: RE0PPS
#define RE0PPS RE0PPS
extern volatile unsigned char           RE0PPS              __at(0x3A20);
#ifndef _LIB_BUILD
asm("RE0PPS equ 03A20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0PPS0                :1;
        unsigned RE0PPS1                :1;
        unsigned RE0PPS2                :1;
        unsigned RE0PPS3                :1;
        unsigned RE0PPS4                :1;
        unsigned RE0PPS5                :1;
    };
} RE0PPSbits_t;
extern volatile RE0PPSbits_t RE0PPSbits __at(0x3A20);
// bitfield macros

// Register: RE1PPS
#define RE1PPS RE1PPS
extern volatile unsigned char           RE1PPS              __at(0x3A21);
#ifndef _LIB_BUILD
asm("RE1PPS equ 03A21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE1PPS0                :1;
        unsigned RE1PPS1                :1;
        unsigned RE1PPS2                :1;
        unsigned RE1PPS3                :1;
        unsigned RE1PPS4                :1;
        unsigned RE1PPS5                :1;
    };
} RE1PPSbits_t;
extern volatile RE1PPSbits_t RE1PPSbits __at(0x3A21);
// bitfield macros

// Register: RE2PPS
#define RE2PPS RE2PPS
extern volatile unsigned char           RE2PPS              __at(0x3A22);
#ifndef _LIB_BUILD
asm("RE2PPS equ 03A22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE2PPS0                :1;
        unsigned RE2PPS1                :1;
        unsigned RE2PPS2                :1;
        unsigned RE2PPS3                :1;
        unsigned RE2PPS4                :1;
        unsigned RE2PPS5                :1;
    };
} RE2PPSbits_t;
extern volatile RE2PPSbits_t RE2PPSbits __at(0x3A22);
// bitfield macros

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x3A40);
#ifndef _LIB_BUILD
asm("ANSELA equ 03A40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELA0                :1;
        unsigned ANSELA1                :1;
        unsigned ANSELA2                :1;
        unsigned ANSELA3                :1;
        unsigned ANSELA4                :1;
        unsigned ANSELA5                :1;
        unsigned ANSELA6                :1;
        unsigned ANSELA7                :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x3A40);
// bitfield macros

// Register: WPUA
#define WPUA WPUA
extern volatile unsigned char           WPUA                __at(0x3A41);
#ifndef _LIB_BUILD
asm("WPUA equ 03A41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUA0                  :1;
        unsigned WPUA1                  :1;
        unsigned WPUA2                  :1;
        unsigned WPUA3                  :1;
        unsigned WPUA4                  :1;
        unsigned WPUA5                  :1;
        unsigned WPUA6                  :1;
        unsigned WPUA7                  :1;
    };
} WPUAbits_t;
extern volatile WPUAbits_t WPUAbits __at(0x3A41);
// bitfield macros

// Register: ODCONA
#define ODCONA ODCONA
extern volatile unsigned char           ODCONA              __at(0x3A42);
#ifndef _LIB_BUILD
asm("ODCONA equ 03A42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCA0                  :1;
        unsigned ODCA1                  :1;
        unsigned ODCA2                  :1;
        unsigned ODCA3                  :1;
        unsigned ODCA4                  :1;
        unsigned ODCA5                  :1;
        unsigned ODCA6                  :1;
        unsigned ODCA7                  :1;
    };
} ODCONAbits_t;
