LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: IOCCN
#define IOCCN IOCCN
extern volatile unsigned char           IOCCN               __at(0x3A66);
#ifndef _LIB_BUILD
asm("IOCCN equ 03A66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCCN0                 :1;
        unsigned IOCCN1                 :1;
        unsigned IOCCN2                 :1;
        unsigned IOCCN3                 :1;
        unsigned IOCCN4                 :1;
        unsigned IOCCN5                 :1;
        unsigned IOCCN6                 :1;
        unsigned IOCCN7                 :1;
    };
} IOCCNbits_t;
extern volatile IOCCNbits_t IOCCNbits __at(0x3A66);
// bitfield macros

// Register: IOCCF
#define IOCCF IOCCF
extern volatile unsigned char           IOCCF               __at(0x3A67);
#ifndef _LIB_BUILD
asm("IOCCF equ 03A67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCCF0                 :1;
        unsigned IOCCF1                 :1;
        unsigned IOCCF2                 :1;
        unsigned IOCCF3                 :1;
        unsigned IOCCF4                 :1;
        unsigned IOCCF5                 :1;
        unsigned IOCCF6                 :1;
        unsigned IOCCF7                 :1;
    };
} IOCCFbits_t;
extern volatile IOCCFbits_t IOCCFbits __at(0x3A67);
// bitfield macros

// Register: RC3I2C
#define RC3I2C RC3I2C
extern volatile unsigned char           RC3I2C              __at(0x3A6A);
#ifndef _LIB_BUILD
asm("RC3I2C equ 03A6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RC3I2Cbits_t;
extern volatile RC3I2Cbits_t RC3I2Cbits __at(0x3A6A);
// bitfield macros

// Register: RC4I2C
#define RC4I2C RC4I2C
extern volatile unsigned char           RC4I2C              __at(0x3A6B);
#ifndef _LIB_BUILD
asm("RC4I2C equ 03A6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RC4I2Cbits_t;
extern volatile RC4I2Cbits_t RC4I2Cbits __at(0x3A6B);
// bitfield macros

// Register: ANSELD
#define ANSELD ANSELD
extern volatile unsigned char           ANSELD              __at(0x3A70);
#ifndef _LIB_BUILD
asm("ANSELD equ 03A70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELD0                :1;
        unsigned ANSELD1                :1;
        unsigned ANSELD2                :1;
        unsigned ANSELD3                :1;
        unsigned ANSELD4                :1;
        unsigned ANSELD5                :1;
        unsigned ANSELD6                :1;
        unsigned ANSELD7                :1;
    };
} ANSELDbits_t;
extern volatile ANSELDbits_t ANSELDbits __at(0x3A70);
// bitfield macros

// Register: WPUD
#define WPUD WPUD
extern volatile unsigned char           WPUD                __at(0x3A71);
#ifndef _LIB_BUILD
asm("WPUD equ 03A71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUD0                  :1;
        unsigned WPUD1                  :1;
        unsigned WPUD2                  :1;
        unsigned WPUD3                  :1;
        unsigned WPUD4                  :1;
        unsigned WPUD5                  :1;
        unsigned WPUD6                  :1;
        unsigned WPUD7                  :1;
    };
} WPUDbits_t;
extern volatile WPUDbits_t WPUDbits __at(0x3A71);
// bitfield macros

// Register: ODCOND
#define ODCOND ODCOND
extern volatile unsigned char           ODCOND              __at(0x3A72);
#ifndef _LIB_BUILD
asm("ODCOND equ 03A72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCD0                  :1;
        unsigned ODCD1                  :1;
        unsigned ODCD2                  :1;
        unsigned ODCD3                  :1;
        unsigned ODCD4                  :1;
        unsigned ODCD5                  :1;
        unsigned ODCD6                  :1;
        unsigned ODCD7                  :1;
    };
} ODCONDbits_t;
extern volatile ODCONDbits_t ODCONDbits __at(0x3A72);
// bitfield macros

// Register: SLRCOND
#define SLRCOND SLRCOND
extern volatile unsigned char           SLRCOND             __at(0x3A73);
#ifndef _LIB_BUILD
asm("SLRCOND equ 03A73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRD0                  :1;
        unsigned SLRD1                  :1;
        unsigned SLRD2                  :1;
        unsigned SLRD3                  :1;
        unsigned SLRD4                  :1;
        unsigned SLRD5                  :1;
        unsigned SLRD6                  :1;
        unsigned SLRD7                  :1;
    };
} SLRCONDbits_t;
extern volatile SLRCONDbits_t SLRCONDbits __at(0x3A73);
// bitfield macros

// Register: INLVLD
#define INLVLD INLVLD
extern volatile unsigned char           INLVLD              __at(0x3A74);
#ifndef _LIB_BUILD
asm("INLVLD equ 03A74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLD0                :1;
        unsigned INLVLD1                :1;
        unsigned INLVLD2                :1;
        unsigned INLVLD3                :1;
        unsigned INLVLD4                :1;
        unsigned INLVLD5                :1;
        unsigned INLVLD6                :1;
        unsigned INLVLD7                :1;
    };
} INLVLDbits_t;
