LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile INLVLDbits_t INLVLDbits __at(0x3A74);
// bitfield macros

// Register: RD0I2C
#define RD0I2C RD0I2C
extern volatile unsigned char           RD0I2C              __at(0x3A7A);
#ifndef _LIB_BUILD
asm("RD0I2C equ 03A7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RD0I2Cbits_t;
extern volatile RD0I2Cbits_t RD0I2Cbits __at(0x3A7A);
// bitfield macros

// Register: RD1I2C
#define RD1I2C RD1I2C
extern volatile unsigned char           RD1I2C              __at(0x3A7B);
#ifndef _LIB_BUILD
asm("RD1I2C equ 03A7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RD1I2Cbits_t;
extern volatile RD1I2Cbits_t RD1I2Cbits __at(0x3A7B);
// bitfield macros

// Register: ANSELE
#define ANSELE ANSELE
extern volatile unsigned char           ANSELE              __at(0x3A80);
#ifndef _LIB_BUILD
asm("ANSELE equ 03A80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELE0                :1;
        unsigned ANSELE1                :1;
        unsigned ANSELE2                :1;
    };
} ANSELEbits_t;
extern volatile ANSELEbits_t ANSELEbits __at(0x3A80);
// bitfield macros

// Register: WPUE
#define WPUE WPUE
extern volatile unsigned char           WPUE                __at(0x3A81);
#ifndef _LIB_BUILD
asm("WPUE equ 03A81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUE0                  :1;
        unsigned WPUE1                  :1;
        unsigned WPUE2                  :1;
        unsigned WPUE3                  :1;
    };
} WPUEbits_t;
extern volatile WPUEbits_t WPUEbits __at(0x3A81);
// bitfield macros

// Register: ODCONE
#define ODCONE ODCONE
extern volatile unsigned char           ODCONE              __at(0x3A82);
#ifndef _LIB_BUILD
asm("ODCONE equ 03A82h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCE0                  :1;
        unsigned ODCE1                  :1;
        unsigned ODCE2                  :1;
    };
} ODCONEbits_t;
extern volatile ODCONEbits_t ODCONEbits __at(0x3A82);
// bitfield macros

// Register: SLRCONE
#define SLRCONE SLRCONE
extern volatile unsigned char           SLRCONE             __at(0x3A83);
#ifndef _LIB_BUILD
asm("SLRCONE equ 03A83h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRE0                  :1;
        unsigned SLRE1                  :1;
        unsigned SLRE2                  :1;
    };
} SLRCONEbits_t;
extern volatile SLRCONEbits_t SLRCONEbits __at(0x3A83);
// bitfield macros

// Register: INLVLE
#define INLVLE INLVLE
extern volatile unsigned char           INLVLE              __at(0x3A84);
#ifndef _LIB_BUILD
asm("INLVLE equ 03A84h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLE0                :1;
        unsigned INLVLE1                :1;
        unsigned INLVLE2                :1;
        unsigned INLVLE3                :1;
    };
} INLVLEbits_t;
extern volatile INLVLEbits_t INLVLEbits __at(0x3A84);
// bitfield macros

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0x3A85);
#ifndef _LIB_BUILD
asm("IOCEP equ 03A85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEP3                 :1;
    };
} IOCEPbits_t;
extern volatile IOCEPbits_t IOCEPbits __at(0x3A85);
// bitfield macros

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0x3A86);
#ifndef _LIB_BUILD
asm("IOCEN equ 03A86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEN3                 :1;
    };
} IOCENbits_t;
extern volatile IOCENbits_t IOCENbits __at(0x3A86);
// bitfield macros

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x3A87);
#ifndef _LIB_BUILD
asm("IOCEF equ 03A87h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x3A87);
// bitfield macros

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0x3ABF);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 03ABFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0x3ABF);
// bitfield macros

