LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: INT0PPS
#define INT0PPS INT0PPS
extern volatile unsigned char           INT0PPS             __at(0x3AC0);
#ifndef _LIB_BUILD
asm("INT0PPS equ 03AC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0PPS                :6;
    };
} INT0PPSbits_t;
extern volatile INT0PPSbits_t INT0PPSbits __at(0x3AC0);
// bitfield macros

// Register: INT1PPS
#define INT1PPS INT1PPS
extern volatile unsigned char           INT1PPS             __at(0x3AC1);
#ifndef _LIB_BUILD
asm("INT1PPS equ 03AC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1PPS                :6;
    };
} INT1PPSbits_t;
extern volatile INT1PPSbits_t INT1PPSbits __at(0x3AC1);
// bitfield macros

// Register: INT2PPS
#define INT2PPS INT2PPS
extern volatile unsigned char           INT2PPS             __at(0x3AC2);
#ifndef _LIB_BUILD
asm("INT2PPS equ 03AC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2PPS                :6;
    };
} INT2PPSbits_t;
extern volatile INT2PPSbits_t INT2PPSbits __at(0x3AC2);
// bitfield macros

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0x3AC3);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 03AC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0CKIPPS               :6;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits __at(0x3AC3);
// bitfield macros

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            __at(0x3AC4);
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 03AC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1CKIPPS               :6;
    };
} T1CKIPPSbits_t;
extern volatile T1CKIPPSbits_t T1CKIPPSbits __at(0x3AC4);
// bitfield macros

// Register: T1GPPS
#define T1GPPS T1GPPS
extern volatile unsigned char           T1GPPS              __at(0x3AC5);
#ifndef _LIB_BUILD
asm("T1GPPS equ 03AC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1GPPS                 :6;
    };
} T1GPPSbits_t;
extern volatile T1GPPSbits_t T1GPPSbits __at(0x3AC5);
// bitfield macros

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
extern volatile unsigned char           T3CKIPPS            __at(0x3AC6);
#ifndef _LIB_BUILD
asm("T3CKIPPS equ 03AC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T3CKIPPS               :6;
    };
} T3CKIPPSbits_t;
extern volatile T3CKIPPSbits_t T3CKIPPSbits __at(0x3AC6);
// bitfield macros

// Register: T3GPPS
#define T3GPPS T3GPPS
extern volatile unsigned char           T3GPPS              __at(0x3AC7);
#ifndef _LIB_BUILD
asm("T3GPPS equ 03AC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T3GPPS                 :6;
    };
} T3GPPSbits_t;
extern volatile T3GPPSbits_t T3GPPSbits __at(0x3AC7);
// bitfield macros

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
extern volatile unsigned char           T5CKIPPS            __at(0x3AC8);
#ifndef _LIB_BUILD
asm("T5CKIPPS equ 03AC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5CKIPPS               :6;
    };
} T5CKIPPSbits_t;
extern volatile T5CKIPPSbits_t T5CKIPPSbits __at(0x3AC8);
// bitfield macros

// Register: T5GPPS
#define T5GPPS T5GPPS
extern volatile unsigned char           T5GPPS              __at(0x3AC9);
#ifndef _LIB_BUILD
asm("T5GPPS equ 03AC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5GPPS                 :6;
    };
} T5GPPSbits_t;
extern volatile T5GPPSbits_t T5GPPSbits __at(0x3AC9);
// bitfield macros

// Register: T2INPPS
#define T2INPPS T2INPPS
extern volatile unsigned char           T2INPPS             __at(0x3ACA);
#ifndef _LIB_BUILD
asm("T2INPPS equ 03ACAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T2INPPS                :6;
    };
} T2INPPSbits_t;
extern volatile T2INPPSbits_t T2INPPSbits __at(0x3ACA);
// bitfield macros

// Register: T4INPPS
#define T4INPPS T4INPPS
extern volatile unsigned char           T4INPPS             __at(0x3ACB);
#ifndef _LIB_BUILD
asm("T4INPPS equ 03ACBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T4INPPS                :6;
    };
} T4INPPSbits_t;
extern volatile T4INPPSbits_t T4INPPSbits __at(0x3ACB);
// bitfield macros

// Register: T6INPPS
#define T6INPPS T6INPPS
extern volatile unsigned char           T6INPPS             __at(0x3ACC);
#ifndef _LIB_BUILD
asm("T6INPPS equ 03ACCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T6INPPS                :6;
    };
} T6INPPSbits_t;
extern volatile T6INPPSbits_t T6INPPSbits __at(0x3ACC);
// bitfield macros

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
extern volatile unsigned char           CCP1PPS             __at(0x3ACD);
#ifndef _LIB_BUILD
asm("CCP1PPS equ 03ACDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1PPS                :6;
    };
} CCP1PPSbits_t;
extern volatile CCP1PPSbits_t CCP1PPSbits __at(0x3ACD);
// bitfield macros

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
extern volatile unsigned char           CCP2PPS             __at(0x3ACE);
#ifndef _LIB_BUILD
asm("CCP2PPS equ 03ACEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2PPS                :6;
    };
} CCP2PPSbits_t;
extern volatile CCP2PPSbits_t CCP2PPSbits __at(0x3ACE);
// bitfield macros

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
extern volatile unsigned char           CCP3PPS             __at(0x3ACF);
#ifndef _LIB_BUILD
asm("CCP3PPS equ 03ACFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3PPS                :6;
    };
} CCP3PPSbits_t;
extern volatile CCP3PPSbits_t CCP3PPSbits __at(0x3ACF);
// bitfield macros

// Register: CCP4PPS
#define CCP4PPS CCP4PPS
extern volatile unsigned char           CCP4PPS             __at(0x3AD0);
#ifndef _LIB_BUILD
asm("CCP4PPS equ 03AD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4PPS                :6;
    };
} CCP4PPSbits_t;
extern volatile CCP4PPSbits_t CCP4PPSbits __at(0x3AD0);
// bitfield macros

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
extern volatile unsigned char           SMT1WINPPS          __at(0x3AD1);
#ifndef _LIB_BUILD
asm("SMT1WINPPS equ 03AD1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1WINPPS             :6;
    };
} SMT1WINPPSbits_t;
extern volatile SMT1WINPPSbits_t SMT1WINPPSbits __at(0x3AD1);
// bitfield macros

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
extern volatile unsigned char           SMT1SIGPPS          __at(0x3AD2);
#ifndef _LIB_BUILD
asm("SMT1SIGPPS equ 03AD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1SIGPPS             :6;
    };
} SMT1SIGPPSbits_t;
extern volatile SMT1SIGPPSbits_t SMT1SIGPPSbits __at(0x3AD2);
// bitfield macros

// Register: CWG1INPPS
#define CWG1INPPS CWG1INPPS
extern volatile unsigned char           CWG1INPPS           __at(0x3AD3);
#ifndef _LIB_BUILD
asm("CWG1INPPS equ 03AD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1INPPS              :6;
    };
} CWG1INPPSbits_t;
extern volatile CWG1INPPSbits_t CWG1INPPSbits __at(0x3AD3);
// bitfield macros

// Register: CWG2INPPS
#define CWG2INPPS CWG2INPPS
extern volatile unsigned char           CWG2INPPS           __at(0x3AD4);
#ifndef _LIB_BUILD
asm("CWG2INPPS equ 03AD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG2INPPS              :6;
    };
} CWG2INPPSbits_t;
