LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile CWG2INPPSbits_t CWG2INPPSbits __at(0x3AD4);
// bitfield macros

// Register: CWG3INPPS
#define CWG3INPPS CWG3INPPS
extern volatile unsigned char           CWG3INPPS           __at(0x3AD5);
#ifndef _LIB_BUILD
asm("CWG3INPPS equ 03AD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG3INPPS              :6;
    };
} CWG3INPPSbits_t;
extern volatile CWG3INPPSbits_t CWG3INPPSbits __at(0x3AD5);
// bitfield macros

// Register: MD1CARLPPS
#define MD1CARLPPS MD1CARLPPS
extern volatile unsigned char           MD1CARLPPS          __at(0x3AD6);
#ifndef _LIB_BUILD
asm("MD1CARLPPS equ 03AD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1CARLPPS             :6;
    };
} MD1CARLPPSbits_t;
extern volatile MD1CARLPPSbits_t MD1CARLPPSbits __at(0x3AD6);
// bitfield macros

// Register: MD1CARHPPS
#define MD1CARHPPS MD1CARHPPS
extern volatile unsigned char           MD1CARHPPS          __at(0x3AD7);
#ifndef _LIB_BUILD
asm("MD1CARHPPS equ 03AD7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1CARHPPS             :6;
    };
} MD1CARHPPSbits_t;
extern volatile MD1CARHPPSbits_t MD1CARHPPSbits __at(0x3AD7);
// bitfield macros

// Register: MD1SRCPPS
#define MD1SRCPPS MD1SRCPPS
extern volatile unsigned char           MD1SRCPPS           __at(0x3AD8);
#ifndef _LIB_BUILD
asm("MD1SRCPPS equ 03AD8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1SRCPPS              :6;
    };
} MD1SRCPPSbits_t;
extern volatile MD1SRCPPSbits_t MD1SRCPPSbits __at(0x3AD8);
// bitfield macros

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
extern volatile unsigned char           CLCIN0PPS           __at(0x3AD9);
#ifndef _LIB_BUILD
asm("CLCIN0PPS equ 03AD9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN0PPS              :6;
    };
} CLCIN0PPSbits_t;
extern volatile CLCIN0PPSbits_t CLCIN0PPSbits __at(0x3AD9);
// bitfield macros

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
extern volatile unsigned char           CLCIN1PPS           __at(0x3ADA);
#ifndef _LIB_BUILD
asm("CLCIN1PPS equ 03ADAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN1PPS              :6;
    };
} CLCIN1PPSbits_t;
extern volatile CLCIN1PPSbits_t CLCIN1PPSbits __at(0x3ADA);
// bitfield macros

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
extern volatile unsigned char           CLCIN2PPS           __at(0x3ADB);
#ifndef _LIB_BUILD
asm("CLCIN2PPS equ 03ADBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN2PPS              :6;
    };
} CLCIN2PPSbits_t;
extern volatile CLCIN2PPSbits_t CLCIN2PPSbits __at(0x3ADB);
// bitfield macros

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
extern volatile unsigned char           CLCIN3PPS           __at(0x3ADC);
#ifndef _LIB_BUILD
asm("CLCIN3PPS equ 03ADCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN3PPS              :6;
    };
} CLCIN3PPSbits_t;
extern volatile CLCIN3PPSbits_t CLCIN3PPSbits __at(0x3ADC);
// bitfield macros

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
extern volatile unsigned char           ADACTPPS            __at(0x3ADD);
#ifndef _LIB_BUILD
asm("ADACTPPS equ 03ADDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACTPPS               :6;
    };
} ADACTPPSbits_t;
extern volatile ADACTPPSbits_t ADACTPPSbits __at(0x3ADD);
// bitfield macros

// Register: SPI1SCKPPS
#define SPI1SCKPPS SPI1SCKPPS
extern volatile unsigned char           SPI1SCKPPS          __at(0x3ADE);
#ifndef _LIB_BUILD
asm("SPI1SCKPPS equ 03ADEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1SCKPPS             :6;
    };
} SPI1SCKPPSbits_t;
extern volatile SPI1SCKPPSbits_t SPI1SCKPPSbits __at(0x3ADE);
// bitfield macros

// Register: SPI1SDIPPS
#define SPI1SDIPPS SPI1SDIPPS
extern volatile unsigned char           SPI1SDIPPS          __at(0x3ADF);
#ifndef _LIB_BUILD
asm("SPI1SDIPPS equ 03ADFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1SDIPPS             :6;
    };
} SPI1SDIPPSbits_t;
extern volatile SPI1SDIPPSbits_t SPI1SDIPPSbits __at(0x3ADF);
// bitfield macros

// Register: SPI1SSPPS
#define SPI1SSPPS SPI1SSPPS
extern volatile unsigned char           SPI1SSPPS           __at(0x3AE0);
#ifndef _LIB_BUILD
asm("SPI1SSPPS equ 03AE0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1SSPPS              :6;
    };
} SPI1SSPPSbits_t;
extern volatile SPI1SSPPSbits_t SPI1SSPPSbits __at(0x3AE0);
// bitfield macros

// Register: I2C1SCLPPS
#define I2C1SCLPPS I2C1SCLPPS
extern volatile unsigned char           I2C1SCLPPS          __at(0x3AE1);
#ifndef _LIB_BUILD
asm("I2C1SCLPPS equ 03AE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1SCLPPS             :6;
    };
} I2C1SCLPPSbits_t;
extern volatile I2C1SCLPPSbits_t I2C1SCLPPSbits __at(0x3AE1);
// bitfield macros

// Register: I2C1SDAPPS
#define I2C1SDAPPS I2C1SDAPPS
extern volatile unsigned char           I2C1SDAPPS          __at(0x3AE2);
#ifndef _LIB_BUILD
asm("I2C1SDAPPS equ 03AE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1SDAPPS             :6;
    };
} I2C1SDAPPSbits_t;
extern volatile I2C1SDAPPSbits_t I2C1SDAPPSbits __at(0x3AE2);
// bitfield macros

// Register: I2C2SCLPPS
#define I2C2SCLPPS I2C2SCLPPS
extern volatile unsigned char           I2C2SCLPPS          __at(0x3AE3);
#ifndef _LIB_BUILD
asm("I2C2SCLPPS equ 03AE3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2SCLPPS             :6;
    };
} I2C2SCLPPSbits_t;
extern volatile I2C2SCLPPSbits_t I2C2SCLPPSbits __at(0x3AE3);
// bitfield macros

// Register: I2C2SDAPPS
#define I2C2SDAPPS I2C2SDAPPS
extern volatile unsigned char           I2C2SDAPPS          __at(0x3AE4);
#ifndef _LIB_BUILD
asm("I2C2SDAPPS equ 03AE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2SDAPPS             :6;
    };
} I2C2SDAPPSbits_t;
extern volatile I2C2SDAPPSbits_t I2C2SDAPPSbits __at(0x3AE4);
// bitfield macros

// Register: U1RXPPS
#define U1RXPPS U1RXPPS
extern volatile unsigned char           U1RXPPS             __at(0x3AE5);
#ifndef _LIB_BUILD
asm("U1RXPPS equ 03AE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXPPS                :6;
    };
} U1RXPPSbits_t;
extern volatile U1RXPPSbits_t U1RXPPSbits __at(0x3AE5);
// bitfield macros

// Register: U1CTSPPS
#define U1CTSPPS U1CTSPPS
extern volatile unsigned char           U1CTSPPS            __at(0x3AE6);
#ifndef _LIB_BUILD
asm("U1CTSPPS equ 03AE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1CTSPPS               :6;
    };
} U1CTSPPSbits_t;
