LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile U1CTSPPSbits_t U1CTSPPSbits __at(0x3AE6);
// bitfield macros

// Register: U2RXPPS
#define U2RXPPS U2RXPPS
extern volatile unsigned char           U2RXPPS             __at(0x3AE8);
#ifndef _LIB_BUILD
asm("U2RXPPS equ 03AE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXPPS                :6;
    };
} U2RXPPSbits_t;
extern volatile U2RXPPSbits_t U2RXPPSbits __at(0x3AE8);
// bitfield macros

// Register: U2CTSPPS
#define U2CTSPPS U2CTSPPS
extern volatile unsigned char           U2CTSPPS            __at(0x3AE9);
#ifndef _LIB_BUILD
asm("U2CTSPPS equ 03AE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2CTSPPS               :6;
    };
} U2CTSPPSbits_t;
extern volatile U2CTSPPSbits_t U2CTSPPSbits __at(0x3AE9);
// bitfield macros

// Register: DMA2BUF
#define DMA2BUF DMA2BUF
extern volatile unsigned char           DMA2BUF             __at(0x3BC9);
#ifndef _LIB_BUILD
asm("DMA2BUF equ 03BC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUF                    :8;
    };
    struct {
        unsigned BUF0                   :1;
        unsigned BUF1                   :1;
        unsigned BUF2                   :1;
        unsigned BUF3                   :1;
        unsigned BUF4                   :1;
        unsigned BUF5                   :1;
        unsigned BUF6                   :1;
        unsigned BUF7                   :1;
    };
    struct {
        unsigned DMA2BUF                :8;
    };
    struct {
        unsigned DMA2BUF0               :1;
        unsigned DMA2BUF1               :1;
        unsigned DMA2BUF2               :1;
        unsigned DMA2BUF3               :1;
        unsigned DMA2BUF4               :1;
        unsigned DMA2BUF5               :1;
        unsigned DMA2BUF6               :1;
        unsigned DMA2BUF7               :1;
    };
} DMA2BUFbits_t;
extern volatile DMA2BUFbits_t DMA2BUFbits __at(0x3BC9);
// bitfield macros

// Register: DMA2DCNT
#define DMA2DCNT DMA2DCNT
extern volatile unsigned short          DMA2DCNT            __at(0x3BCA);
#ifndef _LIB_BUILD
asm("DMA2DCNT equ 03BCAh");
#endif

// Register: DMA2DCNTL
#define DMA2DCNTL DMA2DCNTL
extern volatile unsigned char           DMA2DCNTL           __at(0x3BCA);
#ifndef _LIB_BUILD
asm("DMA2DCNTL equ 03BCAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :8;
    };
    struct {
        unsigned DCNT0                  :1;
        unsigned DCNT1                  :1;
        unsigned DCNT2                  :1;
        unsigned DCNT3                  :1;
        unsigned DCNT4                  :1;
        unsigned DCNT5                  :1;
        unsigned DCNT6                  :1;
        unsigned DCNT7                  :1;
    };
    struct {
        unsigned DMA2DCNT               :8;
    };
    struct {
        unsigned DMA2DCNT0              :1;
        unsigned DMA2DCNT1              :1;
        unsigned DMA2DCNT2              :1;
        unsigned DMA2DCNT3              :1;
        unsigned DMA2DCNT4              :1;
        unsigned DMA2DCNT5              :1;
        unsigned DMA2DCNT6              :1;
        unsigned DMA2DCNT7              :1;
    };
} DMA2DCNTLbits_t;
extern volatile DMA2DCNTLbits_t DMA2DCNTLbits __at(0x3BCA);
// bitfield macros

// Register: DMA2DCNTH
#define DMA2DCNTH DMA2DCNTH
extern volatile unsigned char           DMA2DCNTH           __at(0x3BCB);
#ifndef _LIB_BUILD
asm("DMA2DCNTH equ 03BCBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :4;
    };
    struct {
        unsigned DCNT8                  :1;
        unsigned DCNT9                  :1;
        unsigned DCNT10                 :1;
        unsigned DCNT11                 :1;
    };
    struct {
        unsigned DMA2SCNT               :4;
    };
    struct {
        unsigned DMA2DCNT8              :1;
        unsigned DMA2DCNT9              :1;
        unsigned DMA2DCNT10             :1;
        unsigned DMA2DCNT11             :1;
    };
} DMA2DCNTHbits_t;
extern volatile DMA2DCNTHbits_t DMA2DCNTHbits __at(0x3BCB);
// bitfield macros

// Register: DMA2DPTR
#define DMA2DPTR DMA2DPTR
extern volatile unsigned short          DMA2DPTR            __at(0x3BCC);
#ifndef _LIB_BUILD
asm("DMA2DPTR equ 03BCCh");
#endif

// Register: DMA2DPTRL
#define DMA2DPTRL DMA2DPTRL
extern volatile unsigned char           DMA2DPTRL           __at(0x3BCC);
#ifndef _LIB_BUILD
asm("DMA2DPTRL equ 03BCCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR0                  :1;
        unsigned DPTR1                  :1;
        unsigned DPTR2                  :1;
        unsigned DPTR3                  :1;
        unsigned DPTR4                  :1;
        unsigned DPTR5                  :1;
        unsigned DPTR6                  :1;
        unsigned DPTR7                  :1;
    };
    struct {
        unsigned DMA2DPTR               :8;
    };
    struct {
        unsigned DMA2DPTR0              :1;
        unsigned DMA2DPTR1              :1;
        unsigned DMA2DPTR2              :1;
        unsigned DMA2DPTR3              :1;
        unsigned DMA2DPTR4              :1;
        unsigned DMA2DPTR5              :1;
        unsigned DMA2DPTR6              :1;
        unsigned DMA2DPTR7              :1;
    };
} DMA2DPTRLbits_t;
extern volatile DMA2DPTRLbits_t DMA2DPTRLbits __at(0x3BCC);
// bitfield macros

// Register: DMA2DPTRH
#define DMA2DPTRH DMA2DPTRH
extern volatile unsigned char           DMA2DPTRH           __at(0x3BCD);
#ifndef _LIB_BUILD
asm("DMA2DPTRH equ 03BCDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR8                  :1;
        unsigned DPTR9                  :1;
        unsigned DPTR10                 :1;
        unsigned DPTR11                 :1;
        unsigned DPTR12                 :1;
        unsigned DPTR13                 :1;
        unsigned DPTR14                 :1;
        unsigned DPTR15                 :1;
    };
    struct {
        unsigned DMA2DPTR               :8;
    };
    struct {
        unsigned DMA2DPTR8              :1;
        unsigned DMA2DPTR9              :1;
        unsigned DMA2DPTR10             :1;
        unsigned DMA2DPTR11             :1;
        unsigned DMA2DPTR12             :1;
        unsigned DMA2DPTR13             :1;
        unsigned DMA2DPTR14             :1;
        unsigned DMA2DPTR15             :1;
    };
} DMA2DPTRHbits_t;
extern volatile DMA2DPTRHbits_t DMA2DPTRHbits __at(0x3BCD);
// bitfield macros

