LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: DMA2DSZ
#define DMA2DSZ DMA2DSZ
extern volatile unsigned short          DMA2DSZ             __at(0x3BCE);
#ifndef _LIB_BUILD
asm("DMA2DSZ equ 03BCEh");
#endif

// Register: DMA2DSZL
#define DMA2DSZL DMA2DSZL
extern volatile unsigned char           DMA2DSZL            __at(0x3BCE);
#ifndef _LIB_BUILD
asm("DMA2DSZL equ 03BCEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :8;
    };
    struct {
        unsigned DMA2DSZ                :8;
    };
    struct {
        unsigned DSZ0                   :1;
        unsigned DSZ1                   :1;
        unsigned DSZ2                   :1;
        unsigned DSZ3                   :1;
        unsigned DSZ4                   :1;
        unsigned DSZ5                   :1;
        unsigned DSZ6                   :1;
        unsigned DSZ7                   :1;
    };
    struct {
        unsigned DMA2DSZ0               :1;
        unsigned DMA2DSZ1               :1;
        unsigned DMA2DSZ2               :1;
        unsigned DMA2DSZ3               :1;
        unsigned DMA2DSZ4               :1;
        unsigned DMA2DSZ5               :1;
        unsigned DMA2DSZ6               :1;
        unsigned DMA2DSZ7               :1;
    };
} DMA2DSZLbits_t;
extern volatile DMA2DSZLbits_t DMA2DSZLbits __at(0x3BCE);
// bitfield macros

// Register: DMA2DSZH
#define DMA2DSZH DMA2DSZH
extern volatile unsigned char           DMA2DSZH            __at(0x3BCF);
#ifndef _LIB_BUILD
asm("DMA2DSZH equ 03BCFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :4;
    };
    struct {
        unsigned DMA2DSZ                :4;
    };
    struct {
        unsigned DSZ8                   :1;
        unsigned DSZ9                   :1;
        unsigned DSZ10                  :1;
        unsigned DSZ11                  :1;
    };
    struct {
        unsigned DMA2DSZ8               :1;
        unsigned DMA2DSZ9               :1;
        unsigned DMA2DSZ10              :1;
        unsigned DMA2DSZ11              :1;
    };
} DMA2DSZHbits_t;
extern volatile DMA2DSZHbits_t DMA2DSZHbits __at(0x3BCF);
// bitfield macros

// Register: DMA2DSA
#define DMA2DSA DMA2DSA
extern volatile unsigned short          DMA2DSA             __at(0x3BD0);
#ifndef _LIB_BUILD
asm("DMA2DSA equ 03BD0h");
#endif

// Register: DMA2DSAL
#define DMA2DSAL DMA2DSAL
extern volatile unsigned char           DMA2DSAL            __at(0x3BD0);
#ifndef _LIB_BUILD
asm("DMA2DSAL equ 03BD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA0                   :1;
        unsigned SSA1                   :1;
        unsigned SSA2                   :1;
        unsigned SSA3                   :1;
        unsigned SSA4                   :1;
        unsigned SSA5                   :1;
        unsigned SSA6                   :1;
        unsigned SSA7                   :1;
    };
    struct {
        unsigned DMA2DSA                :8;
    };
    struct {
        unsigned DMA2DSA0               :1;
        unsigned DMA2DSA1               :1;
        unsigned DMA2DSA2               :1;
        unsigned DMA2DSA3               :1;
        unsigned DMA2DSA4               :1;
        unsigned DMA2DSA5               :1;
        unsigned DMA2DSA6               :1;
        unsigned DMA2DSA7               :1;
    };
} DMA2DSALbits_t;
extern volatile DMA2DSALbits_t DMA2DSALbits __at(0x3BD0);
// bitfield macros

// Register: DMA2DSAH
#define DMA2DSAH DMA2DSAH
extern volatile unsigned char           DMA2DSAH            __at(0x3BD1);
#ifndef _LIB_BUILD
asm("DMA2DSAH equ 03BD1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSA                    :8;
    };
    struct {
        unsigned DSA8                   :1;
        unsigned DSA9                   :1;
        unsigned DSA10                  :1;
        unsigned DSA11                  :1;
        unsigned DSA12                  :1;
        unsigned DSA13                  :1;
        unsigned DSA14                  :1;
        unsigned DSA15                  :1;
    };
    struct {
        unsigned DMA2DSA                :8;
    };
    struct {
        unsigned DMA2DSA8               :1;
        unsigned DMA2DSA9               :1;
        unsigned DMA2DSA10              :1;
        unsigned DMA2DSA11              :1;
        unsigned DMA2DSA12              :1;
        unsigned DMA2DSA13              :1;
        unsigned DMA2DSA14              :1;
        unsigned DMA2DSA15              :1;
    };
} DMA2DSAHbits_t;
extern volatile DMA2DSAHbits_t DMA2DSAHbits __at(0x3BD1);
// bitfield macros

// Register: DMA2SCNT
#define DMA2SCNT DMA2SCNT
extern volatile unsigned short          DMA2SCNT            __at(0x3BD2);
#ifndef _LIB_BUILD
asm("DMA2SCNT equ 03BD2h");
#endif

// Register: DMA2SCNTL
#define DMA2SCNTL DMA2SCNTL
extern volatile unsigned char           DMA2SCNTL           __at(0x3BD2);
#ifndef _LIB_BUILD
asm("DMA2SCNTL equ 03BD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :8;
    };
    struct {
        unsigned SCNT0                  :1;
        unsigned SCNT1                  :1;
        unsigned SCNT2                  :1;
        unsigned SCNT3                  :1;
        unsigned SCNT4                  :1;
        unsigned SCNT5                  :1;
        unsigned SCNT6                  :1;
        unsigned SCNT7                  :1;
    };
    struct {
        unsigned DMA2SCNT               :8;
    };
    struct {
        unsigned DMA2SCNT0              :1;
        unsigned DMA2SCNT1              :1;
        unsigned DMA2SCNT2              :1;
        unsigned DMA2SCNT3              :1;
        unsigned DMA2SCNT4              :1;
        unsigned DMA2SCNT5              :1;
        unsigned DMA2SCNT6              :1;
        unsigned DMA2SCNT7              :1;
    };
} DMA2SCNTLbits_t;
extern volatile DMA2SCNTLbits_t DMA2SCNTLbits __at(0x3BD2);
// bitfield macros

// Register: DMA2SCNTH
#define DMA2SCNTH DMA2SCNTH
extern volatile unsigned char           DMA2SCNTH           __at(0x3BD3);
#ifndef _LIB_BUILD
asm("DMA2SCNTH equ 03BD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :4;
    };
    struct {
        unsigned SCNT8                  :1;
        unsigned SCNT9                  :1;
        unsigned SCNT10                 :1;
        unsigned SCNT11                 :1;
    };
    struct {
        unsigned DMA2SCNT               :4;
    };
    struct {
        unsigned DMA2SCNT8              :1;
        unsigned DMA2SCNT9              :1;
        unsigned DMA2SCNT10             :1;
        unsigned DMA2SCNT11             :1;
    };
} DMA2SCNTHbits_t;
