LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile DMA2SCNTHbits_t DMA2SCNTHbits __at(0x3BD3);
// bitfield macros

// Register: DMA2SPTR
#define DMA2SPTR DMA2SPTR
#ifndef __CCI__
extern volatile __uint24                DMA2SPTR            __at(0x3BD4);
#endif
#ifndef _LIB_BUILD
asm("DMA2SPTR equ 03BD4h");
#endif

// Register: DMA2SPTRL
#define DMA2SPTRL DMA2SPTRL
extern volatile unsigned char           DMA2SPTRL           __at(0x3BD4);
#ifndef _LIB_BUILD
asm("DMA2SPTRL equ 03BD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR0                  :1;
        unsigned SPTR1                  :1;
        unsigned SPTR2                  :1;
        unsigned SPTR3                  :1;
        unsigned SPTR4                  :1;
        unsigned SPTR5                  :1;
        unsigned SPTR6                  :1;
        unsigned SPTR7                  :1;
    };
    struct {
        unsigned DMA2SPTR               :8;
    };
    struct {
        unsigned DMA2SPTR0              :1;
        unsigned DMA2SPTR1              :1;
        unsigned DMA2SPTR2              :1;
        unsigned DMA2SPTR3              :1;
        unsigned DMA2SPTR4              :1;
        unsigned DMA2SPTR5              :1;
        unsigned DMA2SPTR6              :1;
        unsigned DMA2SPTR7              :1;
    };
} DMA2SPTRLbits_t;
extern volatile DMA2SPTRLbits_t DMA2SPTRLbits __at(0x3BD4);
// bitfield macros

// Register: DMA2SPTRH
#define DMA2SPTRH DMA2SPTRH
extern volatile unsigned char           DMA2SPTRH           __at(0x3BD5);
#ifndef _LIB_BUILD
asm("DMA2SPTRH equ 03BD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR8                  :1;
        unsigned SPTR9                  :1;
        unsigned SPTR10                 :1;
        unsigned SPTR11                 :1;
        unsigned SPTR12                 :1;
        unsigned SPTR13                 :1;
        unsigned SPTR14                 :1;
        unsigned SPTR15                 :1;
    };
    struct {
        unsigned DMA2SPTR               :8;
    };
    struct {
        unsigned DMA2SPTR8              :1;
        unsigned DMA2SPTR9              :1;
        unsigned DMA2SPTR10             :1;
        unsigned DMA2SPTR11             :1;
        unsigned DMA2SPTR12             :1;
        unsigned DMA2SPTR13             :1;
        unsigned DMA2SPTR14             :1;
        unsigned DMA2SPTR15             :1;
    };
} DMA2SPTRHbits_t;
extern volatile DMA2SPTRHbits_t DMA2SPTRHbits __at(0x3BD5);
// bitfield macros

// Register: DMA2SPTRU
#define DMA2SPTRU DMA2SPTRU
extern volatile unsigned char           DMA2SPTRU           __at(0x3BD6);
#ifndef _LIB_BUILD
asm("DMA2SPTRU equ 03BD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :6;
    };
    struct {
        unsigned SPTR16                 :1;
        unsigned SPTR17                 :1;
        unsigned SPTR18                 :1;
        unsigned SPTR19                 :1;
        unsigned SPTR20                 :1;
        unsigned SPTR21                 :1;
    };
    struct {
        unsigned DMA2SPTR               :6;
    };
    struct {
        unsigned DMA2SPTR16             :1;
        unsigned DMA2SPTR17             :1;
        unsigned DMA2SPTR18             :1;
        unsigned DMA2SPTR19             :1;
        unsigned DMA2SPTR20             :1;
        unsigned DMA2SPTR21             :1;
    };
} DMA2SPTRUbits_t;
extern volatile DMA2SPTRUbits_t DMA2SPTRUbits __at(0x3BD6);
// bitfield macros

// Register: DMA2SSZ
#define DMA2SSZ DMA2SSZ
extern volatile unsigned short          DMA2SSZ             __at(0x3BD7);
#ifndef _LIB_BUILD
asm("DMA2SSZ equ 03BD7h");
#endif

// Register: DMA2SSZL
#define DMA2SSZL DMA2SSZL
extern volatile unsigned char           DMA2SSZL            __at(0x3BD7);
#ifndef _LIB_BUILD
asm("DMA2SSZL equ 03BD7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :8;
    };
    struct {
        unsigned DMA2SSZ                :8;
    };
    struct {
        unsigned SSZ0                   :1;
        unsigned SSZ1                   :1;
        unsigned SSZ2                   :1;
        unsigned SSZ3                   :1;
        unsigned SSZ4                   :1;
        unsigned SSZ5                   :1;
        unsigned SSZ6                   :1;
        unsigned SSZ7                   :1;
    };
    struct {
        unsigned DMA2SSZ0               :1;
        unsigned DMA2SSZ1               :1;
        unsigned DMA2SSZ2               :1;
        unsigned DMA2SSZ3               :1;
        unsigned DMA2SSZ4               :1;
        unsigned DMA2SSZ5               :1;
        unsigned DMA2SSZ6               :1;
        unsigned DMA2SSZ7               :1;
    };
} DMA2SSZLbits_t;
extern volatile DMA2SSZLbits_t DMA2SSZLbits __at(0x3BD7);
// bitfield macros

// Register: DMA2SSZH
#define DMA2SSZH DMA2SSZH
extern volatile unsigned char           DMA2SSZH            __at(0x3BD8);
#ifndef _LIB_BUILD
asm("DMA2SSZH equ 03BD8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :4;
    };
    struct {
        unsigned DMA2SSZ                :4;
    };
    struct {
        unsigned SSZ8                   :1;
        unsigned SSZ9                   :1;
        unsigned SSZ10                  :1;
        unsigned SSZ11                  :1;
    };
    struct {
        unsigned DMA2SSZ8               :1;
        unsigned DMA2SSZ9               :1;
        unsigned DMA2SSZ10              :1;
        unsigned DMA2SSZ11              :1;
    };
} DMA2SSZHbits_t;
extern volatile DMA2SSZHbits_t DMA2SSZHbits __at(0x3BD8);
// bitfield macros

// Register: DMA2SSA
#define DMA2SSA DMA2SSA
#ifndef __CCI__
extern volatile __uint24                DMA2SSA             __at(0x3BD9);
#endif
#ifndef _LIB_BUILD
asm("DMA2SSA equ 03BD9h");
#endif

// Register: DMA2SSAL
#define DMA2SSAL DMA2SSAL
extern volatile unsigned char           DMA2SSAL            __at(0x3BD9);
#ifndef _LIB_BUILD
asm("DMA2SSAL equ 03BD9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA0                   :1;
        unsigned SSA1                   :1;
        unsigned SSA2                   :1;
        unsigned SSA3                   :1;
        unsigned SSA4                   :1;
        unsigned SSA5                   :1;
        unsigned SSA6                   :1;
        unsigned SSA7                   :1;
    };
    struct {
        unsigned DMA2SSA                :8;
    };
    struct {
        unsigned DMA2SSA0               :1;
        unsigned DMA2SSA1               :1;
        unsigned DMA2SSA2               :1;
        unsigned DMA2SSA3               :1;
        unsigned DMA2SSA4               :1;
        unsigned DMA2SSA5               :1;
        unsigned DMA2SSA6               :1;
        unsigned DMA2SSA7               :1;
    };
} DMA2SSALbits_t;
