LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile DMA2SSALbits_t DMA2SSALbits __at(0x3BD9);
// bitfield macros

// Register: DMA2SSAH
#define DMA2SSAH DMA2SSAH
extern volatile unsigned char           DMA2SSAH            __at(0x3BDA);
#ifndef _LIB_BUILD
asm("DMA2SSAH equ 03BDAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA8                   :1;
        unsigned SSA9                   :1;
        unsigned SSA10                  :1;
        unsigned SSA11                  :1;
        unsigned SSA12                  :1;
        unsigned SSA13                  :1;
        unsigned SSA14                  :1;
        unsigned SSA15                  :1;
    };
    struct {
        unsigned DMA2SSA                :8;
    };
    struct {
        unsigned DMA2SSA8               :1;
        unsigned DMA2SSA9               :1;
        unsigned DMA2SSA10              :1;
        unsigned DMA2SSA11              :1;
        unsigned DMA2SSA12              :1;
        unsigned DMA2SSA13              :1;
        unsigned DMA2SSA14              :1;
        unsigned DMA2SSA15              :1;
    };
} DMA2SSAHbits_t;
extern volatile DMA2SSAHbits_t DMA2SSAHbits __at(0x3BDA);
// bitfield macros

// Register: DMA2SSAU
#define DMA2SSAU DMA2SSAU
extern volatile unsigned char           DMA2SSAU            __at(0x3BDB);
#ifndef _LIB_BUILD
asm("DMA2SSAU equ 03BDBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :6;
    };
    struct {
        unsigned SSA16                  :1;
        unsigned SSA17                  :1;
        unsigned SSA18                  :1;
        unsigned SSA19                  :1;
        unsigned SSA20                  :1;
        unsigned SSA21                  :1;
    };
    struct {
        unsigned DMA2SSA                :6;
    };
    struct {
        unsigned DMA2SSA16              :1;
        unsigned DMA2SSA17              :1;
        unsigned DMA2SSA18              :1;
        unsigned DMA2SSA19              :1;
        unsigned DMA2SSA20              :1;
        unsigned DMA2SSA21              :1;
    };
} DMA2SSAUbits_t;
extern volatile DMA2SSAUbits_t DMA2SSAUbits __at(0x3BDB);
// bitfield macros

// Register: DMA2CON0
#define DMA2CON0 DMA2CON0
extern volatile unsigned char           DMA2CON0            __at(0x3BDC);
#ifndef _LIB_BUILD
asm("DMA2CON0 equ 03BDCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XIP                    :1;
        unsigned                        :1;
        unsigned AIRQEN                 :1;
        unsigned                        :2;
        unsigned DGO                    :1;
        unsigned SIRQEN                 :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned DMA2XIP                :1;
        unsigned                        :1;
        unsigned DMA2AIRQEN             :1;
        unsigned                        :2;
        unsigned DMA2DGO                :1;
        unsigned DMA2SIRQEN             :1;
        unsigned DMA2EN                 :1;
    };
} DMA2CON0bits_t;
extern volatile DMA2CON0bits_t DMA2CON0bits __at(0x3BDC);
// bitfield macros

// Register: DMA2CON1
#define DMA2CON1 DMA2CON1
extern volatile unsigned char           DMA2CON1            __at(0x3BDD);
#ifndef _LIB_BUILD
asm("DMA2CON1 equ 03BDDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSTP                   :1;
        unsigned SMODE                  :2;
        unsigned SMR                    :2;
        unsigned DSTP                   :1;
        unsigned DMODE                  :2;
    };
} DMA2CON1bits_t;
extern volatile DMA2CON1bits_t DMA2CON1bits __at(0x3BDD);
// bitfield macros

// Register: DMA2AIRQ
#define DMA2AIRQ DMA2AIRQ
extern volatile unsigned char           DMA2AIRQ            __at(0x3BDE);
#ifndef _LIB_BUILD
asm("DMA2AIRQ equ 03BDEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AIRQ                   :8;
    };
    struct {
        unsigned DMA2AIRQ               :8;
    };
    struct {
        unsigned AIRQ0                  :1;
        unsigned AIRQ1                  :1;
        unsigned AIRQ2                  :1;
        unsigned AIRQ3                  :1;
        unsigned AIRQ4                  :1;
        unsigned AIRQ5                  :1;
        unsigned AIRQ6                  :1;
    };
    struct {
        unsigned DMA2AIRQ0              :1;
        unsigned DMA2AIRQ1              :1;
        unsigned DMA2AIRQ2              :1;
        unsigned DMA2AIRQ3              :1;
        unsigned DMA2AIRQ4              :1;
        unsigned DMA2AIRQ5              :1;
        unsigned DMA2AIRQ6              :1;
    };
} DMA2AIRQbits_t;
extern volatile DMA2AIRQbits_t DMA2AIRQbits __at(0x3BDE);
// bitfield macros

// Register: DMA2SIRQ
#define DMA2SIRQ DMA2SIRQ
extern volatile unsigned char           DMA2SIRQ            __at(0x3BDF);
#ifndef _LIB_BUILD
asm("DMA2SIRQ equ 03BDFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SIRQ                   :8;
    };
    struct {
        unsigned DMA2SIRQ               :8;
    };
    struct {
        unsigned SIRQ0                  :1;
        unsigned SIRQ1                  :1;
        unsigned SIRQ2                  :1;
        unsigned SIRQ3                  :1;
        unsigned SIRQ4                  :1;
        unsigned SIRQ5                  :1;
        unsigned SIRQ6                  :1;
    };
    struct {
        unsigned DMA2SIRQ0              :1;
        unsigned DMA2SIRQ1              :1;
        unsigned DMA2SIRQ2              :1;
        unsigned DMA2SIRQ3              :1;
        unsigned DMA2SIRQ4              :1;
        unsigned DMA2SIRQ5              :1;
        unsigned DMA2SIRQ6              :1;
    };
} DMA2SIRQbits_t;
extern volatile DMA2SIRQbits_t DMA2SIRQbits __at(0x3BDF);
// bitfield macros

// Register: DMA1BUF
#define DMA1BUF DMA1BUF
extern volatile unsigned char           DMA1BUF             __at(0x3BE9);
#ifndef _LIB_BUILD
asm("DMA1BUF equ 03BE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUF                    :8;
    };
    struct {
        unsigned BUF0                   :1;
        unsigned BUF1                   :1;
        unsigned BUF2                   :1;
        unsigned BUF3                   :1;
        unsigned BUF4                   :1;
        unsigned BUF5                   :1;
        unsigned BUF6                   :1;
        unsigned BUF7                   :1;
    };
    struct {
        unsigned DMA1BUF                :8;
    };
    struct {
        unsigned DMA1BUF0               :1;
        unsigned DMA1BUF1               :1;
        unsigned DMA1BUF2               :1;
        unsigned DMA1BUF3               :1;
        unsigned DMA1BUF4               :1;
        unsigned DMA1BUF5               :1;
        unsigned DMA1BUF6               :1;
        unsigned DMA1BUF7               :1;
    };
} DMA1BUFbits_t;
extern volatile DMA1BUFbits_t DMA1BUFbits __at(0x3BE9);
// bitfield macros

