LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: DMA1DCNT
#define DMA1DCNT DMA1DCNT
extern volatile unsigned short          DMA1DCNT            __at(0x3BEA);
#ifndef _LIB_BUILD
asm("DMA1DCNT equ 03BEAh");
#endif

// Register: DMA1DCNTL
#define DMA1DCNTL DMA1DCNTL
extern volatile unsigned char           DMA1DCNTL           __at(0x3BEA);
#ifndef _LIB_BUILD
asm("DMA1DCNTL equ 03BEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :8;
    };
    struct {
        unsigned DCNT0                  :1;
        unsigned DCNT1                  :1;
        unsigned DCNT2                  :1;
        unsigned DCNT3                  :1;
        unsigned DCNT4                  :1;
        unsigned DCNT5                  :1;
        unsigned DCNT6                  :1;
        unsigned DCNT7                  :1;
    };
    struct {
        unsigned DMA1DCNT               :8;
    };
    struct {
        unsigned DMA1DCNT0              :1;
        unsigned DMA1DCNT1              :1;
        unsigned DMA1DCNT2              :1;
        unsigned DMA1DCNT3              :1;
        unsigned DMA1DCNT4              :1;
        unsigned DMA1DCNT5              :1;
        unsigned DMA1DCNT6              :1;
        unsigned DMA1DCNT7              :1;
    };
} DMA1DCNTLbits_t;
extern volatile DMA1DCNTLbits_t DMA1DCNTLbits __at(0x3BEA);
// bitfield macros

// Register: DMA1DCNTH
#define DMA1DCNTH DMA1DCNTH
extern volatile unsigned char           DMA1DCNTH           __at(0x3BEB);
#ifndef _LIB_BUILD
asm("DMA1DCNTH equ 03BEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :4;
    };
    struct {
        unsigned DCNT8                  :1;
        unsigned DCNT9                  :1;
        unsigned DCNT10                 :1;
        unsigned DCNT11                 :1;
    };
    struct {
        unsigned DMA1SCNT               :4;
    };
    struct {
        unsigned DMA1DCNT8              :1;
        unsigned DMA1DCNT9              :1;
        unsigned DMA1DCNT10             :1;
        unsigned DMA1DCNT11             :1;
    };
} DMA1DCNTHbits_t;
extern volatile DMA1DCNTHbits_t DMA1DCNTHbits __at(0x3BEB);
// bitfield macros

// Register: DMA1DPTR
#define DMA1DPTR DMA1DPTR
extern volatile unsigned short          DMA1DPTR            __at(0x3BEC);
#ifndef _LIB_BUILD
asm("DMA1DPTR equ 03BECh");
#endif

// Register: DMA1DPTRL
#define DMA1DPTRL DMA1DPTRL
extern volatile unsigned char           DMA1DPTRL           __at(0x3BEC);
#ifndef _LIB_BUILD
asm("DMA1DPTRL equ 03BECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR0                  :1;
        unsigned DPTR1                  :1;
        unsigned DPTR2                  :1;
        unsigned DPTR3                  :1;
        unsigned DPTR4                  :1;
        unsigned DPTR5                  :1;
        unsigned DPTR6                  :1;
        unsigned DPTR7                  :1;
    };
    struct {
        unsigned DMA1DPTR               :8;
    };
    struct {
        unsigned DMA1DPTR0              :1;
        unsigned DMA1DPTR1              :1;
        unsigned DMA1DPTR2              :1;
        unsigned DMA1DPTR3              :1;
        unsigned DMA1DPTR4              :1;
        unsigned DMA1DPTR5              :1;
        unsigned DMA1DPTR6              :1;
        unsigned DMA1DPTR7              :1;
    };
} DMA1DPTRLbits_t;
extern volatile DMA1DPTRLbits_t DMA1DPTRLbits __at(0x3BEC);
// bitfield macros

// Register: DMA1DPTRH
#define DMA1DPTRH DMA1DPTRH
extern volatile unsigned char           DMA1DPTRH           __at(0x3BED);
#ifndef _LIB_BUILD
asm("DMA1DPTRH equ 03BEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR8                  :1;
        unsigned DPTR9                  :1;
        unsigned DPTR10                 :1;
        unsigned DPTR11                 :1;
        unsigned DPTR12                 :1;
        unsigned DPTR13                 :1;
        unsigned DPTR14                 :1;
        unsigned DPTR15                 :1;
    };
    struct {
        unsigned DMA1DPTR               :8;
    };
    struct {
        unsigned DMA1DPTR8              :1;
        unsigned DMA1DPTR9              :1;
        unsigned DMA1DPTR10             :1;
        unsigned DMA1DPTR11             :1;
        unsigned DMA1DPTR12             :1;
        unsigned DMA1DPTR13             :1;
        unsigned DMA1DPTR14             :1;
        unsigned DMA1DPTR15             :1;
    };
} DMA1DPTRHbits_t;
extern volatile DMA1DPTRHbits_t DMA1DPTRHbits __at(0x3BED);
// bitfield macros

// Register: DMA1DSZ
#define DMA1DSZ DMA1DSZ
extern volatile unsigned short          DMA1DSZ             __at(0x3BEE);
#ifndef _LIB_BUILD
asm("DMA1DSZ equ 03BEEh");
#endif

// Register: DMA1DSZL
#define DMA1DSZL DMA1DSZL
extern volatile unsigned char           DMA1DSZL            __at(0x3BEE);
#ifndef _LIB_BUILD
asm("DMA1DSZL equ 03BEEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :8;
    };
    struct {
        unsigned DMA1DSZ                :8;
    };
    struct {
        unsigned DSZ0                   :1;
        unsigned DSZ1                   :1;
        unsigned DSZ2                   :1;
        unsigned DSZ3                   :1;
        unsigned DSZ4                   :1;
        unsigned DSZ5                   :1;
        unsigned DSZ6                   :1;
        unsigned DSZ7                   :1;
    };
    struct {
        unsigned DMA1DSZ0               :1;
        unsigned DMA1DSZ1               :1;
        unsigned DMA1DSZ2               :1;
        unsigned DMA1DSZ3               :1;
        unsigned DMA1DSZ4               :1;
        unsigned DMA1DSZ5               :1;
        unsigned DMA1DSZ6               :1;
        unsigned DMA1DSZ7               :1;
    };
} DMA1DSZLbits_t;
extern volatile DMA1DSZLbits_t DMA1DSZLbits __at(0x3BEE);
// bitfield macros

// Register: DMA1DSZH
#define DMA1DSZH DMA1DSZH
extern volatile unsigned char           DMA1DSZH            __at(0x3BEF);
#ifndef _LIB_BUILD
asm("DMA1DSZH equ 03BEFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :4;
    };
    struct {
        unsigned DMA1DSZ                :4;
    };
    struct {
        unsigned DSZ8                   :1;
        unsigned DSZ9                   :1;
        unsigned DSZ10                  :1;
        unsigned DSZ11                  :1;
    };
    struct {
        unsigned DMA1DSZ8               :1;
        unsigned DMA1DSZ9               :1;
        unsigned DMA1DSZ10              :1;
        unsigned DMA1DSZ11              :1;
    };
} DMA1DSZHbits_t;
extern volatile DMA1DSZHbits_t DMA1DSZHbits __at(0x3BEF);
// bitfield macros

// Register: DMA1DSA
#define DMA1DSA DMA1DSA
extern volatile unsigned short          DMA1DSA             __at(0x3BF0);
#ifndef _LIB_BUILD
asm("DMA1DSA equ 03BF0h");
#endif

// Register: DMA1DSAL
#define DMA1DSAL DMA1DSAL
extern volatile unsigned char           DMA1DSAL            __at(0x3BF0);
#ifndef _LIB_BUILD
asm("DMA1DSAL equ 03BF0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA0                   :1;
        unsigned SSA1                   :1;
        unsigned SSA2                   :1;
        unsigned SSA3                   :1;
        unsigned SSA4                   :1;
        unsigned SSA5                   :1;
        unsigned SSA6                   :1;
        unsigned SSA7                   :1;
    };
    struct {
        unsigned DMA1DSA                :8;
    };
    struct {
        unsigned DMA1DSA0               :1;
        unsigned DMA1DSA1               :1;
        unsigned DMA1DSA2               :1;
        unsigned DMA1DSA3               :1;
        unsigned DMA1DSA4               :1;
        unsigned DMA1DSA5               :1;
        unsigned DMA1DSA6               :1;
        unsigned DMA1DSA7               :1;
    };
} DMA1DSALbits_t;
extern volatile DMA1DSALbits_t DMA1DSALbits __at(0x3BF0);
// bitfield macros

