LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: DMA1DSAH
#define DMA1DSAH DMA1DSAH
extern volatile unsigned char           DMA1DSAH            __at(0x3BF1);
#ifndef _LIB_BUILD
asm("DMA1DSAH equ 03BF1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSA                    :8;
    };
    struct {
        unsigned DSA8                   :1;
        unsigned DSA9                   :1;
        unsigned DSA10                  :1;
        unsigned DSA11                  :1;
        unsigned DSA12                  :1;
        unsigned DSA13                  :1;
        unsigned DSA14                  :1;
        unsigned DSA15                  :1;
    };
    struct {
        unsigned DMA1DSA                :8;
    };
    struct {
        unsigned DMA1DSA8               :1;
        unsigned DMA1DSA9               :1;
        unsigned DMA1DSA10              :1;
        unsigned DMA1DSA11              :1;
        unsigned DMA1DSA12              :1;
        unsigned DMA1DSA13              :1;
        unsigned DMA1DSA14              :1;
        unsigned DMA1DSA15              :1;
    };
} DMA1DSAHbits_t;
extern volatile DMA1DSAHbits_t DMA1DSAHbits __at(0x3BF1);
// bitfield macros

// Register: DMA1SCNT
#define DMA1SCNT DMA1SCNT
extern volatile unsigned short          DMA1SCNT            __at(0x3BF2);
#ifndef _LIB_BUILD
asm("DMA1SCNT equ 03BF2h");
#endif

// Register: DMA1SCNTL
#define DMA1SCNTL DMA1SCNTL
extern volatile unsigned char           DMA1SCNTL           __at(0x3BF2);
#ifndef _LIB_BUILD
asm("DMA1SCNTL equ 03BF2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :8;
    };
    struct {
        unsigned SCNT0                  :1;
        unsigned SCNT1                  :1;
        unsigned SCNT2                  :1;
        unsigned SCNT3                  :1;
        unsigned SCNT4                  :1;
        unsigned SCNT5                  :1;
        unsigned SCNT6                  :1;
        unsigned SCNT7                  :1;
    };
    struct {
        unsigned DMA1SCNT               :8;
    };
    struct {
        unsigned DMA1SCNT0              :1;
        unsigned DMA1SCNT1              :1;
        unsigned DMA1SCNT2              :1;
        unsigned DMA1SCNT3              :1;
        unsigned DMA1SCNT4              :1;
        unsigned DMA1SCNT5              :1;
        unsigned DMA1SCNT6              :1;
        unsigned DMA1SCNT7              :1;
    };
} DMA1SCNTLbits_t;
extern volatile DMA1SCNTLbits_t DMA1SCNTLbits __at(0x3BF2);
// bitfield macros

// Register: DMA1SCNTH
#define DMA1SCNTH DMA1SCNTH
extern volatile unsigned char           DMA1SCNTH           __at(0x3BF3);
#ifndef _LIB_BUILD
asm("DMA1SCNTH equ 03BF3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCNT                   :4;
    };
    struct {
        unsigned SCNT8                  :1;
        unsigned SCNT9                  :1;
        unsigned SCNT10                 :1;
        unsigned SCNT11                 :1;
    };
    struct {
        unsigned DMA1SCNT               :4;
    };
    struct {
        unsigned DMA1SCNT8              :1;
        unsigned DMA1SCNT9              :1;
        unsigned DMA1SCNT10             :1;
        unsigned DMA1SCNT11             :1;
    };
} DMA1SCNTHbits_t;
extern volatile DMA1SCNTHbits_t DMA1SCNTHbits __at(0x3BF3);
// bitfield macros

// Register: DMA1SPTR
#define DMA1SPTR DMA1SPTR
#ifndef __CCI__
extern volatile __uint24                DMA1SPTR            __at(0x3BF4);
#endif
#ifndef _LIB_BUILD
asm("DMA1SPTR equ 03BF4h");
#endif

// Register: DMA1SPTRL
#define DMA1SPTRL DMA1SPTRL
extern volatile unsigned char           DMA1SPTRL           __at(0x3BF4);
#ifndef _LIB_BUILD
asm("DMA1SPTRL equ 03BF4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR0                  :1;
        unsigned SPTR1                  :1;
        unsigned SPTR2                  :1;
        unsigned SPTR3                  :1;
        unsigned SPTR4                  :1;
        unsigned SPTR5                  :1;
        unsigned SPTR6                  :1;
        unsigned SPTR7                  :1;
    };
    struct {
        unsigned DMA1SPTR               :8;
    };
    struct {
        unsigned DMA1SPTR0              :1;
        unsigned DMA1SPTR1              :1;
        unsigned DMA1SPTR2              :1;
        unsigned DMA1SPTR3              :1;
        unsigned DMA1SPTR4              :1;
        unsigned DMA1SPTR5              :1;
        unsigned DMA1SPTR6              :1;
        unsigned DMA1SPTR7              :1;
    };
} DMA1SPTRLbits_t;
extern volatile DMA1SPTRLbits_t DMA1SPTRLbits __at(0x3BF4);
// bitfield macros

// Register: DMA1SPTRH
#define DMA1SPTRH DMA1SPTRH
extern volatile unsigned char           DMA1SPTRH           __at(0x3BF5);
#ifndef _LIB_BUILD
asm("DMA1SPTRH equ 03BF5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR8                  :1;
        unsigned SPTR9                  :1;
        unsigned SPTR10                 :1;
        unsigned SPTR11                 :1;
        unsigned SPTR12                 :1;
        unsigned SPTR13                 :1;
        unsigned SPTR14                 :1;
        unsigned SPTR15                 :1;
    };
    struct {
        unsigned DMA1SPTR               :8;
    };
    struct {
        unsigned DMA1SPTR8              :1;
        unsigned DMA1SPTR9              :1;
        unsigned DMA1SPTR10             :1;
        unsigned DMA1SPTR11             :1;
        unsigned DMA1SPTR12             :1;
        unsigned DMA1SPTR13             :1;
        unsigned DMA1SPTR14             :1;
        unsigned DMA1SPTR15             :1;
    };
} DMA1SPTRHbits_t;
extern volatile DMA1SPTRHbits_t DMA1SPTRHbits __at(0x3BF5);
// bitfield macros

// Register: DMA1SPTRU
#define DMA1SPTRU DMA1SPTRU
extern volatile unsigned char           DMA1SPTRU           __at(0x3BF6);
#ifndef _LIB_BUILD
asm("DMA1SPTRU equ 03BF6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :6;
    };
    struct {
        unsigned SPTR16                 :1;
        unsigned SPTR17                 :1;
        unsigned SPTR18                 :1;
        unsigned SPTR19                 :1;
        unsigned SPTR20                 :1;
        unsigned SPTR21                 :1;
    };
    struct {
        unsigned DMA1SPTR               :6;
    };
    struct {
        unsigned DMA1SPTR16             :1;
        unsigned DMA1SPTR17             :1;
        unsigned DMA1SPTR18             :1;
        unsigned DMA1SPTR19             :1;
        unsigned DMA1SPTR20             :1;
        unsigned DMA1SPTR21             :1;
    };
} DMA1SPTRUbits_t;
