LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile DMA1SPTRUbits_t DMA1SPTRUbits __at(0x3BF6);
// bitfield macros

// Register: DMA1SSZ
#define DMA1SSZ DMA1SSZ
extern volatile unsigned short          DMA1SSZ             __at(0x3BF7);
#ifndef _LIB_BUILD
asm("DMA1SSZ equ 03BF7h");
#endif

// Register: DMA1SSZL
#define DMA1SSZL DMA1SSZL
extern volatile unsigned char           DMA1SSZL            __at(0x3BF7);
#ifndef _LIB_BUILD
asm("DMA1SSZL equ 03BF7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :8;
    };
    struct {
        unsigned DMA1SSZ                :8;
    };
    struct {
        unsigned SSZ0                   :1;
        unsigned SSZ1                   :1;
        unsigned SSZ2                   :1;
        unsigned SSZ3                   :1;
        unsigned SSZ4                   :1;
        unsigned SSZ5                   :1;
        unsigned SSZ6                   :1;
        unsigned SSZ7                   :1;
    };
    struct {
        unsigned DMA1SSZ0               :1;
        unsigned DMA1SSZ1               :1;
        unsigned DMA1SSZ2               :1;
        unsigned DMA1SSZ3               :1;
        unsigned DMA1SSZ4               :1;
        unsigned DMA1SSZ5               :1;
        unsigned DMA1SSZ6               :1;
        unsigned DMA1SSZ7               :1;
    };
} DMA1SSZLbits_t;
extern volatile DMA1SSZLbits_t DMA1SSZLbits __at(0x3BF7);
// bitfield macros

// Register: DMA1SSZH
#define DMA1SSZH DMA1SSZH
extern volatile unsigned char           DMA1SSZH            __at(0x3BF8);
#ifndef _LIB_BUILD
asm("DMA1SSZH equ 03BF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :4;
    };
    struct {
        unsigned DMA1SSZ                :4;
    };
    struct {
        unsigned SSZ8                   :1;
        unsigned SSZ9                   :1;
        unsigned SSZ10                  :1;
        unsigned SSZ11                  :1;
    };
    struct {
        unsigned DMA1SSZ8               :1;
        unsigned DMA1SSZ9               :1;
        unsigned DMA1SSZ10              :1;
        unsigned DMA1SSZ11              :1;
    };
} DMA1SSZHbits_t;
extern volatile DMA1SSZHbits_t DMA1SSZHbits __at(0x3BF8);
// bitfield macros

// Register: DMA1SSA
#define DMA1SSA DMA1SSA
#ifndef __CCI__
extern volatile __uint24                DMA1SSA             __at(0x3BF9);
#endif
#ifndef _LIB_BUILD
asm("DMA1SSA equ 03BF9h");
#endif

// Register: DMA1SSAL
#define DMA1SSAL DMA1SSAL
extern volatile unsigned char           DMA1SSAL            __at(0x3BF9);
#ifndef _LIB_BUILD
asm("DMA1SSAL equ 03BF9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA0                   :1;
        unsigned SSA1                   :1;
        unsigned SSA2                   :1;
        unsigned SSA3                   :1;
        unsigned SSA4                   :1;
        unsigned SSA5                   :1;
        unsigned SSA6                   :1;
        unsigned SSA7                   :1;
    };
    struct {
        unsigned DMA1SSA                :8;
    };
    struct {
        unsigned DMA1SSA0               :1;
        unsigned DMA1SSA1               :1;
        unsigned DMA1SSA2               :1;
        unsigned DMA1SSA3               :1;
        unsigned DMA1SSA4               :1;
        unsigned DMA1SSA5               :1;
        unsigned DMA1SSA6               :1;
        unsigned DMA1SSA7               :1;
    };
} DMA1SSALbits_t;
extern volatile DMA1SSALbits_t DMA1SSALbits __at(0x3BF9);
// bitfield macros

// Register: DMA1SSAH
#define DMA1SSAH DMA1SSAH
extern volatile unsigned char           DMA1SSAH            __at(0x3BFA);
#ifndef _LIB_BUILD
asm("DMA1SSAH equ 03BFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA8                   :1;
        unsigned SSA9                   :1;
        unsigned SSA10                  :1;
        unsigned SSA11                  :1;
        unsigned SSA12                  :1;
        unsigned SSA13                  :1;
        unsigned SSA14                  :1;
        unsigned SSA15                  :1;
    };
    struct {
        unsigned DMA1SSA                :8;
    };
    struct {
        unsigned DMA1SSA8               :1;
        unsigned DMA1SSA9               :1;
        unsigned DMA1SSA10              :1;
        unsigned DMA1SSA11              :1;
        unsigned DMA1SSA12              :1;
        unsigned DMA1SSA13              :1;
        unsigned DMA1SSA14              :1;
        unsigned DMA1SSA15              :1;
    };
} DMA1SSAHbits_t;
extern volatile DMA1SSAHbits_t DMA1SSAHbits __at(0x3BFA);
// bitfield macros

// Register: DMA1SSAU
#define DMA1SSAU DMA1SSAU
extern volatile unsigned char           DMA1SSAU            __at(0x3BFB);
#ifndef _LIB_BUILD
asm("DMA1SSAU equ 03BFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :6;
    };
    struct {
        unsigned SSA16                  :1;
        unsigned SSA17                  :1;
        unsigned SSA18                  :1;
        unsigned SSA19                  :1;
        unsigned SSA20                  :1;
        unsigned SSA21                  :1;
    };
    struct {
        unsigned DMA1SSA                :6;
    };
    struct {
        unsigned DMA1SSA16              :1;
        unsigned DMA1SSA17              :1;
        unsigned DMA1SSA18              :1;
        unsigned DMA1SSA19              :1;
        unsigned DMA1SSA20              :1;
        unsigned DMA1SSA21              :1;
    };
} DMA1SSAUbits_t;
extern volatile DMA1SSAUbits_t DMA1SSAUbits __at(0x3BFB);
// bitfield macros

// Register: DMA1CON0
#define DMA1CON0 DMA1CON0
extern volatile unsigned char           DMA1CON0            __at(0x3BFC);
#ifndef _LIB_BUILD
asm("DMA1CON0 equ 03BFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XIP                    :1;
        unsigned                        :1;
        unsigned AIRQEN                 :1;
        unsigned                        :2;
        unsigned DGO                    :1;
        unsigned SIRQEN                 :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned DMA1XIP                :1;
        unsigned                        :1;
        unsigned DMA1AIRQEN             :1;
        unsigned                        :2;
        unsigned DMA1DGO                :1;
        unsigned DMA1SIRQEN             :1;
        unsigned DMA1EN                 :1;
    };
} DMA1CON0bits_t;
extern volatile DMA1CON0bits_t DMA1CON0bits __at(0x3BFC);
// bitfield macros

// Register: DMA1CON1
#define DMA1CON1 DMA1CON1
extern volatile unsigned char           DMA1CON1            __at(0x3BFD);
#ifndef _LIB_BUILD
asm("DMA1CON1 equ 03BFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSTP                   :1;
        unsigned SMODE                  :2;
        unsigned SMR                    :2;
        unsigned DSTP                   :1;
        unsigned DMODE                  :2;
    };
} DMA1CON1bits_t;
extern volatile DMA1CON1bits_t DMA1CON1bits __at(0x3BFD);
// bitfield macros

// Register: DMA1AIRQ
#define DMA1AIRQ DMA1AIRQ
extern volatile unsigned char           DMA1AIRQ            __at(0x3BFE);
#ifndef _LIB_BUILD
asm("DMA1AIRQ equ 03BFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AIRQ                   :8;
    };
    struct {
        unsigned DMA1AIRQ               :8;
    };
    struct {
        unsigned AIRQ0                  :1;
        unsigned AIRQ1                  :1;
        unsigned AIRQ2                  :1;
        unsigned AIRQ3                  :1;
        unsigned AIRQ4                  :1;
        unsigned AIRQ5                  :1;
        unsigned AIRQ6                  :1;
    };
    struct {
        unsigned DMA1AIRQ0              :1;
        unsigned DMA1AIRQ1              :1;
        unsigned DMA1AIRQ2              :1;
        unsigned DMA1AIRQ3              :1;
        unsigned DMA1AIRQ4              :1;
        unsigned DMA1AIRQ5              :1;
        unsigned DMA1AIRQ6              :1;
    };
} DMA1AIRQbits_t;
