LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile DMA1AIRQbits_t DMA1AIRQbits __at(0x3BFE);
// bitfield macros

// Register: DMA1SIRQ
#define DMA1SIRQ DMA1SIRQ
extern volatile unsigned char           DMA1SIRQ            __at(0x3BFF);
#ifndef _LIB_BUILD
asm("DMA1SIRQ equ 03BFFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SIRQ                   :8;
    };
    struct {
        unsigned DMA1SIRQ               :8;
    };
    struct {
        unsigned SIRQ0                  :1;
        unsigned SIRQ1                  :1;
        unsigned SIRQ2                  :1;
        unsigned SIRQ3                  :1;
        unsigned SIRQ4                  :1;
        unsigned SIRQ5                  :1;
        unsigned SIRQ6                  :1;
    };
    struct {
        unsigned DMA1SIRQ0              :1;
        unsigned DMA1SIRQ1              :1;
        unsigned DMA1SIRQ2              :1;
        unsigned DMA1SIRQ3              :1;
        unsigned DMA1SIRQ4              :1;
        unsigned DMA1SIRQ5              :1;
        unsigned DMA1SIRQ6              :1;
    };
} DMA1SIRQbits_t;
extern volatile DMA1SIRQbits_t DMA1SIRQbits __at(0x3BFF);
// bitfield macros

// Register: CLC4CON
#define CLC4CON CLC4CON
extern volatile unsigned char           CLC4CON             __at(0x3C56);
#ifndef _LIB_BUILD
asm("CLC4CON equ 03C56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned LC4MODE                :3;
        unsigned LC4INTN                :1;
        unsigned LC4INTP                :1;
        unsigned LC4OUT                 :1;
        unsigned LC4OE                  :1;
        unsigned LC4EN                  :1;
    };
    struct {
        unsigned LC4MODE0               :1;
        unsigned LC4MODE1               :1;
        unsigned LC4MODE2               :1;
    };
} CLC4CONbits_t;
extern volatile CLC4CONbits_t CLC4CONbits __at(0x3C56);
// bitfield macros

// Register: CLC4POL
#define CLC4POL CLC4POL
extern volatile unsigned char           CLC4POL             __at(0x3C57);
#ifndef _LIB_BUILD
asm("CLC4POL equ 03C57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
    struct {
        unsigned LC4G1POL               :1;
        unsigned LC4G2POL               :1;
        unsigned LC4G3POL               :1;
        unsigned LC4G4POL               :1;
        unsigned                        :3;
        unsigned LC4POL                 :1;
    };
} CLC4POLbits_t;
extern volatile CLC4POLbits_t CLC4POLbits __at(0x3C57);
// bitfield macros

// Register: CLC4SEL0
#define CLC4SEL0 CLC4SEL0
extern volatile unsigned char           CLC4SEL0            __at(0x3C58);
#ifndef _LIB_BUILD
asm("CLC4SEL0 equ 03C58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D1S                    :8;
    };
    struct {
        unsigned LC4D1S                 :8;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned D1S3                   :1;
        unsigned D1S4                   :1;
        unsigned D1S5                   :1;
        unsigned D1S6                   :1;
        unsigned D1S7                   :1;
    };
    struct {
        unsigned LC4D1S0                :1;
        unsigned LC4D1S1                :1;
        unsigned LC4D1S2                :1;
        unsigned LC4D1S3                :1;
        unsigned LC4D1S4                :1;
        unsigned LC4D1S5                :1;
        unsigned LC4D1S6                :1;
        unsigned LC4D1S7                :1;
    };
} CLC4SEL0bits_t;
extern volatile CLC4SEL0bits_t CLC4SEL0bits __at(0x3C58);
// bitfield macros

// Register: CLC4SEL1
#define CLC4SEL1 CLC4SEL1
extern volatile unsigned char           CLC4SEL1            __at(0x3C59);
#ifndef _LIB_BUILD
asm("CLC4SEL1 equ 03C59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D2S                    :8;
    };
    struct {
        unsigned LC4D2S                 :8;
    };
    struct {
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
        unsigned D2S3                   :1;
        unsigned D2S4                   :1;
        unsigned D2S5                   :1;
        unsigned D2S6                   :1;
        unsigned D2S7                   :1;
    };
    struct {
        unsigned LC4D2S0                :1;
        unsigned LC4D2S1                :1;
        unsigned LC4D2S2                :1;
        unsigned LC4D2S3                :1;
        unsigned LC4D2S4                :1;
        unsigned LC4D2S5                :1;
        unsigned LC4D2S6                :1;
        unsigned LC4D2S7                :1;
    };
} CLC4SEL1bits_t;
extern volatile CLC4SEL1bits_t CLC4SEL1bits __at(0x3C59);
// bitfield macros

// Register: CLC4SEL2
#define CLC4SEL2 CLC4SEL2
extern volatile unsigned char           CLC4SEL2            __at(0x3C5A);
#ifndef _LIB_BUILD
asm("CLC4SEL2 equ 03C5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D3S                    :8;
    };
    struct {
        unsigned LC4D3S                 :8;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned D3S3                   :1;
        unsigned D3S4                   :1;
        unsigned D3S5                   :1;
        unsigned D3S6                   :1;
        unsigned D3S7                   :1;
    };
    struct {
        unsigned LC4D3S0                :1;
        unsigned LC4D3S1                :1;
        unsigned LC4D3S2                :1;
        unsigned LC4D3S3                :1;
        unsigned LC4D3S4                :1;
        unsigned LC4D3S5                :1;
        unsigned LC4D3S6                :1;
        unsigned LC4D3S7                :1;
    };
} CLC4SEL2bits_t;
extern volatile CLC4SEL2bits_t CLC4SEL2bits __at(0x3C5A);
// bitfield macros

// Register: CLC4SEL3
#define CLC4SEL3 CLC4SEL3
extern volatile unsigned char           CLC4SEL3            __at(0x3C5B);
#ifndef _LIB_BUILD
asm("CLC4SEL3 equ 03C5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D4S                    :8;
    };
    struct {
        unsigned LC4D4S                 :8;
    };
    struct {
        unsigned D4S0                   :1;
        unsigned D4S1                   :1;
        unsigned D4S2                   :1;
        unsigned D4S3                   :1;
        unsigned D4S4                   :1;
        unsigned D4S5                   :1;
        unsigned D4S6                   :1;
        unsigned D4S7                   :1;
    };
    struct {
        unsigned LC4D4S0                :1;
        unsigned LC4D4S1                :1;
        unsigned LC4D4S2                :1;
        unsigned LC4D4S3                :1;
        unsigned LC4D4S4                :1;
        unsigned LC4D4S5                :1;
        unsigned LC4D4S6                :1;
        unsigned LC4D4S7                :1;
    };
} CLC4SEL3bits_t;
