LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: MD1CON1
#define MD1CON1 MD1CON1
extern volatile unsigned char           MD1CON1             __at(0x3CFB);
#ifndef _LIB_BUILD
asm("MD1CON1 equ 03CFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLSYNC                 :1;
        unsigned CLPOL                  :1;
        unsigned                        :2;
        unsigned CHSYNC                 :1;
        unsigned CHPOL                  :1;
    };
    struct {
        unsigned MD1CLSYNC              :1;
        unsigned MD1CLPOL               :1;
        unsigned                        :2;
        unsigned MD1CHSYNC              :1;
        unsigned MD1CHPOL               :1;
    };
} MD1CON1bits_t;
extern volatile MD1CON1bits_t MD1CON1bits __at(0x3CFB);
// bitfield macros

// Register: MD1SRC
#define MD1SRC MD1SRC
extern volatile unsigned char           MD1SRC              __at(0x3CFC);
#ifndef _LIB_BUILD
asm("MD1SRC equ 03CFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MS                     :5;
    };
    struct {
        unsigned MS0                    :1;
        unsigned MS1                    :1;
        unsigned MS2                    :1;
        unsigned MS3                    :1;
        unsigned MS4                    :1;
    };
    struct {
        unsigned MD1MS                  :5;
    };
    struct {
        unsigned MD1MS0                 :1;
        unsigned MD1MS1                 :1;
        unsigned MD1MS2                 :1;
        unsigned MD1MS3                 :1;
        unsigned MD1MS4                 :1;
    };
} MD1SRCbits_t;
extern volatile MD1SRCbits_t MD1SRCbits __at(0x3CFC);
// bitfield macros

// Register: MD1CARL
#define MD1CARL MD1CARL
extern volatile unsigned char           MD1CARL             __at(0x3CFD);
#ifndef _LIB_BUILD
asm("MD1CARL equ 03CFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CL                     :5;
    };
    struct {
        unsigned CL0                    :1;
        unsigned CL1                    :1;
        unsigned CL2                    :1;
        unsigned CL3                    :1;
        unsigned CL4                    :1;
    };
    struct {
        unsigned MD1CL                  :5;
    };
    struct {
        unsigned MD1CL0                 :1;
        unsigned MD1CL1                 :1;
        unsigned MD1CL2                 :1;
        unsigned MD1CL3                 :1;
        unsigned MD1CL4                 :1;
    };
} MD1CARLbits_t;
extern volatile MD1CARLbits_t MD1CARLbits __at(0x3CFD);
// bitfield macros

// Register: MD1CARH
#define MD1CARH MD1CARH
extern volatile unsigned char           MD1CARH             __at(0x3CFE);
#ifndef _LIB_BUILD
asm("MD1CARH equ 03CFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH                     :5;
    };
    struct {
        unsigned CH0                    :1;
        unsigned CH1                    :1;
        unsigned CH2                    :1;
        unsigned CH3                    :1;
        unsigned CH4                    :1;
    };
    struct {
        unsigned MD1CH                  :5;
    };
    struct {
        unsigned MD1CH0                 :1;
        unsigned MD1CH1                 :1;
        unsigned MD1CH2                 :1;
        unsigned MD1CH3                 :1;
        unsigned MD1CH4                 :1;
    };
} MD1CARHbits_t;
extern volatile MD1CARHbits_t MD1CARHbits __at(0x3CFE);
// bitfield macros

// Register: SPI1RXB
#define SPI1RXB SPI1RXB
extern volatile unsigned char           SPI1RXB             __at(0x3D10);
#ifndef _LIB_BUILD
asm("SPI1RXB equ 03D10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
    struct {
        unsigned RXB0                   :1;
        unsigned RXB1                   :1;
        unsigned RXB2                   :1;
        unsigned RXB3                   :1;
        unsigned RXB4                   :1;
        unsigned RXB5                   :1;
        unsigned RXB6                   :1;
        unsigned RXB7                   :1;
    };
} SPI1RXBbits_t;
extern volatile SPI1RXBbits_t SPI1RXBbits __at(0x3D10);
// bitfield macros

// Register: SPI1TXB
#define SPI1TXB SPI1TXB
extern volatile unsigned char           SPI1TXB             __at(0x3D11);
#ifndef _LIB_BUILD
asm("SPI1TXB equ 03D11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
    struct {
        unsigned TXB0                   :1;
        unsigned TXB1                   :1;
        unsigned TXB2                   :1;
        unsigned TXB3                   :1;
        unsigned TXB4                   :1;
        unsigned TXB5                   :1;
        unsigned TXB6                   :1;
        unsigned TXB7                   :1;
    };
} SPI1TXBbits_t;
extern volatile SPI1TXBbits_t SPI1TXBbits __at(0x3D11);
// bitfield macros

// Register: SPI1TCNT
#define SPI1TCNT SPI1TCNT
extern volatile unsigned short          SPI1TCNT            __at(0x3D12);
#ifndef _LIB_BUILD
asm("SPI1TCNT equ 03D12h");
#endif

// Register: SPI1TCNTL
#define SPI1TCNTL SPI1TCNTL
extern volatile unsigned char           SPI1TCNTL           __at(0x3D12);
#ifndef _LIB_BUILD
asm("SPI1TCNTL equ 03D12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TCNTL                  :8;
    };
} SPI1TCNTLbits_t;
extern volatile SPI1TCNTLbits_t SPI1TCNTLbits __at(0x3D12);
// bitfield macros

// Register: SPI1TCNTH
#define SPI1TCNTH SPI1TCNTH
extern volatile unsigned char           SPI1TCNTH           __at(0x3D13);
#ifndef _LIB_BUILD
asm("SPI1TCNTH equ 03D13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TCNTH                  :3;
    };
} SPI1TCNTHbits_t;
extern volatile SPI1TCNTHbits_t SPI1TCNTHbits __at(0x3D13);
// bitfield macros

// Register: SPI1CON0
#define SPI1CON0 SPI1CON0
extern volatile unsigned char           SPI1CON0            __at(0x3D14);
#ifndef _LIB_BUILD
asm("SPI1CON0 equ 03D14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BMODE                  :1;
        unsigned MST                    :1;
        unsigned LSBF                   :1;
        unsigned                        :4;
        unsigned EN                     :1;
    };
    struct {
        unsigned SPI1BMODE              :1;
        unsigned SPI1MST                :1;
        unsigned SPI1LSBF               :1;
        unsigned                        :4;
        unsigned SPI1SPIEN              :1;
    };
} SPI1CON0bits_t;
extern volatile SPI1CON0bits_t SPI1CON0bits __at(0x3D14);
// bitfield macros

// Register: SPI1CON1
#define SPI1CON1 SPI1CON1
extern volatile unsigned char           SPI1CON1            __at(0x3D15);
#ifndef _LIB_BUILD
asm("SPI1CON1 equ 03D15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SDOP                   :1;
        unsigned SDIP                   :1;
        unsigned SSP                    :1;
        unsigned                        :1;
        unsigned FST                    :1;
        unsigned CKP                    :1;
        unsigned CKE                    :1;
        unsigned SMP                    :1;
    };
    struct {
        unsigned SPI1SDOP               :1;
        unsigned SPI1SDIP               :1;
        unsigned SPI1SSP                :1;
        unsigned                        :1;
        unsigned SPI1FST                :1;
        unsigned SPI1CKP                :1;
        unsigned SPI1CKE                :1;
        unsigned SPI1SMP                :1;
    };
} SPI1CON1bits_t;
extern volatile SPI1CON1bits_t SPI1CON1bits __at(0x3D15);
// bitfield macros

// Register: SPI1CON2
#define SPI1CON2 SPI1CON2
extern volatile unsigned char           SPI1CON2            __at(0x3D16);
#ifndef _LIB_BUILD
asm("SPI1CON2 equ 03D16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXR                    :1;
        unsigned TXR                    :1;
        unsigned SSET                   :1;
        unsigned                        :3;
        unsigned SSFLT                  :1;
        unsigned BUSY                   :1;
    };
    struct {
        unsigned SPI1RXR                :1;
        unsigned SPI1TXR                :1;
        unsigned SPI1SSET               :1;
        unsigned                        :3;
        unsigned SPI1SSFLT              :1;
        unsigned SPI1BUSY               :1;
    };
} SPI1CON2bits_t;
