LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile SPI1CON2bits_t SPI1CON2bits __at(0x3D16);
// bitfield macros

// Register: SPI1STATUS
#define SPI1STATUS SPI1STATUS
extern volatile unsigned char           SPI1STATUS          __at(0x3D17);
#ifndef _LIB_BUILD
asm("SPI1STATUS equ 03D17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned                        :1;
        unsigned CLRBF                  :1;
        unsigned RXRE                   :1;
        unsigned                        :1;
        unsigned TXBE                   :1;
        unsigned                        :1;
        unsigned TXWE                   :1;
    };
    struct {
        unsigned SPI1RXBF               :1;
        unsigned                        :1;
        unsigned SPI1CLRBF              :1;
        unsigned SPI1RXRE               :1;
        unsigned                        :1;
        unsigned SPI1TXBE               :1;
        unsigned                        :1;
        unsigned SPI1TXWE               :1;
    };
} SPI1STATUSbits_t;
extern volatile SPI1STATUSbits_t SPI1STATUSbits __at(0x3D17);
// bitfield macros

// Register: SPI1TWIDTH
#define SPI1TWIDTH SPI1TWIDTH
extern volatile unsigned char           SPI1TWIDTH          __at(0x3D18);
#ifndef _LIB_BUILD
asm("SPI1TWIDTH equ 03D18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TWIDTH                 :3;
    };
    struct {
        unsigned TWIDTH0                :1;
        unsigned TWIDTH1                :1;
        unsigned TWIDTH2                :1;
    };
} SPI1TWIDTHbits_t;
extern volatile SPI1TWIDTHbits_t SPI1TWIDTHbits __at(0x3D18);
// bitfield macros

// Register: SPI1BAUD
#define SPI1BAUD SPI1BAUD
extern volatile unsigned char           SPI1BAUD            __at(0x3D19);
#ifndef _LIB_BUILD
asm("SPI1BAUD equ 03D19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BAUD                   :8;
    };
    struct {
        unsigned BAUD0                  :1;
        unsigned BAUD1                  :1;
        unsigned BAUD2                  :1;
        unsigned BAUD3                  :1;
        unsigned BAUD4                  :1;
        unsigned BAUD5                  :1;
        unsigned BAUD6                  :1;
        unsigned BAUD7                  :1;
    };
} SPI1BAUDbits_t;
extern volatile SPI1BAUDbits_t SPI1BAUDbits __at(0x3D19);
// bitfield macros

// Register: SPI1INTF
#define SPI1INTF SPI1INTF
extern volatile unsigned char           SPI1INTF            __at(0x3D1A);
#ifndef _LIB_BUILD
asm("SPI1INTF equ 03D1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIF                  :1;
        unsigned RXOIF                  :1;
        unsigned                        :1;
        unsigned EOSIF                  :1;
        unsigned SOSIF                  :1;
        unsigned TCZIF                  :1;
        unsigned SRMTIF                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1TXUIF              :1;
        unsigned SPI1RXOIF              :1;
        unsigned                        :1;
        unsigned SPI1EOSIF              :1;
        unsigned SPI1SOSIF              :1;
        unsigned SPI1TCZIF              :1;
        unsigned SPI1SRMTIF             :1;
    };
} SPI1INTFbits_t;
extern volatile SPI1INTFbits_t SPI1INTFbits __at(0x3D1A);
// bitfield macros

// Register: SPI1INTE
#define SPI1INTE SPI1INTE
extern volatile unsigned char           SPI1INTE            __at(0x3D1B);
#ifndef _LIB_BUILD
asm("SPI1INTE equ 03D1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIE                  :1;
        unsigned RXOIE                  :1;
        unsigned                        :1;
        unsigned EOSIE                  :1;
        unsigned SOSIE                  :1;
        unsigned TCZIE                  :1;
        unsigned SRMTIE                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1TXUIE              :1;
        unsigned SPI1RXOIE              :1;
        unsigned                        :1;
        unsigned SPI1EOSIE              :1;
        unsigned SPI1SOSIE              :1;
        unsigned SPI1TCZIE              :1;
        unsigned SPI1SRMTIE             :1;
    };
} SPI1INTEbits_t;
extern volatile SPI1INTEbits_t SPI1INTEbits __at(0x3D1B);
// bitfield macros

// Register: SPI1CLK
#define SPI1CLK SPI1CLK
extern volatile unsigned char           SPI1CLK             __at(0x3D1C);
#ifndef _LIB_BUILD
asm("SPI1CLK equ 03D1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKSEL                 :8;
    };
    struct {
        unsigned CLKSEL0                :1;
        unsigned CLKSEL1                :1;
        unsigned CLKSEL2                :1;
    };
    struct {
        unsigned SPI1CLKSEL             :8;
    };
    struct {
        unsigned SPI1CLKSEL0            :1;
        unsigned SPI1CLKSEL1            :1;
        unsigned SPI1CLKSEL2            :1;
    };
} SPI1CLKbits_t;
extern volatile SPI1CLKbits_t SPI1CLKbits __at(0x3D1C);
// bitfield macros

// Register: I2C2RXB
#define I2C2RXB I2C2RXB
extern volatile unsigned char           I2C2RXB             __at(0x3D54);
#ifndef _LIB_BUILD
asm("I2C2RXB equ 03D54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} I2C2RXBbits_t;
extern volatile I2C2RXBbits_t I2C2RXBbits __at(0x3D54);
// bitfield macros

// Register: I2C2TXB
#define I2C2TXB I2C2TXB
extern volatile unsigned char           I2C2TXB             __at(0x3D55);
#ifndef _LIB_BUILD
asm("I2C2TXB equ 03D55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} I2C2TXBbits_t;
extern volatile I2C2TXBbits_t I2C2TXBbits __at(0x3D55);
// bitfield macros

// Register: I2C2CNT
#define I2C2CNT I2C2CNT
extern volatile unsigned char           I2C2CNT             __at(0x3D56);
#ifndef _LIB_BUILD
asm("I2C2CNT equ 03D56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT0                   :1;
        unsigned CNT1                   :1;
        unsigned CNT2                   :1;
        unsigned CNT3                   :1;
        unsigned CNT4                   :1;
        unsigned CNT5                   :1;
        unsigned CNT6                   :1;
        unsigned CNT7                   :1;
    };
} I2C2CNTbits_t;
extern volatile I2C2CNTbits_t I2C2CNTbits __at(0x3D56);
// bitfield macros

// Register: I2C2ADB0
#define I2C2ADB0 I2C2ADB0
extern volatile unsigned char           I2C2ADB0            __at(0x3D57);
#ifndef _LIB_BUILD
asm("I2C2ADB0 equ 03D57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C2ADB0bits_t;
extern volatile I2C2ADB0bits_t I2C2ADB0bits __at(0x3D57);
// bitfield macros

