LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: I2C2ADB1
#define I2C2ADB1 I2C2ADB1
extern volatile unsigned char           I2C2ADB1            __at(0x3D58);
#ifndef _LIB_BUILD
asm("I2C2ADB1 equ 03D58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C2ADB1bits_t;
extern volatile I2C2ADB1bits_t I2C2ADB1bits __at(0x3D58);
// bitfield macros

// Register: I2C2ADR0
#define I2C2ADR0 I2C2ADR0
extern volatile unsigned char           I2C2ADR0            __at(0x3D59);
#ifndef _LIB_BUILD
asm("I2C2ADR0 equ 03D59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C2ADR0bits_t;
extern volatile I2C2ADR0bits_t I2C2ADR0bits __at(0x3D59);
// bitfield macros

// Register: I2C2ADR1
#define I2C2ADR1 I2C2ADR1
extern volatile unsigned char           I2C2ADR1            __at(0x3D5A);
#ifndef _LIB_BUILD
asm("I2C2ADR1 equ 03D5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C2ADR1bits_t;
extern volatile I2C2ADR1bits_t I2C2ADR1bits __at(0x3D5A);
// bitfield macros

// Register: I2C2ADR2
#define I2C2ADR2 I2C2ADR2
extern volatile unsigned char           I2C2ADR2            __at(0x3D5B);
#ifndef _LIB_BUILD
asm("I2C2ADR2 equ 03D5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C2ADR2bits_t;
extern volatile I2C2ADR2bits_t I2C2ADR2bits __at(0x3D5B);
// bitfield macros

// Register: I2C2ADR3
#define I2C2ADR3 I2C2ADR3
extern volatile unsigned char           I2C2ADR3            __at(0x3D5C);
#ifndef _LIB_BUILD
asm("I2C2ADR3 equ 03D5Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C2ADR3bits_t;
extern volatile I2C2ADR3bits_t I2C2ADR3bits __at(0x3D5C);
// bitfield macros

// Register: I2C2CON0
#define I2C2CON0 I2C2CON0
extern volatile unsigned char           I2C2CON0            __at(0x3D5D);
#ifndef _LIB_BUILD
asm("I2C2CON0 equ 03D5Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned MDR                    :1;
        unsigned CSTR                   :1;
        unsigned S                      :1;
        unsigned RSEN                   :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned                        :4;
        unsigned I2CEN                  :1;
    };
} I2C2CON0bits_t;
extern volatile I2C2CON0bits_t I2C2CON0bits __at(0x3D5D);
// bitfield macros

// Register: I2C2CON1
#define I2C2CON1 I2C2CON1
extern volatile unsigned char           I2C2CON1            __at(0x3D5E);
#ifndef _LIB_BUILD
asm("I2C2CON1 equ 03D5Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSD                    :1;
        unsigned TXU                    :1;
        unsigned RXO                    :1;
        unsigned                        :1;
        unsigned ACKT                   :1;
        unsigned ACKSTAT                :1;
        unsigned ACKDT                  :1;
        unsigned ACKCNT                 :1;
    };
} I2C2CON1bits_t;
extern volatile I2C2CON1bits_t I2C2CON1bits __at(0x3D5E);
// bitfield macros

// Register: I2C2CON2
#define I2C2CON2 I2C2CON2
extern volatile unsigned char           I2C2CON2            __at(0x3D5F);
#ifndef _LIB_BUILD
asm("I2C2CON2 equ 03D5Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BFRET                  :2;
        unsigned SDAHT                  :2;
        unsigned ABD                    :1;
        unsigned FME                    :1;
        unsigned GCEN                   :1;
        unsigned ACNT                   :1;
    };
    struct {
        unsigned BFRET0                 :1;
        unsigned BFRET1                 :1;
        unsigned SDAHT0                 :1;
        unsigned SDAHT1                 :1;
    };
} I2C2CON2bits_t;
extern volatile I2C2CON2bits_t I2C2CON2bits __at(0x3D5F);
// bitfield macros

// Register: I2C2ERR
#define I2C2ERR I2C2ERR
extern volatile unsigned char           I2C2ERR             __at(0x3D60);
#ifndef _LIB_BUILD
asm("I2C2ERR equ 03D60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NACKIE                 :1;
        unsigned BCLIE                  :1;
        unsigned BTOIE                  :1;
        unsigned                        :1;
        unsigned NACKIF                 :1;
        unsigned BCLIF                  :1;
        unsigned BTOIF                  :1;
    };
    struct {
        unsigned NACK2IE                :1;
        unsigned BCL2IE                 :1;
        unsigned BTO2IE                 :1;
        unsigned                        :1;
        unsigned NACK2IF                :1;
        unsigned BCL2IF                 :1;
        unsigned BTO2IF                 :1;
    };
} I2C2ERRbits_t;
extern volatile I2C2ERRbits_t I2C2ERRbits __at(0x3D60);
// bitfield macros

// Register: I2C2STAT0
#define I2C2STAT0 I2C2STAT0
extern volatile unsigned char           I2C2STAT0           __at(0x3D61);
#ifndef _LIB_BUILD
asm("I2C2STAT0 equ 03D61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned D                      :1;
        unsigned R                      :1;
        unsigned MMA                    :1;
        unsigned SMA                    :1;
        unsigned BFRE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned DATA                   :1;
        unsigned READ                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_ADDRESS            :1;
        unsigned NOT_WRITE              :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_A                  :1;
        unsigned NOT_W                  :1;
    };
} I2C2STAT0bits_t;
