LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile I2C2STAT0bits_t I2C2STAT0bits __at(0x3D61);
// bitfield macros

// Register: I2C2STAT1
#define I2C2STAT1 I2C2STAT1
extern volatile unsigned char           I2C2STAT1           __at(0x3D62);
#ifndef _LIB_BUILD
asm("I2C2STAT1 equ 03D62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned                        :1;
        unsigned CLRBF                  :1;
        unsigned RXRE                   :1;
        unsigned                        :1;
        unsigned TXBE                   :1;
        unsigned                        :1;
        unsigned TXWE                   :1;
    };
} I2C2STAT1bits_t;
extern volatile I2C2STAT1bits_t I2C2STAT1bits __at(0x3D62);
// bitfield macros

// Register: I2C2PIR
#define I2C2PIR I2C2PIR
extern volatile unsigned char           I2C2PIR             __at(0x3D63);
#ifndef _LIB_BUILD
asm("I2C2PIR equ 03D63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIF                   :1;
        unsigned RSCIF                  :1;
        unsigned PCIF                   :1;
        unsigned ADRIF                  :1;
        unsigned WRIF                   :1;
        unsigned                        :1;
        unsigned ACKTIF                 :1;
        unsigned CNTIF                  :1;
    };
    struct {
        unsigned SC2IF                  :1;
        unsigned RSC2IF                 :1;
        unsigned PC2IF                  :1;
        unsigned ADR2IF                 :1;
        unsigned WR2IF                  :1;
        unsigned                        :1;
        unsigned ACKT2IF                :1;
        unsigned CNT2IF                 :1;
    };
} I2C2PIRbits_t;
extern volatile I2C2PIRbits_t I2C2PIRbits __at(0x3D63);
// bitfield macros

// Register: I2C2PIE
#define I2C2PIE I2C2PIE
extern volatile unsigned char           I2C2PIE             __at(0x3D64);
#ifndef _LIB_BUILD
asm("I2C2PIE equ 03D64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIE                   :1;
        unsigned RSCIE                  :1;
        unsigned PCIE                   :1;
        unsigned ADRIE                  :1;
        unsigned WRIE                   :1;
        unsigned                        :1;
        unsigned ACKTIE                 :1;
        unsigned CNTIE                  :1;
    };
    struct {
        unsigned SC2IE                  :1;
        unsigned RSC2IE                 :1;
        unsigned PC2IE                  :1;
        unsigned ADR2IE                 :1;
        unsigned WR2IE                  :1;
        unsigned                        :1;
        unsigned ACKT2IE                :1;
        unsigned CNT2IE                 :1;
    };
} I2C2PIEbits_t;
extern volatile I2C2PIEbits_t I2C2PIEbits __at(0x3D64);
// bitfield macros

// Register: I2C2CLK
#define I2C2CLK I2C2CLK
extern volatile unsigned char           I2C2CLK             __at(0x3D65);
#ifndef _LIB_BUILD
asm("I2C2CLK equ 03D65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned I2CCLK                 :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
    struct {
        unsigned I2CCLK0                :1;
        unsigned I2CCLK1                :1;
        unsigned I2CCLK2                :1;
        unsigned I2CCLK3                :1;
    };
} I2C2CLKbits_t;
extern volatile I2C2CLKbits_t I2C2CLKbits __at(0x3D65);
// bitfield macros

// Register: I2C2BTO
#define I2C2BTO I2C2BTO
extern volatile unsigned char           I2C2BTO             __at(0x3D66);
#ifndef _LIB_BUILD
asm("I2C2BTO equ 03D66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTO                    :8;
    };
    struct {
        unsigned I2CBTO                 :8;
    };
    struct {
        unsigned BTO0                   :1;
        unsigned BTO1                   :1;
        unsigned BTO2                   :1;
    };
    struct {
        unsigned I2CBTO0                :1;
        unsigned I2CBTO1                :1;
        unsigned I2CBTO2                :1;
    };
} I2C2BTObits_t;
extern volatile I2C2BTObits_t I2C2BTObits __at(0x3D66);
// bitfield macros

// Register: I2C1RXB
#define I2C1RXB I2C1RXB
extern volatile unsigned char           I2C1RXB             __at(0x3D6A);
#ifndef _LIB_BUILD
asm("I2C1RXB equ 03D6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} I2C1RXBbits_t;
extern volatile I2C1RXBbits_t I2C1RXBbits __at(0x3D6A);
// bitfield macros

// Register: I2C1TXB
#define I2C1TXB I2C1TXB
extern volatile unsigned char           I2C1TXB             __at(0x3D6B);
#ifndef _LIB_BUILD
asm("I2C1TXB equ 03D6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} I2C1TXBbits_t;
extern volatile I2C1TXBbits_t I2C1TXBbits __at(0x3D6B);
// bitfield macros

// Register: I2C1CNT
#define I2C1CNT I2C1CNT
extern volatile unsigned char           I2C1CNT             __at(0x3D6C);
#ifndef _LIB_BUILD
asm("I2C1CNT equ 03D6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT0                   :1;
        unsigned CNT1                   :1;
        unsigned CNT2                   :1;
        unsigned CNT3                   :1;
        unsigned CNT4                   :1;
        unsigned CNT5                   :1;
        unsigned CNT6                   :1;
        unsigned CNT7                   :1;
    };
} I2C1CNTbits_t;
extern volatile I2C1CNTbits_t I2C1CNTbits __at(0x3D6C);
// bitfield macros

// Register: I2C1ADB0
#define I2C1ADB0 I2C1ADB0
extern volatile unsigned char           I2C1ADB0            __at(0x3D6D);
#ifndef _LIB_BUILD
asm("I2C1ADB0 equ 03D6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB0bits_t;
