LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile I2C1ADB0bits_t I2C1ADB0bits __at(0x3D6D);
// bitfield macros

// Register: I2C1ADB1
#define I2C1ADB1 I2C1ADB1
extern volatile unsigned char           I2C1ADB1            __at(0x3D6E);
#ifndef _LIB_BUILD
asm("I2C1ADB1 equ 03D6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB1bits_t;
extern volatile I2C1ADB1bits_t I2C1ADB1bits __at(0x3D6E);
// bitfield macros

// Register: I2C1ADR0
#define I2C1ADR0 I2C1ADR0
extern volatile unsigned char           I2C1ADR0            __at(0x3D6F);
#ifndef _LIB_BUILD
asm("I2C1ADR0 equ 03D6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR0bits_t;
extern volatile I2C1ADR0bits_t I2C1ADR0bits __at(0x3D6F);
// bitfield macros

// Register: I2C1ADR1
#define I2C1ADR1 I2C1ADR1
extern volatile unsigned char           I2C1ADR1            __at(0x3D70);
#ifndef _LIB_BUILD
asm("I2C1ADR1 equ 03D70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR1bits_t;
extern volatile I2C1ADR1bits_t I2C1ADR1bits __at(0x3D70);
// bitfield macros

// Register: I2C1ADR2
#define I2C1ADR2 I2C1ADR2
extern volatile unsigned char           I2C1ADR2            __at(0x3D71);
#ifndef _LIB_BUILD
asm("I2C1ADR2 equ 03D71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR2bits_t;
extern volatile I2C1ADR2bits_t I2C1ADR2bits __at(0x3D71);
// bitfield macros

// Register: I2C1ADR3
#define I2C1ADR3 I2C1ADR3
extern volatile unsigned char           I2C1ADR3            __at(0x3D72);
#ifndef _LIB_BUILD
asm("I2C1ADR3 equ 03D72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR3bits_t;
extern volatile I2C1ADR3bits_t I2C1ADR3bits __at(0x3D72);
// bitfield macros

// Register: I2C1CON0
#define I2C1CON0 I2C1CON0
extern volatile unsigned char           I2C1CON0            __at(0x3D73);
#ifndef _LIB_BUILD
asm("I2C1CON0 equ 03D73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned MDR                    :1;
        unsigned CSTR                   :1;
        unsigned S                      :1;
        unsigned RSEN                   :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned                        :4;
        unsigned I2CEN                  :1;
    };
} I2C1CON0bits_t;
extern volatile I2C1CON0bits_t I2C1CON0bits __at(0x3D73);
// bitfield macros

// Register: I2C1CON1
#define I2C1CON1 I2C1CON1
extern volatile unsigned char           I2C1CON1            __at(0x3D74);
#ifndef _LIB_BUILD
asm("I2C1CON1 equ 03D74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSD                    :1;
        unsigned TXU                    :1;
        unsigned RXO                    :1;
        unsigned                        :1;
        unsigned ACKT                   :1;
        unsigned ACKSTAT                :1;
        unsigned ACKDT                  :1;
        unsigned ACKCNT                 :1;
    };
} I2C1CON1bits_t;
extern volatile I2C1CON1bits_t I2C1CON1bits __at(0x3D74);
// bitfield macros

// Register: I2C1CON2
#define I2C1CON2 I2C1CON2
extern volatile unsigned char           I2C1CON2            __at(0x3D75);
#ifndef _LIB_BUILD
asm("I2C1CON2 equ 03D75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BFRET                  :2;
        unsigned SDAHT                  :2;
        unsigned ABD                    :1;
        unsigned FME                    :1;
        unsigned GCEN                   :1;
        unsigned ACNT                   :1;
    };
    struct {
        unsigned BFRET0                 :1;
        unsigned BFRET1                 :1;
        unsigned SDAHT0                 :1;
        unsigned SDAHT1                 :1;
    };
} I2C1CON2bits_t;
extern volatile I2C1CON2bits_t I2C1CON2bits __at(0x3D75);
// bitfield macros

// Register: I2C1ERR
#define I2C1ERR I2C1ERR
extern volatile unsigned char           I2C1ERR             __at(0x3D76);
#ifndef _LIB_BUILD
asm("I2C1ERR equ 03D76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NACKIE                 :1;
        unsigned BCLIE                  :1;
        unsigned BTOIE                  :1;
        unsigned                        :1;
        unsigned NACKIF                 :1;
        unsigned BCLIF                  :1;
        unsigned BTOIF                  :1;
    };
    struct {
        unsigned NACK1IE                :1;
        unsigned BCL1IE                 :1;
        unsigned BTO1IE                 :1;
        unsigned                        :1;
        unsigned NACK1IF                :1;
        unsigned BCL1IF                 :1;
        unsigned BTO1IF                 :1;
    };
} I2C1ERRbits_t;
extern volatile I2C1ERRbits_t I2C1ERRbits __at(0x3D76);
// bitfield macros

// Register: I2C1STAT0
#define I2C1STAT0 I2C1STAT0
extern volatile unsigned char           I2C1STAT0           __at(0x3D77);
#ifndef _LIB_BUILD
asm("I2C1STAT0 equ 03D77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned D                      :1;
        unsigned R                      :1;
        unsigned MMA                    :1;
        unsigned SMA                    :1;
        unsigned BFRE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned DATA                   :1;
        unsigned READ                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_ADDRESS            :1;
        unsigned NOT_WRITE              :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_A                  :1;
        unsigned NOT_W                  :1;
    };
} I2C1STAT0bits_t;
extern volatile I2C1STAT0bits_t I2C1STAT0bits __at(0x3D77);
// bitfield macros

