LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: I2C1STAT1
#define I2C1STAT1 I2C1STAT1
extern volatile unsigned char           I2C1STAT1           __at(0x3D78);
#ifndef _LIB_BUILD
asm("I2C1STAT1 equ 03D78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned                        :1;
        unsigned CLRBF                  :1;
        unsigned RXRE                   :1;
        unsigned                        :1;
        unsigned TXBE                   :1;
        unsigned                        :1;
        unsigned TXWE                   :1;
    };
} I2C1STAT1bits_t;
extern volatile I2C1STAT1bits_t I2C1STAT1bits __at(0x3D78);
// bitfield macros

// Register: I2C1PIR
#define I2C1PIR I2C1PIR
extern volatile unsigned char           I2C1PIR             __at(0x3D79);
#ifndef _LIB_BUILD
asm("I2C1PIR equ 03D79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIF                   :1;
        unsigned RSCIF                  :1;
        unsigned PCIF                   :1;
        unsigned ADRIF                  :1;
        unsigned WRIF                   :1;
        unsigned                        :1;
        unsigned ACKTIF                 :1;
        unsigned CNTIF                  :1;
    };
    struct {
        unsigned SC1IF                  :1;
        unsigned RSC1IF                 :1;
        unsigned PC1IF                  :1;
        unsigned ADR1IF                 :1;
        unsigned WR1IF                  :1;
        unsigned                        :1;
        unsigned ACKT1IF                :1;
        unsigned CNT1IF                 :1;
    };
} I2C1PIRbits_t;
extern volatile I2C1PIRbits_t I2C1PIRbits __at(0x3D79);
// bitfield macros

// Register: I2C1PIE
#define I2C1PIE I2C1PIE
extern volatile unsigned char           I2C1PIE             __at(0x3D7A);
#ifndef _LIB_BUILD
asm("I2C1PIE equ 03D7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIE                   :1;
        unsigned RSCIE                  :1;
        unsigned PCIE                   :1;
        unsigned ADRIE                  :1;
        unsigned WRIE                   :1;
        unsigned                        :1;
        unsigned ACKTIE                 :1;
        unsigned CNTIE                  :1;
    };
    struct {
        unsigned SC1IE                  :1;
        unsigned RSC1IE                 :1;
        unsigned PC1IE                  :1;
        unsigned ADR1IE                 :1;
        unsigned WR1IE                  :1;
        unsigned                        :1;
        unsigned ACKT1IE                :1;
        unsigned CNT1IE                 :1;
    };
} I2C1PIEbits_t;
extern volatile I2C1PIEbits_t I2C1PIEbits __at(0x3D7A);
// bitfield macros

// Register: I2C1CLK
#define I2C1CLK I2C1CLK
extern volatile unsigned char           I2C1CLK             __at(0x3D7B);
#ifndef _LIB_BUILD
asm("I2C1CLK equ 03D7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned I2CCLK                 :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
    struct {
        unsigned I2CCLK0                :1;
        unsigned I2CCLK1                :1;
        unsigned I2CCLK2                :1;
        unsigned I2CCLK3                :1;
    };
} I2C1CLKbits_t;
extern volatile I2C1CLKbits_t I2C1CLKbits __at(0x3D7B);
// bitfield macros

// Register: I2C1BTO
#define I2C1BTO I2C1BTO
extern volatile unsigned char           I2C1BTO             __at(0x3D7C);
#ifndef _LIB_BUILD
asm("I2C1BTO equ 03D7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTO                    :8;
    };
    struct {
        unsigned I2CBTO                 :8;
    };
    struct {
        unsigned BTO0                   :1;
        unsigned BTO1                   :1;
        unsigned BTO2                   :1;
    };
    struct {
        unsigned I2CBTO0                :1;
        unsigned I2CBTO1                :1;
        unsigned I2CBTO2                :1;
    };
} I2C1BTObits_t;
extern volatile I2C1BTObits_t I2C1BTObits __at(0x3D7C);
// bitfield macros

// Register: U2RXB
#define U2RXB U2RXB
extern volatile unsigned char           U2RXB               __at(0x3DD0);
#ifndef _LIB_BUILD
asm("U2RXB equ 03DD0h");
#endif
// aliases
extern volatile unsigned char           U2RXBL              __at(0x3DD0);
#ifndef _LIB_BUILD
asm("U2RXBL equ 03DD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U2RXBbits_t;
extern volatile U2RXBbits_t U2RXBbits __at(0x3DD0);
// bitfield macros
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U2RXBLbits_t;
extern volatile U2RXBLbits_t U2RXBLbits __at(0x3DD0);
// bitfield macros

// Register: U2TXB
#define U2TXB U2TXB
extern volatile unsigned char           U2TXB               __at(0x3DD2);
#ifndef _LIB_BUILD
asm("U2TXB equ 03DD2h");
#endif
// aliases
extern volatile unsigned char           U2TXBL              __at(0x3DD2);
#ifndef _LIB_BUILD
asm("U2TXBL equ 03DD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U2TXBbits_t;
extern volatile U2TXBbits_t U2TXBbits __at(0x3DD2);
// bitfield macros
// alias bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U2TXBLbits_t;
extern volatile U2TXBLbits_t U2TXBLbits __at(0x3DD2);
// bitfield macros

// Register: U2P1
#define U2P1 U2P1
extern volatile unsigned char           U2P1                __at(0x3DD4);
#ifndef _LIB_BUILD
asm("U2P1 equ 03DD4h");
#endif

// Register: U2P1L
#define U2P1L U2P1L
extern volatile unsigned char           U2P1L               __at(0x3DD4);
#ifndef _LIB_BUILD
asm("U2P1L equ 03DD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
} U2P1Lbits_t;
