LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile U2P1Lbits_t U2P1Lbits __at(0x3DD4);
// bitfield macros

// Register: U2P2
#define U2P2 U2P2
extern volatile unsigned char           U2P2                __at(0x3DD6);
#ifndef _LIB_BUILD
asm("U2P2 equ 03DD6h");
#endif

// Register: U2P2L
#define U2P2L U2P2L
extern volatile unsigned char           U2P2L               __at(0x3DD6);
#ifndef _LIB_BUILD
asm("U2P2L equ 03DD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
} U2P2Lbits_t;
extern volatile U2P2Lbits_t U2P2Lbits __at(0x3DD6);
// bitfield macros

// Register: U2P3
#define U2P3 U2P3
extern volatile unsigned char           U2P3                __at(0x3DD8);
#ifndef _LIB_BUILD
asm("U2P3 equ 03DD8h");
#endif

// Register: U2P3L
#define U2P3L U2P3L
extern volatile unsigned char           U2P3L               __at(0x3DD8);
#ifndef _LIB_BUILD
asm("U2P3L equ 03DD8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3L                    :8;
    };
} U2P3Lbits_t;
extern volatile U2P3Lbits_t U2P3Lbits __at(0x3DD8);
// bitfield macros

// Register: U2CON0
#define U2CON0 U2CON0
extern volatile unsigned char           U2CON0              __at(0x3DDA);
#ifndef _LIB_BUILD
asm("U2CON0 equ 03DDAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned U2MODE                 :4;
        unsigned U2RXEN                 :1;
        unsigned U2TXEN                 :1;
        unsigned U2ABDEN                :1;
        unsigned U2BRGS                 :1;
    };
    struct {
        unsigned U2MODE0                :1;
        unsigned U2MODE1                :1;
        unsigned U2MODE2                :1;
    };
    struct {
        unsigned MODE                   :4;
        unsigned RXEN                   :1;
        unsigned TXEN                   :1;
        unsigned ABDEN                  :1;
        unsigned BRGS                   :1;
    };
} U2CON0bits_t;
extern volatile U2CON0bits_t U2CON0bits __at(0x3DDA);
// bitfield macros

// Register: U2CON1
#define U2CON1 U2CON1
extern volatile unsigned char           U2CON1              __at(0x3DDB);
#ifndef _LIB_BUILD
asm("U2CON1 equ 03DDBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SENDB                  :1;
        unsigned BRKOVR                 :1;
        unsigned                        :1;
        unsigned RXBIMD                 :1;
        unsigned WUE                    :1;
        unsigned                        :2;
        unsigned ON                     :1;
    };
    struct {
        unsigned U2SENDB                :1;
        unsigned U2BRKOVR               :1;
        unsigned                        :1;
        unsigned U2RXBIMD               :1;
        unsigned U2WUE                  :1;
        unsigned                        :2;
        unsigned U2ON                   :1;
    };
} U2CON1bits_t;
extern volatile U2CON1bits_t U2CON1bits __at(0x3DDB);
// bitfield macros

// Register: U2CON2
#define U2CON2 U2CON2
extern volatile unsigned char           U2CON2              __at(0x3DDC);
#ifndef _LIB_BUILD
asm("U2CON2 equ 03DDCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLO                    :2;
        unsigned TXPOL                  :1;
        unsigned                        :1;
        unsigned STP                    :2;
        unsigned RXPOL                  :1;
        unsigned RUNOVF                 :1;
    };
    struct {
        unsigned FLO0                   :1;
        unsigned FLO1                   :1;
        unsigned                        :2;
        unsigned STP0                   :1;
        unsigned STP1                   :1;
    };
    struct {
        unsigned U2FLO                  :2;
        unsigned U2TXPOL                :1;
        unsigned                        :1;
        unsigned U2STP                  :2;
        unsigned U2RXPOL                :1;
        unsigned U2RUNOVF               :1;
    };
    struct {
        unsigned U2FLO0                 :1;
        unsigned U2FLO1                 :1;
        unsigned                        :2;
        unsigned U2STP0                 :1;
        unsigned U2STP1                 :1;
    };
} U2CON2bits_t;
extern volatile U2CON2bits_t U2CON2bits __at(0x3DDC);
// bitfield macros

// Register: U2BRG
#define U2BRG U2BRG
extern volatile unsigned short          U2BRG               __at(0x3DDD);
#ifndef _LIB_BUILD
asm("U2BRG equ 03DDDh");
#endif

// Register: U2BRGL
#define U2BRGL U2BRGL
extern volatile unsigned char           U2BRGL              __at(0x3DDD);
#ifndef _LIB_BUILD
asm("U2BRGL equ 03DDDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGL                   :8;
    };
} U2BRGLbits_t;
extern volatile U2BRGLbits_t U2BRGLbits __at(0x3DDD);
// bitfield macros

// Register: U2BRGH
#define U2BRGH U2BRGH
extern volatile unsigned char           U2BRGH              __at(0x3DDE);
#ifndef _LIB_BUILD
asm("U2BRGH equ 03DDEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGH                   :8;
    };
} U2BRGHbits_t;
extern volatile U2BRGHbits_t U2BRGHbits __at(0x3DDE);
// bitfield macros

// Register: U2FIFO
#define U2FIFO U2FIFO
extern volatile unsigned char           U2FIFO              __at(0x3DDF);
#ifndef _LIB_BUILD
asm("U2FIFO equ 03DDFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U2RXBF                 :1;
        unsigned U2RXBE                 :1;
        unsigned U2XON                  :1;
        unsigned U2RXIDL                :1;
        unsigned U2TXBF                 :1;
        unsigned U2TXBE                 :1;
        unsigned U2STPMD                :1;
        unsigned U2TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U2RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U2FIFObits_t;
extern volatile U2FIFObits_t U2FIFObits __at(0x3DDF);
// bitfield macros

// Register: U2UIR
#define U2UIR U2UIR
extern volatile unsigned char           U2UIR               __at(0x3DE0);
#ifndef _LIB_BUILD
asm("U2UIR equ 03DE0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ABDIE                  :1;
        unsigned                        :3;
        unsigned ABDIF                  :1;
        unsigned WUIF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned U2ABDIE                :1;
        unsigned                        :3;
        unsigned U2ABDIF                :1;
        unsigned U2WUIF                 :1;
    };
} U2UIRbits_t;
