LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile U2UIRbits_t U2UIRbits __at(0x3DE0);
// bitfield macros

// Register: U2ERRIR
#define U2ERRIR U2ERRIR
extern volatile unsigned char           U2ERRIR             __at(0x3DE1);
#ifndef _LIB_BUILD
asm("U2ERRIR equ 03DE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIF                  :1;
        unsigned RXFOIF                 :1;
        unsigned RXBKIF                 :1;
        unsigned FERIF                  :1;
        unsigned CERIF                  :1;
        unsigned ABDOVF                 :1;
        unsigned PERIF                  :1;
        unsigned TXMTIF                 :1;
    };
    struct {
        unsigned U2TXCIF                :1;
        unsigned U2RXFOIF               :1;
        unsigned U2RXBKIF               :1;
        unsigned U2FERIF                :1;
        unsigned U2CERIF                :1;
        unsigned U2ABDOVF               :1;
        unsigned U2PERIF                :1;
        unsigned U2TXMTIF               :1;
    };
} U2ERRIRbits_t;
extern volatile U2ERRIRbits_t U2ERRIRbits __at(0x3DE1);
// bitfield macros

// Register: U2ERRIE
#define U2ERRIE U2ERRIE
extern volatile unsigned char           U2ERRIE             __at(0x3DE2);
#ifndef _LIB_BUILD
asm("U2ERRIE equ 03DE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIE                  :1;
        unsigned RXFOIE                 :1;
        unsigned RXBKIE                 :1;
        unsigned FERIE                  :1;
        unsigned CERIE                  :1;
        unsigned ABDOVE                 :1;
        unsigned PERIE                  :1;
        unsigned TXMTIE                 :1;
    };
    struct {
        unsigned U2TXCIE                :1;
        unsigned U2RXFOIE               :1;
        unsigned U2RXBKIE               :1;
        unsigned U2FERIE                :1;
        unsigned U2CERIE                :1;
        unsigned U2ABDOVE               :1;
        unsigned U2PERIE                :1;
        unsigned U2TXMTIE               :1;
    };
} U2ERRIEbits_t;
extern volatile U2ERRIEbits_t U2ERRIEbits __at(0x3DE2);
// bitfield macros

// Register: U1RXB
#define U1RXB U1RXB
extern volatile unsigned char           U1RXB               __at(0x3DE8);
#ifndef _LIB_BUILD
asm("U1RXB equ 03DE8h");
#endif
// aliases
extern volatile unsigned char           U1RXBL              __at(0x3DE8);
#ifndef _LIB_BUILD
asm("U1RXBL equ 03DE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBbits_t;
extern volatile U1RXBbits_t U1RXBbits __at(0x3DE8);
// bitfield macros
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBLbits_t;
extern volatile U1RXBLbits_t U1RXBLbits __at(0x3DE8);
// bitfield macros

// Register: U1RXCHK
#define U1RXCHK U1RXCHK
extern volatile unsigned char           U1RXCHK             __at(0x3DE9);
#ifndef _LIB_BUILD
asm("U1RXCHK equ 03DE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXCHK                  :8;
    };
} U1RXCHKbits_t;
extern volatile U1RXCHKbits_t U1RXCHKbits __at(0x3DE9);
// bitfield macros

// Register: U1TXB
#define U1TXB U1TXB
extern volatile unsigned char           U1TXB               __at(0x3DEA);
#ifndef _LIB_BUILD
asm("U1TXB equ 03DEAh");
#endif
// aliases
extern volatile unsigned char           U1TXBL              __at(0x3DEA);
#ifndef _LIB_BUILD
asm("U1TXBL equ 03DEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U1TXBbits_t;
extern volatile U1TXBbits_t U1TXBbits __at(0x3DEA);
// bitfield macros
// alias bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U1TXBLbits_t;
extern volatile U1TXBLbits_t U1TXBLbits __at(0x3DEA);
// bitfield macros

// Register: U1TXCHK
#define U1TXCHK U1TXCHK
extern volatile unsigned char           U1TXCHK             __at(0x3DEB);
#ifndef _LIB_BUILD
asm("U1TXCHK equ 03DEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCHK                  :8;
    };
} U1TXCHKbits_t;
extern volatile U1TXCHKbits_t U1TXCHKbits __at(0x3DEB);
// bitfield macros

// Register: U1P1
#define U1P1 U1P1
extern volatile unsigned short          U1P1                __at(0x3DEC);
#ifndef _LIB_BUILD
asm("U1P1 equ 03DECh");
#endif

// Register: U1P1L
#define U1P1L U1P1L
extern volatile unsigned char           U1P1L               __at(0x3DEC);
#ifndef _LIB_BUILD
asm("U1P1L equ 03DECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
} U1P1Lbits_t;
extern volatile U1P1Lbits_t U1P1Lbits __at(0x3DEC);
// bitfield macros

// Register: U1P1H
#define U1P1H U1P1H
extern volatile unsigned char           U1P1H               __at(0x3DED);
#ifndef _LIB_BUILD
asm("U1P1H equ 03DEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1H                    :1;
    };
} U1P1Hbits_t;
extern volatile U1P1Hbits_t U1P1Hbits __at(0x3DED);
// bitfield macros

// Register: U1P2
#define U1P2 U1P2
extern volatile unsigned short          U1P2                __at(0x3DEE);
#ifndef _LIB_BUILD
asm("U1P2 equ 03DEEh");
#endif

// Register: U1P2L
#define U1P2L U1P2L
extern volatile unsigned char           U1P2L               __at(0x3DEE);
#ifndef _LIB_BUILD
asm("U1P2L equ 03DEEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
} U1P2Lbits_t;
extern volatile U1P2Lbits_t U1P2Lbits __at(0x3DEE);
// bitfield macros

// Register: U1P2H
#define U1P2H U1P2H
extern volatile unsigned char           U1P2H               __at(0x3DEF);
#ifndef _LIB_BUILD
asm("U1P2H equ 03DEFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2H                    :1;
    };
} U1P2Hbits_t;
extern volatile U1P2Hbits_t U1P2Hbits __at(0x3DEF);
// bitfield macros

// Register: U1P3
#define U1P3 U1P3
extern volatile unsigned short          U1P3                __at(0x3DF0);
#ifndef _LIB_BUILD
asm("U1P3 equ 03DF0h");
#endif

// Register: U1P3L
#define U1P3L U1P3L
extern volatile unsigned char           U1P3L               __at(0x3DF0);
#ifndef _LIB_BUILD
asm("U1P3L equ 03DF0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3L                    :8;
    };
} U1P3Lbits_t;
