LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile U1P3Lbits_t U1P3Lbits __at(0x3DF0);
// bitfield macros

// Register: U1P3H
#define U1P3H U1P3H
extern volatile unsigned char           U1P3H               __at(0x3DF1);
#ifndef _LIB_BUILD
asm("U1P3H equ 03DF1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3H                    :1;
    };
} U1P3Hbits_t;
extern volatile U1P3Hbits_t U1P3Hbits __at(0x3DF1);
// bitfield macros

// Register: U1CON0
#define U1CON0 U1CON0
extern volatile unsigned char           U1CON0              __at(0x3DF2);
#ifndef _LIB_BUILD
asm("U1CON0 equ 03DF2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned U1MODE                 :4;
        unsigned U1RXEN                 :1;
        unsigned U1TXEN                 :1;
        unsigned U1ABDEN                :1;
        unsigned U1BRGS                 :1;
    };
    struct {
        unsigned U1MODE0                :1;
        unsigned U1MODE1                :1;
        unsigned U1MODE2                :1;
    };
    struct {
        unsigned MODE                   :4;
        unsigned RXEN                   :1;
        unsigned TXEN                   :1;
        unsigned ABDEN                  :1;
        unsigned BRGS                   :1;
    };
} U1CON0bits_t;
extern volatile U1CON0bits_t U1CON0bits __at(0x3DF2);
// bitfield macros

// Register: U1CON1
#define U1CON1 U1CON1
extern volatile unsigned char           U1CON1              __at(0x3DF3);
#ifndef _LIB_BUILD
asm("U1CON1 equ 03DF3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SENDB                  :1;
        unsigned BRKOVR                 :1;
        unsigned                        :1;
        unsigned RXBIMD                 :1;
        unsigned WUE                    :1;
        unsigned                        :2;
        unsigned ON                     :1;
    };
    struct {
        unsigned U1SENDB                :1;
        unsigned U1BRKOVR               :1;
        unsigned                        :1;
        unsigned U1RXBIMD               :1;
        unsigned U1WUE                  :1;
        unsigned                        :2;
        unsigned U1ON                   :1;
    };
} U1CON1bits_t;
extern volatile U1CON1bits_t U1CON1bits __at(0x3DF3);
// bitfield macros

// Register: U1CON2
#define U1CON2 U1CON2
extern volatile unsigned char           U1CON2              __at(0x3DF4);
#ifndef _LIB_BUILD
asm("U1CON2 equ 03DF4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLO                    :2;
        unsigned TXPOL                  :1;
        unsigned C0EN                   :1;
        unsigned STP                    :2;
        unsigned RXPOL                  :1;
        unsigned RUNOVF                 :1;
    };
    struct {
        unsigned FLO0                   :1;
        unsigned FLO1                   :1;
        unsigned                        :2;
        unsigned STP0                   :1;
        unsigned STP1                   :1;
    };
    struct {
        unsigned U1FLO                  :2;
        unsigned U1TXPOL                :1;
        unsigned U1C0EN                 :1;
        unsigned U1STP                  :2;
        unsigned U1RXPOL                :1;
        unsigned U1RUNOVF               :1;
    };
    struct {
        unsigned U1FLO0                 :1;
        unsigned U1FLO1                 :1;
        unsigned                        :2;
        unsigned U1STP0                 :1;
        unsigned U1STP1                 :1;
    };
} U1CON2bits_t;
extern volatile U1CON2bits_t U1CON2bits __at(0x3DF4);
// bitfield macros

// Register: U1BRG
#define U1BRG U1BRG
extern volatile unsigned short          U1BRG               __at(0x3DF5);
#ifndef _LIB_BUILD
asm("U1BRG equ 03DF5h");
#endif

// Register: U1BRGL
#define U1BRGL U1BRGL
extern volatile unsigned char           U1BRGL              __at(0x3DF5);
#ifndef _LIB_BUILD
asm("U1BRGL equ 03DF5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGL                   :8;
    };
} U1BRGLbits_t;
extern volatile U1BRGLbits_t U1BRGLbits __at(0x3DF5);
// bitfield macros

// Register: U1BRGH
#define U1BRGH U1BRGH
extern volatile unsigned char           U1BRGH              __at(0x3DF6);
#ifndef _LIB_BUILD
asm("U1BRGH equ 03DF6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGH                   :8;
    };
} U1BRGHbits_t;
extern volatile U1BRGHbits_t U1BRGHbits __at(0x3DF6);
// bitfield macros

// Register: U1FIFO
#define U1FIFO U1FIFO
extern volatile unsigned char           U1FIFO              __at(0x3DF7);
#ifndef _LIB_BUILD
asm("U1FIFO equ 03DF7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U1RXBF                 :1;
        unsigned U1RXBE                 :1;
        unsigned U1XON                  :1;
        unsigned U1RXIDL                :1;
        unsigned U1TXBF                 :1;
        unsigned U1TXBE                 :1;
        unsigned U1STPMD                :1;
        unsigned U1TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U1RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U1FIFObits_t;
extern volatile U1FIFObits_t U1FIFObits __at(0x3DF7);
// bitfield macros

// Register: U1UIR
#define U1UIR U1UIR
extern volatile unsigned char           U1UIR               __at(0x3DF8);
#ifndef _LIB_BUILD
asm("U1UIR equ 03DF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ABDIE                  :1;
        unsigned                        :3;
        unsigned ABDIF                  :1;
        unsigned WUIF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned U1ABDIE                :1;
        unsigned                        :3;
        unsigned U1ABDIF                :1;
        unsigned U1WUIF                 :1;
    };
} U1UIRbits_t;
