LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile U1UIRbits_t U1UIRbits __at(0x3DF8);
// bitfield macros

// Register: U1ERRIR
#define U1ERRIR U1ERRIR
extern volatile unsigned char           U1ERRIR             __at(0x3DF9);
#ifndef _LIB_BUILD
asm("U1ERRIR equ 03DF9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIF                  :1;
        unsigned RXFOIF                 :1;
        unsigned RXBKIF                 :1;
        unsigned FERIF                  :1;
        unsigned CERIF                  :1;
        unsigned ABDOVF                 :1;
        unsigned PERIF                  :1;
        unsigned TXMTIF                 :1;
    };
    struct {
        unsigned U1TXCIF                :1;
        unsigned U1RXFOIF               :1;
        unsigned U1RXBKIF               :1;
        unsigned U1FERIF                :1;
        unsigned U1CERIF                :1;
        unsigned U1ABDOVF               :1;
        unsigned U1PERIF                :1;
        unsigned U1TXMTIF               :1;
    };
} U1ERRIRbits_t;
extern volatile U1ERRIRbits_t U1ERRIRbits __at(0x3DF9);
// bitfield macros

// Register: U1ERRIE
#define U1ERRIE U1ERRIE
extern volatile unsigned char           U1ERRIE             __at(0x3DFA);
#ifndef _LIB_BUILD
asm("U1ERRIE equ 03DFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIE                  :1;
        unsigned RXFOIE                 :1;
        unsigned RXBKIE                 :1;
        unsigned FERIE                  :1;
        unsigned CERIE                  :1;
        unsigned ABDOVE                 :1;
        unsigned PERIE                  :1;
        unsigned TXMTIE                 :1;
    };
    struct {
        unsigned U1TXCIE                :1;
        unsigned U1RXFOIE               :1;
        unsigned U1RXBKIE               :1;
        unsigned U1FERIE                :1;
        unsigned U1CERIE                :1;
        unsigned U1ABDOVE               :1;
        unsigned U1PERIE                :1;
        unsigned U1TXMTIE               :1;
    };
} U1ERRIEbits_t;
extern volatile U1ERRIEbits_t U1ERRIEbits __at(0x3DFA);
// bitfield macros

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
extern volatile unsigned char           DAC1CON1            __at(0x3E9C);
#ifndef _LIB_BUILD
asm("DAC1CON1 equ 03E9Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATA                   :5;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
    };
    struct {
        unsigned DAC1R                  :5;
    };
} DAC1CON1bits_t;
extern volatile DAC1CON1bits_t DAC1CON1bits __at(0x3E9C);
// bitfield macros

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
extern volatile unsigned char           DAC1CON0            __at(0x3E9E);
#ifndef _LIB_BUILD
asm("DAC1CON0 equ 03E9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :1;
        unsigned                        :1;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned DAC1NSS                :1;
        unsigned                        :1;
        unsigned DAC1PSS0               :1;
        unsigned DAC1PSS1               :1;
        unsigned DAC1OE2                :1;
        unsigned DAC1OE1                :1;
        unsigned                        :1;
        unsigned DAC1EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
} DAC1CON0bits_t;
extern volatile DAC1CON0bits_t DAC1CON0bits __at(0x3E9E);
// bitfield macros

// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0x3EB8);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 03EB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :2;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned C2SYNC                 :1;
        unsigned C2HYS                  :1;
        unsigned                        :2;
        unsigned C2POL                  :1;
        unsigned                        :1;
        unsigned C2OUT                  :1;
        unsigned C2EN                   :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0x3EB8);
// bitfield macros

// Register: CM2CON1
#define CM2CON1 CM2CON1
extern volatile unsigned char           CM2CON1             __at(0x3EB9);
#ifndef _LIB_BUILD
asm("CM2CON1 equ 03EB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C2INTN                 :1;
        unsigned C2INTP                 :1;
    };
} CM2CON1bits_t;
extern volatile CM2CON1bits_t CM2CON1bits __at(0x3EB9);
// bitfield macros

// Register: CM2NCH
#define CM2NCH CM2NCH
extern volatile unsigned char           CM2NCH              __at(0x3EBA);
#ifndef _LIB_BUILD
asm("CM2NCH equ 03EBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :3;
    };
    struct {
        unsigned NCH0                   :1;
        unsigned NCH1                   :1;
        unsigned NCH2                   :1;
    };
    struct {
        unsigned C2NCH0                 :1;
        unsigned C2NCH1                 :1;
        unsigned C2NCH2                 :1;
    };
} CM2NCHbits_t;
extern volatile CM2NCHbits_t CM2NCHbits __at(0x3EBA);
// bitfield macros

