LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile ADREFbits_t ADREFbits __at(0x3EFD);
// bitfield macros

// Register: ADACT
#define ADACT ADACT
extern volatile unsigned char           ADACT               __at(0x3EFE);
#ifndef _LIB_BUILD
asm("ADACT equ 03EFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACT                    :5;
    };
    struct {
        unsigned ADACT0                 :1;
        unsigned ADACT1                 :1;
        unsigned ADACT2                 :1;
        unsigned ADACT3                 :1;
        unsigned ADACT4                 :1;
    };
    struct {
        unsigned ADACT                  :5;
    };
    struct {
        unsigned ACT0                   :1;
        unsigned ACT1                   :1;
        unsigned ACT2                   :1;
        unsigned ACT3                   :1;
        unsigned ACT4                   :1;
    };
} ADACTbits_t;
extern volatile ADACTbits_t ADACTbits __at(0x3EFE);
// bitfield macros

// Register: ADCLK
#define ADCLK ADCLK
extern volatile unsigned char           ADCLK               __at(0x3EFF);
#ifndef _LIB_BUILD
asm("ADCLK equ 03EFFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :6;
    };
    struct {
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ADCS3                  :1;
        unsigned ADCS4                  :1;
        unsigned ADCS5                  :1;
    };
    struct {
        unsigned ADCS                   :6;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
        unsigned CS5                    :1;
    };
} ADCLKbits_t;
extern volatile ADCLKbits_t ADCLKbits __at(0x3EFF);
// bitfield macros

// Register: SMT1TMR
#define SMT1TMR SMT1TMR
#ifndef __CCI__
extern volatile __uint24                SMT1TMR             __at(0x3F12);
#endif
#ifndef _LIB_BUILD
asm("SMT1TMR equ 03F12h");
#endif

// Register: SMT1TMRL
#define SMT1TMRL SMT1TMRL
extern volatile unsigned char           SMT1TMRL            __at(0x3F12);
#ifndef _LIB_BUILD
asm("SMT1TMRL equ 03F12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR0                   :1;
        unsigned TMR1                   :1;
        unsigned TMR2                   :1;
        unsigned TMR3                   :1;
        unsigned TMR4                   :1;
        unsigned TMR5                   :1;
        unsigned TMR6                   :1;
        unsigned TMR7                   :1;
    };
    struct {
        unsigned SMT1TMR                :8;
    };
    struct {
        unsigned SMT1TMR0               :1;
        unsigned SMT1TMR1               :1;
        unsigned SMT1TMR2               :1;
        unsigned SMT1TMR3               :1;
        unsigned SMT1TMR4               :1;
        unsigned SMT1TMR5               :1;
        unsigned SMT1TMR6               :1;
        unsigned SMT1TMR7               :1;
    };
} SMT1TMRLbits_t;
extern volatile SMT1TMRLbits_t SMT1TMRLbits __at(0x3F12);
// bitfield macros

// Register: SMT1TMRH
#define SMT1TMRH SMT1TMRH
extern volatile unsigned char           SMT1TMRH            __at(0x3F13);
#ifndef _LIB_BUILD
asm("SMT1TMRH equ 03F13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR8                   :1;
        unsigned TMR9                   :1;
        unsigned TMR10                  :1;
        unsigned TMR11                  :1;
        unsigned TMR12                  :1;
        unsigned TMR13                  :1;
        unsigned TMR14                  :1;
        unsigned TMR15                  :1;
    };
    struct {
        unsigned SMT1TMR                :8;
    };
    struct {
        unsigned SMT1TMR8               :1;
        unsigned SMT1TMR9               :1;
        unsigned SMT1TMR10              :1;
        unsigned SMT1TMR11              :1;
        unsigned SMT1TMR12              :1;
        unsigned SMT1TMR13              :1;
        unsigned SMT1TMR14              :1;
        unsigned SMT1TMR15              :1;
    };
} SMT1TMRHbits_t;
extern volatile SMT1TMRHbits_t SMT1TMRHbits __at(0x3F13);
// bitfield macros

// Register: SMT1TMRU
#define SMT1TMRU SMT1TMRU
extern volatile unsigned char           SMT1TMRU            __at(0x3F14);
#ifndef _LIB_BUILD
asm("SMT1TMRU equ 03F14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR16                  :1;
        unsigned TMR17                  :1;
        unsigned TMR18                  :1;
        unsigned TMR19                  :1;
        unsigned TMR20                  :1;
        unsigned TMR21                  :1;
        unsigned TMR22                  :1;
        unsigned TMR23                  :1;
    };
    struct {
        unsigned SMT1TMR                :8;
    };
    struct {
        unsigned SMT1TMR16              :1;
        unsigned SMT1TMR17              :1;
        unsigned SMT1TMR18              :1;
        unsigned SMT1TMR19              :1;
        unsigned SMT1TMR20              :1;
        unsigned SMT1TMR21              :1;
        unsigned SMT1TMR22              :1;
        unsigned SMT1TMR23              :1;
    };
} SMT1TMRUbits_t;
extern volatile SMT1TMRUbits_t SMT1TMRUbits __at(0x3F14);
// bitfield macros

// Register: SMT1CPR
#define SMT1CPR SMT1CPR
#ifndef __CCI__
extern volatile __uint24                SMT1CPR             __at(0x3F15);
#endif
#ifndef _LIB_BUILD
asm("SMT1CPR equ 03F15h");
#endif

// Register: SMT1CPRL
#define SMT1CPRL SMT1CPRL
extern volatile unsigned char           SMT1CPRL            __at(0x3F15);
#ifndef _LIB_BUILD
asm("SMT1CPRL equ 03F15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPR                    :8;
    };
    struct {
        unsigned CPR0                   :1;
        unsigned CPR1                   :1;
        unsigned CPR2                   :1;
        unsigned CPR3                   :1;
        unsigned CPR4                   :1;
        unsigned CPR5                   :1;
        unsigned CPR6                   :1;
        unsigned CPR7                   :1;
    };
    struct {
        unsigned SMT1CPR                :8;
    };
    struct {
        unsigned SMT1CPR0               :1;
        unsigned SMT1CPR1               :1;
        unsigned SMT1CPR2               :1;
        unsigned SMT1CPR3               :1;
        unsigned SMT1CPR4               :1;
        unsigned SMT1CPR5               :1;
        unsigned SMT1CPR6               :1;
        unsigned SMT1CPR7               :1;
    };
} SMT1CPRLbits_t;
extern volatile SMT1CPRLbits_t SMT1CPRLbits __at(0x3F15);
// bitfield macros

