LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: SMT1CPRH
#define SMT1CPRH SMT1CPRH
extern volatile unsigned char           SMT1CPRH            __at(0x3F16);
#ifndef _LIB_BUILD
asm("SMT1CPRH equ 03F16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPR                    :8;
    };
    struct {
        unsigned CPR8                   :1;
        unsigned CPR9                   :1;
        unsigned CPR10                  :1;
        unsigned CPR11                  :1;
        unsigned CPR12                  :1;
        unsigned CPR13                  :1;
        unsigned CPR14                  :1;
        unsigned CPR15                  :1;
    };
    struct {
        unsigned SMT1CPR8               :1;
        unsigned SMT1CPR9               :1;
        unsigned SMT1CPR10              :1;
        unsigned SMT1CPR11              :1;
        unsigned SMT1CPR12              :1;
        unsigned SMT1CPR13              :1;
        unsigned SMT1CPR14              :1;
        unsigned SMT1CPR15              :1;
    };
    struct {
        unsigned SMT1CPR                :8;
    };
} SMT1CPRHbits_t;
extern volatile SMT1CPRHbits_t SMT1CPRHbits __at(0x3F16);
// bitfield macros

// Register: SMT1CPRU
#define SMT1CPRU SMT1CPRU
extern volatile unsigned char           SMT1CPRU            __at(0x3F17);
#ifndef _LIB_BUILD
asm("SMT1CPRU equ 03F17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPR                    :8;
    };
    struct {
        unsigned CPR16                  :1;
        unsigned CPR17                  :1;
        unsigned CPR18                  :1;
        unsigned CPR19                  :1;
        unsigned CPR20                  :1;
        unsigned CPR21                  :1;
        unsigned CPR22                  :1;
        unsigned CPR23                  :1;
    };
    struct {
        unsigned SMT1CPR16              :1;
        unsigned SMT1CPR17              :1;
        unsigned SMT1CPR18              :1;
        unsigned SMT1CPR19              :1;
        unsigned SMT1CPR20              :1;
        unsigned SMT1CPR21              :1;
        unsigned SMT1CPR22              :1;
        unsigned SMT1CPR23              :1;
    };
    struct {
        unsigned SMT1CPR                :8;
    };
} SMT1CPRUbits_t;
extern volatile SMT1CPRUbits_t SMT1CPRUbits __at(0x3F17);
// bitfield macros

// Register: SMT1CPW
#define SMT1CPW SMT1CPW
#ifndef __CCI__
extern volatile __uint24                SMT1CPW             __at(0x3F18);
#endif
#ifndef _LIB_BUILD
asm("SMT1CPW equ 03F18h");
#endif

// Register: SMT1CPWL
#define SMT1CPWL SMT1CPWL
extern volatile unsigned char           SMT1CPWL            __at(0x3F18);
#ifndef _LIB_BUILD
asm("SMT1CPWL equ 03F18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPW                    :8;
    };
    struct {
        unsigned CPW0                   :1;
        unsigned CPW1                   :1;
        unsigned CPW2                   :1;
        unsigned CPW3                   :1;
        unsigned CPW4                   :1;
        unsigned CPW5                   :1;
        unsigned CPW6                   :1;
        unsigned CPW7                   :1;
    };
    struct {
        unsigned SMT1CPW                :8;
    };
    struct {
        unsigned SMT1CPW0               :1;
        unsigned SMT1CPW1               :1;
        unsigned SMT1CPW2               :1;
        unsigned SMT1CPW3               :1;
        unsigned SMT1CPW4               :1;
        unsigned SMT1CPW5               :1;
        unsigned SMT1CPW6               :1;
        unsigned SMT1CPW7               :1;
    };
} SMT1CPWLbits_t;
extern volatile SMT1CPWLbits_t SMT1CPWLbits __at(0x3F18);
// bitfield macros

// Register: SMT1CPWH
#define SMT1CPWH SMT1CPWH
extern volatile unsigned char           SMT1CPWH            __at(0x3F19);
#ifndef _LIB_BUILD
asm("SMT1CPWH equ 03F19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPW                    :8;
    };
    struct {
        unsigned CPW8                   :1;
        unsigned CPW9                   :1;
        unsigned CPW10                  :1;
        unsigned CPW11                  :1;
        unsigned CPW12                  :1;
        unsigned CPW13                  :1;
        unsigned CPW14                  :1;
        unsigned CPW15                  :1;
    };
    struct {
        unsigned SMT1CPW                :8;
    };
    struct {
        unsigned SMT1CPW8               :1;
        unsigned SMT1CPW9               :1;
        unsigned SMT1CPW10              :1;
        unsigned SMT1CPW11              :1;
        unsigned SMT1CPW12              :1;
        unsigned SMT1CPW13              :1;
        unsigned SMT1CPW14              :1;
        unsigned SMT1CPW15              :1;
    };
} SMT1CPWHbits_t;
extern volatile SMT1CPWHbits_t SMT1CPWHbits __at(0x3F19);
// bitfield macros

// Register: SMT1CPWU
#define SMT1CPWU SMT1CPWU
extern volatile unsigned char           SMT1CPWU            __at(0x3F1A);
#ifndef _LIB_BUILD
asm("SMT1CPWU equ 03F1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPW                    :8;
    };
    struct {
        unsigned CPW16                  :1;
        unsigned CPW17                  :1;
        unsigned CPW18                  :1;
        unsigned CPW19                  :1;
        unsigned CPW20                  :1;
        unsigned CPW21                  :1;
        unsigned CPW22                  :1;
        unsigned CPW23                  :1;
    };
    struct {
        unsigned SMT1CPW                :8;
    };
    struct {
        unsigned SMT1CPW16              :1;
        unsigned SMT1CPW17              :1;
        unsigned SMT1CPW18              :1;
        unsigned SMT1CPW19              :1;
        unsigned SMT1CPW20              :1;
        unsigned SMT1CPW21              :1;
        unsigned SMT1CPW22              :1;
        unsigned SMT1CPW23              :1;
    };
} SMT1CPWUbits_t;
extern volatile SMT1CPWUbits_t SMT1CPWUbits __at(0x3F1A);
// bitfield macros

// Register: SMT1PR
#define SMT1PR SMT1PR
#ifndef __CCI__
extern volatile __uint24                SMT1PR              __at(0x3F1B);
#endif
#ifndef _LIB_BUILD
asm("SMT1PR equ 03F1Bh");
#endif

