LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: SMT1PRL
#define SMT1PRL SMT1PRL
extern volatile unsigned char           SMT1PRL             __at(0x3F1B);
#ifndef _LIB_BUILD
asm("SMT1PRL equ 03F1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
        unsigned PR3                    :1;
        unsigned PR4                    :1;
        unsigned PR5                    :1;
        unsigned PR6                    :1;
        unsigned PR7                    :1;
    };
    struct {
        unsigned SMT1PR                 :8;
    };
    struct {
        unsigned SMT1PR0                :1;
        unsigned SMT1PR1                :1;
        unsigned SMT1PR2                :1;
        unsigned SMT1PR3                :1;
        unsigned SMT1PR4                :1;
        unsigned SMT1PR5                :1;
        unsigned SMT1PR6                :1;
        unsigned SMT1PR7                :1;
    };
} SMT1PRLbits_t;
extern volatile SMT1PRLbits_t SMT1PRLbits __at(0x3F1B);
// bitfield macros

// Register: SMT1PRH
#define SMT1PRH SMT1PRH
extern volatile unsigned char           SMT1PRH             __at(0x3F1C);
#ifndef _LIB_BUILD
asm("SMT1PRH equ 03F1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PR8                    :1;
        unsigned PR9                    :1;
        unsigned PR10                   :1;
        unsigned PR11                   :1;
        unsigned PR12                   :1;
        unsigned PR13                   :1;
        unsigned PR14                   :1;
        unsigned PR15                   :1;
    };
    struct {
        unsigned SMT1PR                 :8;
    };
    struct {
        unsigned SMT1PR8                :1;
        unsigned SMT1PR9                :1;
        unsigned SMT1PR10               :1;
        unsigned SMT1PR11               :1;
        unsigned SMT1PR12               :1;
        unsigned SMT1PR13               :1;
        unsigned SMT1PR14               :1;
        unsigned SMT1PR15               :1;
    };
} SMT1PRHbits_t;
extern volatile SMT1PRHbits_t SMT1PRHbits __at(0x3F1C);
// bitfield macros

// Register: SMT1PRU
#define SMT1PRU SMT1PRU
extern volatile unsigned char           SMT1PRU             __at(0x3F1D);
#ifndef _LIB_BUILD
asm("SMT1PRU equ 03F1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PR16                   :1;
        unsigned PR17                   :1;
        unsigned PR18                   :1;
        unsigned PR19                   :1;
        unsigned PR20                   :1;
        unsigned PR21                   :1;
        unsigned PR22                   :1;
        unsigned PR23                   :1;
    };
    struct {
        unsigned SMT1PR                 :8;
    };
    struct {
        unsigned SMT1PR16               :1;
        unsigned SMT1PR17               :1;
        unsigned SMT1PR18               :1;
        unsigned SMT1PR19               :1;
        unsigned SMT1PR20               :1;
        unsigned SMT1PR21               :1;
        unsigned SMT1PR22               :1;
        unsigned SMT1PR23               :1;
    };
} SMT1PRUbits_t;
extern volatile SMT1PRUbits_t SMT1PRUbits __at(0x3F1D);
// bitfield macros

// Register: SMT1CON0
#define SMT1CON0 SMT1CON0
extern volatile unsigned char           SMT1CON0            __at(0x3F1E);
#ifndef _LIB_BUILD
asm("SMT1CON0 equ 03F1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PS                     :2;
        unsigned CPOL                   :1;
        unsigned SPOL                   :1;
        unsigned WPOL                   :1;
        unsigned STP                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned SMT1PS                 :2;
        unsigned SMT1CPOL               :1;
        unsigned SMT1SPOL               :1;
        unsigned SMT1WOL                :1;
        unsigned SMT1STP                :1;
        unsigned                        :1;
        unsigned SMT1EN                 :1;
    };
    struct {
        unsigned PS0                    :1;
        unsigned PS1                    :1;
    };
    struct {
        unsigned SMT1PS0                :1;
        unsigned SMT1PS1                :1;
    };
} SMT1CON0bits_t;
extern volatile SMT1CON0bits_t SMT1CON0bits __at(0x3F1E);
// bitfield macros

// Register: SMT1CON1
#define SMT1CON1 SMT1CON1
extern volatile unsigned char           SMT1CON1            __at(0x3F1F);
#ifndef _LIB_BUILD
asm("SMT1CON1 equ 03F1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned                        :2;
        unsigned REPEAT                 :1;
        unsigned GO                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
        unsigned                        :2;
        unsigned SMT1REPEAT             :1;
        unsigned SMT1GO                 :1;
    };
    struct {
        unsigned SMT1MODE               :4;
    };
} SMT1CON1bits_t;
extern volatile SMT1CON1bits_t SMT1CON1bits __at(0x3F1F);
// bitfield macros

// Register: SMT1STAT
#define SMT1STAT SMT1STAT
extern volatile unsigned char           SMT1STAT            __at(0x3F20);
#ifndef _LIB_BUILD
asm("SMT1STAT equ 03F20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS                     :1;
        unsigned WS                     :1;
        unsigned TS                     :1;
        unsigned                        :2;
        unsigned RST                    :1;
        unsigned CPWUP                  :1;
        unsigned CPRUP                  :1;
    };
    struct {
        unsigned SMT1AS                 :1;
        unsigned SMT1WS                 :1;
        unsigned SMT1TS                 :1;
        unsigned                        :2;
        unsigned SMT1RESET              :1;
        unsigned SMT1CPWUP              :1;
        unsigned SMT1CPRUP              :1;
    };
    struct {
        unsigned                        :5;
        unsigned SMT1RST                :1;
    };
} SMT1STATbits_t;
