LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: NCO1INCL
#define NCO1INCL NCO1INCL
extern volatile unsigned char           NCO1INCL            __at(0x3F3B);
#ifndef _LIB_BUILD
asm("NCO1INCL equ 03F3Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :8;
    };
    struct {
        unsigned NCO1INC0               :1;
        unsigned NCO1INC1               :1;
        unsigned NCO1INC2               :1;
        unsigned NCO1INC3               :1;
        unsigned NCO1INC4               :1;
        unsigned NCO1INC5               :1;
        unsigned NCO1INC6               :1;
        unsigned NCO1INC7               :1;
    };
    struct {
        unsigned INC0                   :1;
        unsigned INC1                   :1;
        unsigned INC2                   :1;
        unsigned INC3                   :1;
        unsigned INC4                   :1;
        unsigned INC5                   :1;
        unsigned INC6                   :1;
        unsigned INC7                   :1;
    };
    struct {
        unsigned NCO1INC                :8;
    };
} NCO1INCLbits_t;
extern volatile NCO1INCLbits_t NCO1INCLbits __at(0x3F3B);
// bitfield macros

// Register: NCO1INCH
#define NCO1INCH NCO1INCH
extern volatile unsigned char           NCO1INCH            __at(0x3F3C);
#ifndef _LIB_BUILD
asm("NCO1INCH equ 03F3Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :8;
    };
    struct {
        unsigned NCO1INC8               :1;
        unsigned NCO1INC9               :1;
        unsigned NCO1INC10              :1;
        unsigned NCO1INC11              :1;
        unsigned NCO1INC12              :1;
        unsigned NCO1INC13              :1;
        unsigned NCO1INC14              :1;
        unsigned NCO1INC15              :1;
    };
    struct {
        unsigned INC8                   :1;
        unsigned INC9                   :1;
        unsigned INC10                  :1;
        unsigned INC11                  :1;
        unsigned INC12                  :1;
        unsigned INC13                  :1;
        unsigned INC14                  :1;
        unsigned INC15                  :1;
    };
    struct {
        unsigned NCO1INC                :8;
    };
} NCO1INCHbits_t;
extern volatile NCO1INCHbits_t NCO1INCHbits __at(0x3F3C);
// bitfield macros

// Register: NCO1INCU
#define NCO1INCU NCO1INCU
extern volatile unsigned char           NCO1INCU            __at(0x3F3D);
#ifndef _LIB_BUILD
asm("NCO1INCU equ 03F3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :8;
    };
    struct {
        unsigned NCO1INC16              :1;
        unsigned NCO1INC17              :1;
        unsigned NCO1INC18              :1;
        unsigned NCO1INC19              :1;
        unsigned NCO1INC20              :1;
        unsigned NCO1INC21              :1;
        unsigned NCO1INC22              :1;
        unsigned NCO1INC23              :1;
    };
    struct {
        unsigned INC16                  :1;
        unsigned INC17                  :1;
        unsigned INC18                  :1;
        unsigned INC19                  :1;
        unsigned INC20                  :1;
        unsigned INC21                  :1;
        unsigned INC22                  :1;
        unsigned INC23                  :1;
    };
    struct {
        unsigned NCO1INC                :8;
    };
} NCO1INCUbits_t;
extern volatile NCO1INCUbits_t NCO1INCUbits __at(0x3F3D);
// bitfield macros

// Register: NCO1CON
#define NCO1CON NCO1CON
extern volatile unsigned char           NCO1CON             __at(0x3F3E);
#ifndef _LIB_BUILD
asm("NCO1CON equ 03F3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PFM                    :1;
        unsigned                        :3;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NCO1PFM                :1;
        unsigned                        :3;
        unsigned NCO1POL                :1;
        unsigned NCO1OUT                :1;
        unsigned                        :1;
        unsigned NCO1EN                 :1;
    };
} NCO1CONbits_t;
extern volatile NCO1CONbits_t NCO1CONbits __at(0x3F3E);
// bitfield macros

// Register: NCO1CLK
#define NCO1CLK NCO1CLK
extern volatile unsigned char           NCO1CLK             __at(0x3F3F);
#ifndef _LIB_BUILD
asm("NCO1CLK equ 03F3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CKS                    :4;
        unsigned                        :1;
        unsigned PWS                    :3;
    };
    struct {
        unsigned CKS0                   :1;
        unsigned CKS1                   :1;
        unsigned CKS2                   :1;
        unsigned CKS3                   :1;
        unsigned                        :1;
        unsigned PWS0                   :1;
        unsigned PWS1                   :1;
        unsigned PWS2                   :1;
    };
    struct {
        unsigned NCO1CKS                :4;
        unsigned                        :1;
        unsigned NCO1PWS                :3;
    };
    struct {
        unsigned NCO1CKS0               :1;
        unsigned NCO1CKS1               :1;
        unsigned NCO1CKS2               :1;
        unsigned NCO1CKS3               :1;
        unsigned                        :1;
        unsigned NCO1PWS0               :1;
        unsigned NCO1PWS1               :1;
        unsigned NCO1PWS2               :1;
    };
} NCO1CLKbits_t;
extern volatile NCO1CLKbits_t NCO1CLKbits __at(0x3F3F);
// bitfield macros

// Register: CWG3CLK
#define CWG3CLK CWG3CLK
extern volatile unsigned char           CWG3CLK             __at(0x3F40);
#ifndef _LIB_BUILD
asm("CWG3CLK equ 03F40h");
#endif
// aliases
extern volatile unsigned char           CWG3CLKCON          __at(0x3F40);
#ifndef _LIB_BUILD
asm("CWG3CLKCON equ 03F40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG3CS                 :1;
    };
} CWG3CLKbits_t;
extern volatile CWG3CLKbits_t CWG3CLKbits __at(0x3F40);
// bitfield macros
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG3CS                 :1;
    };
} CWG3CLKCONbits_t;
extern volatile CWG3CLKCONbits_t CWG3CLKCONbits __at(0x3F40);
// bitfield macros

// Register: CWG3ISM
#define CWG3ISM CWG3ISM
extern volatile unsigned char           CWG3ISM             __at(0x3F41);
#ifndef _LIB_BUILD
asm("CWG3ISM equ 03F41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IS                     :4;
    };
    struct {
        unsigned CWG3ISM0               :1;
        unsigned CWG3ISM1               :1;
        unsigned CWG3ISM2               :1;
        unsigned CWG3ISM3               :1;
    };
} CWG3ISMbits_t;
extern volatile CWG3ISMbits_t CWG3ISMbits __at(0x3F41);
// bitfield macros

