LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: CWG3DBR
#define CWG3DBR CWG3DBR
extern volatile unsigned char           CWG3DBR             __at(0x3F42);
#ifndef _LIB_BUILD
asm("CWG3DBR equ 03F42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :6;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned CWG3DBR                :6;
    };
    struct {
        unsigned CWG3DBR0               :1;
        unsigned CWG3DBR1               :1;
        unsigned CWG3DBR2               :1;
        unsigned CWG3DBR3               :1;
        unsigned CWG3DBR4               :1;
        unsigned CWG3DBR5               :1;
    };
} CWG3DBRbits_t;
extern volatile CWG3DBRbits_t CWG3DBRbits __at(0x3F42);
// bitfield macros

// Register: CWG3DBF
#define CWG3DBF CWG3DBF
extern volatile unsigned char           CWG3DBF             __at(0x3F43);
#ifndef _LIB_BUILD
asm("CWG3DBF equ 03F43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF                    :6;
    };
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned CWG3DBF                :6;
    };
    struct {
        unsigned CWG3DBF0               :1;
        unsigned CWG3DBF1               :1;
        unsigned CWG3DBF2               :1;
        unsigned CWG3DBF3               :1;
        unsigned CWG3DBF4               :1;
        unsigned CWG3DBF5               :1;
    };
} CWG3DBFbits_t;
extern volatile CWG3DBFbits_t CWG3DBFbits __at(0x3F43);
// bitfield macros

// Register: CWG3CON0
#define CWG3CON0 CWG3CON0
extern volatile unsigned char           CWG3CON0            __at(0x3F44);
#ifndef _LIB_BUILD
asm("CWG3CON0 equ 03F44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned                        :3;
        unsigned LD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned                        :4;
        unsigned G3EN                   :1;
    };
    struct {
        unsigned CWG3MODE               :3;
        unsigned                        :3;
        unsigned CWG3LD                 :1;
        unsigned CWG3EN                 :1;
    };
    struct {
        unsigned CWG3MODE0              :1;
        unsigned CWG3MODE1              :1;
        unsigned CWG3MODE2              :1;
    };
} CWG3CON0bits_t;
extern volatile CWG3CON0bits_t CWG3CON0bits __at(0x3F44);
// bitfield macros

// Register: CWG3CON1
#define CWG3CON1 CWG3CON1
extern volatile unsigned char           CWG3CON1            __at(0x3F45);
#ifndef _LIB_BUILD
asm("CWG3CON1 equ 03F45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POLA                   :1;
        unsigned POLB                   :1;
        unsigned POLC                   :1;
        unsigned POLD                   :1;
        unsigned                        :1;
        unsigned IN                     :1;
    };
    struct {
        unsigned CWG3POLA               :1;
        unsigned CWG3POLB               :1;
        unsigned CWG3POLC               :1;
        unsigned CWG3POLD               :1;
        unsigned                        :1;
        unsigned CWG3IN                 :1;
    };
} CWG3CON1bits_t;
extern volatile CWG3CON1bits_t CWG3CON1bits __at(0x3F45);
// bitfield macros

// Register: CWG3AS0
#define CWG3AS0 CWG3AS0
extern volatile unsigned char           CWG3AS0             __at(0x3F46);
#ifndef _LIB_BUILD
asm("CWG3AS0 equ 03F46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned LSAC                   :2;
        unsigned LSBD                   :2;
        unsigned REN                    :1;
        unsigned SHUTDOWN               :1;
    };
    struct {
        unsigned                        :2;
        unsigned LSAC0                  :1;
        unsigned LSAC1                  :1;
        unsigned LSBD0                  :1;
        unsigned LSBD1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG3LSAC               :2;
        unsigned CWG3LSBD               :2;
        unsigned CWG3REN                :1;
        unsigned CWG3SHUTDOWN           :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG3LSAC0              :1;
        unsigned CWG3LSAC1              :1;
        unsigned CWG3LSBD0              :1;
        unsigned CWG3LSBD1              :1;
    };
} CWG3AS0bits_t;
extern volatile CWG3AS0bits_t CWG3AS0bits __at(0x3F46);
// bitfield macros

// Register: CWG3AS1
#define CWG3AS1 CWG3AS1
extern volatile unsigned char           CWG3AS1             __at(0x3F47);
#ifndef _LIB_BUILD
asm("CWG3AS1 equ 03F47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
    };
} CWG3AS1bits_t;
extern volatile CWG3AS1bits_t CWG3AS1bits __at(0x3F47);
// bitfield macros

// Register: CWG3STR
#define CWG3STR CWG3STR
extern volatile unsigned char           CWG3STR             __at(0x3F48);
#ifndef _LIB_BUILD
asm("CWG3STR equ 03F48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned OVRA                   :1;
        unsigned OVRB                   :1;
        unsigned OVRC                   :1;
        unsigned OVRD                   :1;
    };
    struct {
        unsigned CWG3STRA               :1;
        unsigned CWG3STRB               :1;
        unsigned CWG3STRC               :1;
        unsigned CWG3STRD               :1;
        unsigned CWG3OVRA               :1;
        unsigned CWG3OVRB               :1;
        unsigned CWG3OVRC               :1;
        unsigned CWG3OVRD               :1;
    };
} CWG3STRbits_t;
extern volatile CWG3STRbits_t CWG3STRbits __at(0x3F48);
// bitfield macros

// Register: CWG2CLK
#define CWG2CLK CWG2CLK
extern volatile unsigned char           CWG2CLK             __at(0x3F49);
#ifndef _LIB_BUILD
asm("CWG2CLK equ 03F49h");
#endif
// aliases
extern volatile unsigned char           CWG2CLKCON          __at(0x3F49);
#ifndef _LIB_BUILD
asm("CWG2CLKCON equ 03F49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG2CS                 :1;
    };
} CWG2CLKbits_t;
extern volatile CWG2CLKbits_t CWG2CLKbits __at(0x3F49);
// bitfield macros
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG2CS                 :1;
    };
} CWG2CLKCONbits_t;
extern volatile CWG2CLKCONbits_t CWG2CLKCONbits __at(0x3F49);
// bitfield macros

// Register: CWG2ISM
#define CWG2ISM CWG2ISM
extern volatile unsigned char           CWG2ISM             __at(0x3F4A);
#ifndef _LIB_BUILD
asm("CWG2ISM equ 03F4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IS                     :4;
    };
    struct {
        unsigned CWG2ISM0               :1;
        unsigned CWG2ISM1               :1;
        unsigned CWG2ISM2               :1;
        unsigned CWG2ISM3               :1;
    };
} CWG2ISMbits_t;
extern volatile CWG2ISMbits_t CWG2ISMbits __at(0x3F4A);
// bitfield macros

// Register: CWG2DBR
#define CWG2DBR CWG2DBR
extern volatile unsigned char           CWG2DBR             __at(0x3F4B);
#ifndef _LIB_BUILD
asm("CWG2DBR equ 03F4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :6;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned CWG2DBR                :6;
    };
    struct {
        unsigned CWG2DBR0               :1;
        unsigned CWG2DBR1               :1;
        unsigned CWG2DBR2               :1;
        unsigned CWG2DBR3               :1;
        unsigned CWG2DBR4               :1;
        unsigned CWG2DBR5               :1;
    };
} CWG2DBRbits_t;
extern volatile CWG2DBRbits_t CWG2DBRbits __at(0x3F4B);
// bitfield macros

