LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: CWG2DBF
#define CWG2DBF CWG2DBF
extern volatile unsigned char           CWG2DBF             __at(0x3F4C);
#ifndef _LIB_BUILD
asm("CWG2DBF equ 03F4Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF                    :6;
    };
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned CWG2DBF                :6;
    };
    struct {
        unsigned CWG2DBF0               :1;
        unsigned CWG2DBF1               :1;
        unsigned CWG2DBF2               :1;
        unsigned CWG2DBF3               :1;
        unsigned CWG2DBF4               :1;
        unsigned CWG2DBF5               :1;
    };
} CWG2DBFbits_t;
extern volatile CWG2DBFbits_t CWG2DBFbits __at(0x3F4C);
// bitfield macros

// Register: CWG2CON0
#define CWG2CON0 CWG2CON0
extern volatile unsigned char           CWG2CON0            __at(0x3F4D);
#ifndef _LIB_BUILD
asm("CWG2CON0 equ 03F4Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned                        :3;
        unsigned LD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned                        :4;
        unsigned G2EN                   :1;
    };
    struct {
        unsigned CWG2MODE               :3;
        unsigned                        :3;
        unsigned CWG2LD                 :1;
        unsigned CWG2EN                 :1;
    };
    struct {
        unsigned CWG2MODE0              :1;
        unsigned CWG2MODE1              :1;
        unsigned CWG2MODE2              :1;
    };
} CWG2CON0bits_t;
extern volatile CWG2CON0bits_t CWG2CON0bits __at(0x3F4D);
// bitfield macros

// Register: CWG2CON1
#define CWG2CON1 CWG2CON1
extern volatile unsigned char           CWG2CON1            __at(0x3F4E);
#ifndef _LIB_BUILD
asm("CWG2CON1 equ 03F4Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POLA                   :1;
        unsigned POLB                   :1;
        unsigned POLC                   :1;
        unsigned POLD                   :1;
        unsigned                        :1;
        unsigned IN                     :1;
    };
    struct {
        unsigned CWG2POLA               :1;
        unsigned CWG2POLB               :1;
        unsigned CWG2POLC               :1;
        unsigned CWG2POLD               :1;
        unsigned                        :1;
        unsigned CWG2IN                 :1;
    };
} CWG2CON1bits_t;
extern volatile CWG2CON1bits_t CWG2CON1bits __at(0x3F4E);
// bitfield macros

// Register: CWG2AS0
#define CWG2AS0 CWG2AS0
extern volatile unsigned char           CWG2AS0             __at(0x3F4F);
#ifndef _LIB_BUILD
asm("CWG2AS0 equ 03F4Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned LSAC                   :2;
        unsigned LSBD                   :2;
        unsigned REN                    :1;
        unsigned SHUTDOWN               :1;
    };
    struct {
        unsigned                        :2;
        unsigned LSAC0                  :1;
        unsigned LSAC1                  :1;
        unsigned LSBD0                  :1;
        unsigned LSBD1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG2LSAC               :2;
        unsigned CWG2LSBD               :2;
        unsigned CWG2REN                :1;
        unsigned CWG2SHUTDOWN           :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG2LSAC0              :1;
        unsigned CWG2LSAC1              :1;
        unsigned CWG2LSBD0              :1;
        unsigned CWG2LSBD1              :1;
    };
} CWG2AS0bits_t;
extern volatile CWG2AS0bits_t CWG2AS0bits __at(0x3F4F);
// bitfield macros

// Register: CWG2AS1
#define CWG2AS1 CWG2AS1
extern volatile unsigned char           CWG2AS1             __at(0x3F50);
#ifndef _LIB_BUILD
asm("CWG2AS1 equ 03F50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
    };
} CWG2AS1bits_t;
extern volatile CWG2AS1bits_t CWG2AS1bits __at(0x3F50);
// bitfield macros

// Register: CWG2STR
#define CWG2STR CWG2STR
extern volatile unsigned char           CWG2STR             __at(0x3F51);
#ifndef _LIB_BUILD
asm("CWG2STR equ 03F51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned OVRA                   :1;
        unsigned OVRB                   :1;
        unsigned OVRC                   :1;
        unsigned OVRD                   :1;
    };
    struct {
        unsigned CWG2STRA               :1;
        unsigned CWG2STRB               :1;
        unsigned CWG2STRC               :1;
        unsigned CWG2STRD               :1;
        unsigned CWG2OVRA               :1;
        unsigned CWG2OVRB               :1;
        unsigned CWG2OVRC               :1;
        unsigned CWG2OVRD               :1;
    };
} CWG2STRbits_t;
extern volatile CWG2STRbits_t CWG2STRbits __at(0x3F51);
// bitfield macros

// Register: CWG1CLK
#define CWG1CLK CWG1CLK
extern volatile unsigned char           CWG1CLK             __at(0x3F52);
#ifndef _LIB_BUILD
asm("CWG1CLK equ 03F52h");
#endif
// aliases
extern volatile unsigned char           CWG1CLKCON          __at(0x3F52);
#ifndef _LIB_BUILD
asm("CWG1CLKCON equ 03F52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG1CS                 :1;
    };
} CWG1CLKbits_t;
extern volatile CWG1CLKbits_t CWG1CLKbits __at(0x3F52);
// bitfield macros
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG1CS                 :1;
    };
} CWG1CLKCONbits_t;
extern volatile CWG1CLKCONbits_t CWG1CLKCONbits __at(0x3F52);
// bitfield macros

// Register: CWG1ISM
#define CWG1ISM CWG1ISM
extern volatile unsigned char           CWG1ISM             __at(0x3F53);
#ifndef _LIB_BUILD
asm("CWG1ISM equ 03F53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IS                     :4;
    };
    struct {
        unsigned CWG1ISM0               :1;
        unsigned CWG1ISM1               :1;
        unsigned CWG1ISM2               :1;
        unsigned CWG1ISM3               :1;
    };
} CWG1ISMbits_t;
extern volatile CWG1ISMbits_t CWG1ISMbits __at(0x3F53);
// bitfield macros

// Register: CWG1DBR
#define CWG1DBR CWG1DBR
extern volatile unsigned char           CWG1DBR             __at(0x3F54);
#ifndef _LIB_BUILD
asm("CWG1DBR equ 03F54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :6;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned CWG1DBR                :6;
    };
    struct {
        unsigned CWG1DBR0               :1;
        unsigned CWG1DBR1               :1;
        unsigned CWG1DBR2               :1;
        unsigned CWG1DBR3               :1;
        unsigned CWG1DBR4               :1;
        unsigned CWG1DBR5               :1;
    };
} CWG1DBRbits_t;
extern volatile CWG1DBRbits_t CWG1DBRbits __at(0x3F54);
// bitfield macros

// Register: CWG1DBF
#define CWG1DBF CWG1DBF
extern volatile unsigned char           CWG1DBF             __at(0x3F55);
#ifndef _LIB_BUILD
asm("CWG1DBF equ 03F55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF                    :6;
    };
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned CWG1DBF                :6;
    };
    struct {
        unsigned CWG1DBF0               :1;
        unsigned CWG1DBF1               :1;
        unsigned CWG1DBF2               :1;
        unsigned CWG1DBF3               :1;
        unsigned CWG1DBF4               :1;
        unsigned CWG1DBF5               :1;
    };
} CWG1DBFbits_t;
extern volatile CWG1DBFbits_t CWG1DBFbits __at(0x3F55);
// bitfield macros

