LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile CCPTMRS1bits_t CCPTMRS1bits __at(0x3F5F);
// bitfield macros

// Register: PWM8DC
#define PWM8DC PWM8DC
extern volatile unsigned short          PWM8DC              __at(0x3F60);
#ifndef _LIB_BUILD
asm("PWM8DC equ 03F60h");
#endif

// Register: PWM8DCL
#define PWM8DCL PWM8DCL
extern volatile unsigned char           PWM8DCL             __at(0x3F60);
#ifndef _LIB_BUILD
asm("PWM8DCL equ 03F60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM8DC0                :1;
        unsigned PWM8DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM8DCLbits_t;
extern volatile PWM8DCLbits_t PWM8DCLbits __at(0x3F60);
// bitfield macros

// Register: PWM8DCH
#define PWM8DCH PWM8DCH
extern volatile unsigned char           PWM8DCH             __at(0x3F61);
#ifndef _LIB_BUILD
asm("PWM8DCH equ 03F61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM8DC2                :1;
        unsigned PWM8DC3                :1;
        unsigned PWM8DC4                :1;
        unsigned PWM8DC5                :1;
        unsigned PWM8DC6                :1;
        unsigned PWM8DC7                :1;
        unsigned PWM8DC8                :1;
        unsigned PWM8DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM8DCHbits_t;
extern volatile PWM8DCHbits_t PWM8DCHbits __at(0x3F61);
// bitfield macros

// Register: PWM8CON
#define PWM8CON PWM8CON
extern volatile unsigned char           PWM8CON             __at(0x3F62);
#ifndef _LIB_BUILD
asm("PWM8CON equ 03F62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM8POL                :1;
        unsigned PWM8OUT                :1;
        unsigned                        :1;
        unsigned PWM8EN                 :1;
    };
} PWM8CONbits_t;
extern volatile PWM8CONbits_t PWM8CONbits __at(0x3F62);
// bitfield macros

// Register: PWM7DC
#define PWM7DC PWM7DC
extern volatile unsigned short          PWM7DC              __at(0x3F64);
#ifndef _LIB_BUILD
asm("PWM7DC equ 03F64h");
#endif

// Register: PWM7DCL
#define PWM7DCL PWM7DCL
extern volatile unsigned char           PWM7DCL             __at(0x3F64);
#ifndef _LIB_BUILD
asm("PWM7DCL equ 03F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM7DC0                :1;
        unsigned PWM7DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM7DCLbits_t;
extern volatile PWM7DCLbits_t PWM7DCLbits __at(0x3F64);
// bitfield macros

// Register: PWM7DCH
#define PWM7DCH PWM7DCH
extern volatile unsigned char           PWM7DCH             __at(0x3F65);
#ifndef _LIB_BUILD
asm("PWM7DCH equ 03F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM7DC2                :1;
        unsigned PWM7DC3                :1;
        unsigned PWM7DC4                :1;
        unsigned PWM7DC5                :1;
        unsigned PWM7DC6                :1;
        unsigned PWM7DC7                :1;
        unsigned PWM7DC8                :1;
        unsigned PWM7DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM7DCHbits_t;
extern volatile PWM7DCHbits_t PWM7DCHbits __at(0x3F65);
// bitfield macros

// Register: PWM7CON
#define PWM7CON PWM7CON
extern volatile unsigned char           PWM7CON             __at(0x3F66);
#ifndef _LIB_BUILD
asm("PWM7CON equ 03F66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM7POL                :1;
        unsigned PWM7OUT                :1;
        unsigned                        :1;
        unsigned PWM7EN                 :1;
    };
} PWM7CONbits_t;
extern volatile PWM7CONbits_t PWM7CONbits __at(0x3F66);
// bitfield macros

// Register: PWM6DC
#define PWM6DC PWM6DC
extern volatile unsigned short          PWM6DC              __at(0x3F68);
#ifndef _LIB_BUILD
asm("PWM6DC equ 03F68h");
#endif

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
extern volatile unsigned char           PWM6DCL             __at(0x3F68);
#ifndef _LIB_BUILD
asm("PWM6DCL equ 03F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM6DC0                :1;
        unsigned PWM6DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM6DCLbits_t;
extern volatile PWM6DCLbits_t PWM6DCLbits __at(0x3F68);
// bitfield macros

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
extern volatile unsigned char           PWM6DCH             __at(0x3F69);
#ifndef _LIB_BUILD
asm("PWM6DCH equ 03F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM6DC2                :1;
        unsigned PWM6DC3                :1;
        unsigned PWM6DC4                :1;
        unsigned PWM6DC5                :1;
        unsigned PWM6DC6                :1;
        unsigned PWM6DC7                :1;
        unsigned PWM6DC8                :1;
        unsigned PWM6DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM6DCHbits_t;
extern volatile PWM6DCHbits_t PWM6DCHbits __at(0x3F69);
// bitfield macros

// Register: PWM6CON
#define PWM6CON PWM6CON
extern volatile unsigned char           PWM6CON             __at(0x3F6A);
#ifndef _LIB_BUILD
asm("PWM6CON equ 03F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM6POL                :1;
        unsigned PWM6OUT                :1;
        unsigned                        :1;
        unsigned PWM6EN                 :1;
    };
} PWM6CONbits_t;
extern volatile PWM6CONbits_t PWM6CONbits __at(0x3F6A);
// bitfield macros

