LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: PWM5DC
#define PWM5DC PWM5DC
extern volatile unsigned short          PWM5DC              __at(0x3F6C);
#ifndef _LIB_BUILD
asm("PWM5DC equ 03F6Ch");
#endif

// Register: PWM5DCL
#define PWM5DCL PWM5DCL
extern volatile unsigned char           PWM5DCL             __at(0x3F6C);
#ifndef _LIB_BUILD
asm("PWM5DCL equ 03F6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM5DC0                :1;
        unsigned PWM5DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM5DCLbits_t;
extern volatile PWM5DCLbits_t PWM5DCLbits __at(0x3F6C);
// bitfield macros

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
extern volatile unsigned char           PWM5DCH             __at(0x3F6D);
#ifndef _LIB_BUILD
asm("PWM5DCH equ 03F6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM5DC2                :1;
        unsigned PWM5DC3                :1;
        unsigned PWM5DC4                :1;
        unsigned PWM5DC5                :1;
        unsigned PWM5DC6                :1;
        unsigned PWM5DC7                :1;
        unsigned PWM5DC8                :1;
        unsigned PWM5DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM5DCHbits_t;
extern volatile PWM5DCHbits_t PWM5DCHbits __at(0x3F6D);
// bitfield macros

// Register: PWM5CON
#define PWM5CON PWM5CON
extern volatile unsigned char           PWM5CON             __at(0x3F6E);
#ifndef _LIB_BUILD
asm("PWM5CON equ 03F6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM5POL                :1;
        unsigned PWM5OUT                :1;
        unsigned                        :1;
        unsigned PWM5EN                 :1;
    };
} PWM5CONbits_t;
extern volatile PWM5CONbits_t PWM5CONbits __at(0x3F6E);
// bitfield macros

// Register: CCPR4
#define CCPR4 CCPR4
extern volatile unsigned short          CCPR4               __at(0x3F70);
#ifndef _LIB_BUILD
asm("CCPR4 equ 03F70h");
#endif

// Register: CCPR4L
#define CCPR4L CCPR4L
extern volatile unsigned char           CCPR4L              __at(0x3F70);
#ifndef _LIB_BUILD
asm("CCPR4L equ 03F70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL                     :8;
    };
} CCPR4Lbits_t;
extern volatile CCPR4Lbits_t CCPR4Lbits __at(0x3F70);
// bitfield macros

// Register: CCPR4H
#define CCPR4H CCPR4H
extern volatile unsigned char           CCPR4H              __at(0x3F71);
#ifndef _LIB_BUILD
asm("CCPR4H equ 03F71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH                     :8;
    };
} CCPR4Hbits_t;
extern volatile CCPR4Hbits_t CCPR4Hbits __at(0x3F71);
// bitfield macros

// Register: CCP4CON
#define CCP4CON CCP4CON
extern volatile unsigned char           CCP4CON             __at(0x3F72);
#ifndef _LIB_BUILD
asm("CCP4CON equ 03F72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned FMT                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned CCP4MODE               :4;
        unsigned CCP4FMT                :1;
        unsigned CCP4OUT                :1;
        unsigned                        :1;
        unsigned CCP4EN                 :1;
    };
    struct {
        unsigned CCP4MODE0              :1;
        unsigned CCP4MODE1              :1;
        unsigned CCP4MODE2              :1;
        unsigned CCP4MODE3              :1;
    };
    struct {
        unsigned                        :7;
        unsigned P4M1                   :1;
    };
} CCP4CONbits_t;
extern volatile CCP4CONbits_t CCP4CONbits __at(0x3F72);
// bitfield macros

// Register: CCP4CAP
#define CCP4CAP CCP4CAP
extern volatile unsigned char           CCP4CAP             __at(0x3F73);
#ifndef _LIB_BUILD
asm("CCP4CAP equ 03F73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
    };
    struct {
        unsigned CCP4CTS                :8;
    };
    struct {
        unsigned CCP4CTS0               :1;
        unsigned CCP4CTS1               :1;
        unsigned CCP4CTS2               :1;
    };
} CCP4CAPbits_t;
extern volatile CCP4CAPbits_t CCP4CAPbits __at(0x3F73);
// bitfield macros

// Register: CCPR3
#define CCPR3 CCPR3
extern volatile unsigned short          CCPR3               __at(0x3F74);
#ifndef _LIB_BUILD
asm("CCPR3 equ 03F74h");
#endif

