LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile TRISBbits_t TRISBbits __at(0x3FC3);
// bitfield macros

// Register: TRISC
#define TRISC TRISC
extern volatile unsigned char           TRISC               __at(0x3FC4);
#ifndef _LIB_BUILD
asm("TRISC equ 03FC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC0                 :1;
        unsigned TRISC1                 :1;
        unsigned TRISC2                 :1;
        unsigned TRISC3                 :1;
        unsigned TRISC4                 :1;
        unsigned TRISC5                 :1;
        unsigned TRISC6                 :1;
        unsigned TRISC7                 :1;
    };
} TRISCbits_t;
extern volatile TRISCbits_t TRISCbits __at(0x3FC4);
// bitfield macros

// Register: TRISD
#define TRISD TRISD
extern volatile unsigned char           TRISD               __at(0x3FC5);
#ifndef _LIB_BUILD
asm("TRISD equ 03FC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISD0                 :1;
        unsigned TRISD1                 :1;
        unsigned TRISD2                 :1;
        unsigned TRISD3                 :1;
        unsigned TRISD4                 :1;
        unsigned TRISD5                 :1;
        unsigned TRISD6                 :1;
        unsigned TRISD7                 :1;
    };
} TRISDbits_t;
extern volatile TRISDbits_t TRISDbits __at(0x3FC5);
// bitfield macros

// Register: TRISE
#define TRISE TRISE
extern volatile unsigned char           TRISE               __at(0x3FC6);
#ifndef _LIB_BUILD
asm("TRISE equ 03FC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISE0                 :1;
        unsigned TRISE1                 :1;
        unsigned TRISE2                 :1;
    };
} TRISEbits_t;
extern volatile TRISEbits_t TRISEbits __at(0x3FC6);
// bitfield macros

// Register: PORTA
#define PORTA PORTA
extern volatile unsigned char           PORTA               __at(0x3FCA);
#ifndef _LIB_BUILD
asm("PORTA equ 03FCAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
        unsigned RA6                    :1;
        unsigned RA7                    :1;
    };
    struct {
        unsigned ULPWUIN                :1;
        unsigned                        :4;
        unsigned LVDIN                  :1;
        unsigned                        :1;
        unsigned RJPU                   :1;
    };
} PORTAbits_t;
extern volatile PORTAbits_t PORTAbits __at(0x3FCA);
// bitfield macros

// Register: PORTB
#define PORTB PORTB
extern volatile unsigned char           PORTB               __at(0x3FCB);
#ifndef _LIB_BUILD
asm("PORTB equ 03FCBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
        unsigned RB6                    :1;
        unsigned RB7                    :1;
    };
    struct {
        unsigned                        :3;
        unsigned CCP2_PA2               :1;
    };
} PORTBbits_t;
extern volatile PORTBbits_t PORTBbits __at(0x3FCB);
// bitfield macros

// Register: PORTC
#define PORTC PORTC
extern volatile unsigned char           PORTC               __at(0x3FCC);
#ifndef _LIB_BUILD
asm("PORTC equ 03FCCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC0                    :1;
        unsigned RC1                    :1;
        unsigned RC2                    :1;
        unsigned RC3                    :1;
        unsigned RC4                    :1;
        unsigned RC5                    :1;
        unsigned RC6                    :1;
        unsigned RC7                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCP2                   :1;
        unsigned PA1                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned PA2                    :1;
    };
} PORTCbits_t;
extern volatile PORTCbits_t PORTCbits __at(0x3FCC);
// bitfield macros

// Register: PORTD
#define PORTD PORTD
extern volatile unsigned char           PORTD               __at(0x3FCD);
#ifndef _LIB_BUILD
asm("PORTD equ 03FCDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0                    :1;
        unsigned RD1                    :1;
        unsigned RD2                    :1;
        unsigned RD3                    :1;
        unsigned RD4                    :1;
        unsigned RD5                    :1;
        unsigned RD6                    :1;
        unsigned RD7                    :1;
    };
} PORTDbits_t;
extern volatile PORTDbits_t PORTDbits __at(0x3FCD);
// bitfield macros

// Register: PORTE
#define PORTE PORTE
extern volatile unsigned char           PORTE               __at(0x3FCE);
#ifndef _LIB_BUILD
asm("PORTE equ 03FCEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0                    :1;
        unsigned RE1                    :1;
        unsigned RE2                    :1;
        unsigned RE3                    :1;
    };
    struct {
        unsigned                        :3;
        unsigned CCP9E                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned PC3E                   :1;
    };
} PORTEbits_t;
extern volatile PORTEbits_t PORTEbits __at(0x3FCE);
// bitfield macros

// Register: INTCON0
#define INTCON0 INTCON0
extern volatile unsigned char           INTCON0             __at(0x3FD2);
#ifndef _LIB_BUILD
asm("INTCON0 equ 03FD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0EDG                :1;
        unsigned INT1EDG                :1;
        unsigned INT2EDG                :1;
        unsigned                        :2;
        unsigned IPEN                   :1;
        unsigned GIEL                   :1;
        unsigned GIE                    :1;
    };
    struct {
        unsigned                        :7;
        unsigned GIEH                   :1;
    };
} INTCON0bits_t;
