LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile INTCON0bits_t INTCON0bits __at(0x3FD2);
// bitfield macros

// Register: INTCON1
#define INTCON1 INTCON1
extern volatile unsigned char           INTCON1             __at(0x3FD3);
#ifndef _LIB_BUILD
asm("INTCON1 equ 03FD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned STAT                   :2;
    };
    struct {
        unsigned                        :6;
        unsigned STAT0                  :1;
        unsigned STAT1                  :1;
    };
} INTCON1bits_t;
extern volatile INTCON1bits_t INTCON1bits __at(0x3FD3);
// bitfield macros

// Register: IVTLOCK
#define IVTLOCK IVTLOCK
extern volatile unsigned char           IVTLOCK             __at(0x3FD4);
#ifndef _LIB_BUILD
asm("IVTLOCK equ 03FD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTLOCKED              :1;
    };
} IVTLOCKbits_t;
extern volatile IVTLOCKbits_t IVTLOCKbits __at(0x3FD4);
// bitfield macros

// Register: IVTBASE
#define IVTBASE IVTBASE
#ifndef __CCI__
extern volatile __uint24                IVTBASE             __at(0x3FD5);
#endif
#ifndef _LIB_BUILD
asm("IVTBASE equ 03FD5h");
#endif

// Register: IVTBASEL
#define IVTBASEL IVTBASEL
extern volatile unsigned char           IVTBASEL            __at(0x3FD5);
#ifndef _LIB_BUILD
asm("IVTBASEL equ 03FD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE0                  :1;
        unsigned BASE1                  :1;
        unsigned BASE2                  :1;
        unsigned BASE3                  :1;
        unsigned BASE4                  :1;
        unsigned BASE5                  :1;
        unsigned BASE6                  :1;
        unsigned BASE7                  :1;
    };
} IVTBASELbits_t;
extern volatile IVTBASELbits_t IVTBASELbits __at(0x3FD5);
// bitfield macros

// Register: IVTBASEH
#define IVTBASEH IVTBASEH
extern volatile unsigned char           IVTBASEH            __at(0x3FD6);
#ifndef _LIB_BUILD
asm("IVTBASEH equ 03FD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE8                  :1;
        unsigned BASE9                  :1;
        unsigned BASE10                 :1;
        unsigned BASE11                 :1;
        unsigned BASE12                 :1;
        unsigned BASE13                 :1;
        unsigned BASE14                 :1;
        unsigned BASE15                 :1;
    };
} IVTBASEHbits_t;
extern volatile IVTBASEHbits_t IVTBASEHbits __at(0x3FD6);
// bitfield macros

// Register: IVTBASEU
#define IVTBASEU IVTBASEU
extern volatile unsigned char           IVTBASEU            __at(0x3FD7);
#ifndef _LIB_BUILD
asm("IVTBASEU equ 03FD7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE16                 :1;
        unsigned BASE17                 :1;
        unsigned BASE18                 :1;
        unsigned BASE19                 :1;
        unsigned BASE20                 :1;
    };
} IVTBASEUbits_t;
extern volatile IVTBASEUbits_t IVTBASEUbits __at(0x3FD7);
// bitfield macros

// Register: STATUS
#define STATUS STATUS
extern volatile unsigned char           STATUS              __at(0x3FD8);
#ifndef _LIB_BUILD
asm("STATUS equ 03FD8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned NOT_PD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_TO                 :1;
    };
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
    struct {
        unsigned CARRY                  :1;
        unsigned                        :1;
        unsigned ZERO                   :1;
        unsigned OVERFLOW               :1;
        unsigned NEGATIVE               :1;
    };
} STATUSbits_t;
extern volatile STATUSbits_t STATUSbits __at(0x3FD8);
// bitfield macros

// Register: FSR2
#define FSR2 FSR2
extern volatile unsigned short          FSR2                __at(0x3FD9);
#ifndef _LIB_BUILD
asm("FSR2 equ 03FD9h");
#endif

// Register: FSR2L
#define FSR2L FSR2L
extern volatile unsigned char           FSR2L               __at(0x3FD9);
#ifndef _LIB_BUILD
asm("FSR2L equ 03FD9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2L                  :8;
    };
} FSR2Lbits_t;
extern volatile FSR2Lbits_t FSR2Lbits __at(0x3FD9);
// bitfield macros

// Register: FSR2H
#define FSR2H FSR2H
extern volatile unsigned char           FSR2H               __at(0x3FDA);
#ifndef _LIB_BUILD
asm("FSR2H equ 03FDAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2H                  :6;
    };
} FSR2Hbits_t;
extern volatile FSR2Hbits_t FSR2Hbits __at(0x3FDA);
// bitfield macros

// Register: PLUSW2
#define PLUSW2 PLUSW2
extern volatile unsigned char           PLUSW2              __at(0x3FDB);
#ifndef _LIB_BUILD
asm("PLUSW2 equ 03FDBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLUSW2                 :8;
    };
} PLUSW2bits_t;
extern volatile PLUSW2bits_t PLUSW2bits __at(0x3FDB);
// bitfield macros

// Register: PREINC2
#define PREINC2 PREINC2
extern volatile unsigned char           PREINC2             __at(0x3FDC);
#ifndef _LIB_BUILD
asm("PREINC2 equ 03FDCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PREINC2                :8;
    };
} PREINC2bits_t;
extern volatile PREINC2bits_t PREINC2bits __at(0x3FDC);
// bitfield macros

// Register: POSTDEC2
#define POSTDEC2 POSTDEC2
extern volatile unsigned char           POSTDEC2            __at(0x3FDD);
#ifndef _LIB_BUILD
asm("POSTDEC2 equ 03FDDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTDEC2               :8;
    };
} POSTDEC2bits_t;
extern volatile POSTDEC2bits_t POSTDEC2bits __at(0x3FDD);
// bitfield macros

// Register: POSTINC2
#define POSTINC2 POSTINC2
extern volatile unsigned char           POSTINC2            __at(0x3FDE);
#ifndef _LIB_BUILD
asm("POSTINC2 equ 03FDEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTINC2               :8;
    };
} POSTINC2bits_t;
extern volatile POSTINC2bits_t POSTINC2bits __at(0x3FDE);
// bitfield macros

// Register: INDF2
#define INDF2 INDF2
extern volatile unsigned char           INDF2               __at(0x3FDF);
#ifndef _LIB_BUILD
asm("INDF2 equ 03FDFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INDF2                  :8;
    };
} INDF2bits_t;
extern volatile INDF2bits_t INDF2bits __at(0x3FDF);
// bitfield macros

