LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: BSR
#define BSR BSR
extern volatile unsigned char           BSR                 __at(0x3FE0);
#ifndef _LIB_BUILD
asm("BSR equ 03FE0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BSR                    :6;
    };
} BSRbits_t;
extern volatile BSRbits_t BSRbits __at(0x3FE0);
// bitfield macros

// Register: FSR1
#define FSR1 FSR1
extern volatile unsigned short          FSR1                __at(0x3FE1);
#ifndef _LIB_BUILD
asm("FSR1 equ 03FE1h");
#endif

// Register: FSR1L
#define FSR1L FSR1L
extern volatile unsigned char           FSR1L               __at(0x3FE1);
#ifndef _LIB_BUILD
asm("FSR1L equ 03FE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1L                  :8;
    };
} FSR1Lbits_t;
extern volatile FSR1Lbits_t FSR1Lbits __at(0x3FE1);
// bitfield macros

// Register: FSR1H
#define FSR1H FSR1H
extern volatile unsigned char           FSR1H               __at(0x3FE2);
#ifndef _LIB_BUILD
asm("FSR1H equ 03FE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1H                  :6;
    };
} FSR1Hbits_t;
extern volatile FSR1Hbits_t FSR1Hbits __at(0x3FE2);
// bitfield macros

// Register: PLUSW1
#define PLUSW1 PLUSW1
extern volatile unsigned char           PLUSW1              __at(0x3FE3);
#ifndef _LIB_BUILD
asm("PLUSW1 equ 03FE3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLUSW1                 :8;
    };
} PLUSW1bits_t;
extern volatile PLUSW1bits_t PLUSW1bits __at(0x3FE3);
// bitfield macros

// Register: PREINC1
#define PREINC1 PREINC1
extern volatile unsigned char           PREINC1             __at(0x3FE4);
#ifndef _LIB_BUILD
asm("PREINC1 equ 03FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PREINC1                :8;
    };
} PREINC1bits_t;
extern volatile PREINC1bits_t PREINC1bits __at(0x3FE4);
// bitfield macros

// Register: POSTDEC1
#define POSTDEC1 POSTDEC1
extern volatile unsigned char           POSTDEC1            __at(0x3FE5);
#ifndef _LIB_BUILD
asm("POSTDEC1 equ 03FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTDEC1               :8;
    };
} POSTDEC1bits_t;
extern volatile POSTDEC1bits_t POSTDEC1bits __at(0x3FE5);
// bitfield macros

// Register: POSTINC1
#define POSTINC1 POSTINC1
extern volatile unsigned char           POSTINC1            __at(0x3FE6);
#ifndef _LIB_BUILD
asm("POSTINC1 equ 03FE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTINC1               :8;
    };
} POSTINC1bits_t;
extern volatile POSTINC1bits_t POSTINC1bits __at(0x3FE6);
// bitfield macros

// Register: INDF1
#define INDF1 INDF1
extern volatile unsigned char           INDF1               __at(0x3FE7);
#ifndef _LIB_BUILD
asm("INDF1 equ 03FE7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INDF1                  :8;
    };
} INDF1bits_t;
extern volatile INDF1bits_t INDF1bits __at(0x3FE7);
// bitfield macros

// Register: WREG
#define WREG WREG
extern volatile unsigned char           WREG                __at(0x3FE8);
#ifndef _LIB_BUILD
asm("WREG equ 03FE8h");
#endif
// aliases
// extern volatile unsigned char           W                   __at(0x3FE8);
#ifndef _LIB_BUILD
// asm("W equ 03FE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} WREGbits_t;
extern volatile WREGbits_t WREGbits __at(0x3FE8);
// bitfield macros
// alias bitfield definitions
typedef union {
    struct {
        unsigned WREG                   :8;
    };
} Wbits_t;
extern volatile Wbits_t Wbits __at(0x3FE8);
// bitfield macros

// Register: FSR0
#define FSR0 FSR0
extern volatile unsigned short          FSR0                __at(0x3FE9);
#ifndef _LIB_BUILD
asm("FSR0 equ 03FE9h");
#endif

// Register: FSR0L
#define FSR0L FSR0L
extern volatile unsigned char           FSR0L               __at(0x3FE9);
#ifndef _LIB_BUILD
asm("FSR0L equ 03FE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0L                  :8;
    };
} FSR0Lbits_t;
extern volatile FSR0Lbits_t FSR0Lbits __at(0x3FE9);
// bitfield macros

// Register: FSR0H
#define FSR0H FSR0H
extern volatile unsigned char           FSR0H               __at(0x3FEA);
#ifndef _LIB_BUILD
asm("FSR0H equ 03FEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0H                  :6;
    };
} FSR0Hbits_t;
extern volatile FSR0Hbits_t FSR0Hbits __at(0x3FEA);
// bitfield macros

// Register: PLUSW0
#define PLUSW0 PLUSW0
extern volatile unsigned char           PLUSW0              __at(0x3FEB);
#ifndef _LIB_BUILD
asm("PLUSW0 equ 03FEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLUSW0                 :8;
    };
} PLUSW0bits_t;
extern volatile PLUSW0bits_t PLUSW0bits __at(0x3FEB);
// bitfield macros

// Register: PREINC0
#define PREINC0 PREINC0
extern volatile unsigned char           PREINC0             __at(0x3FEC);
#ifndef _LIB_BUILD
asm("PREINC0 equ 03FECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PREINC0                :8;
    };
} PREINC0bits_t;
extern volatile PREINC0bits_t PREINC0bits __at(0x3FEC);
// bitfield macros

// Register: POSTDEC0
#define POSTDEC0 POSTDEC0
extern volatile unsigned char           POSTDEC0            __at(0x3FED);
#ifndef _LIB_BUILD
asm("POSTDEC0 equ 03FEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTDEC0               :8;
    };
} POSTDEC0bits_t;
extern volatile POSTDEC0bits_t POSTDEC0bits __at(0x3FED);
// bitfield macros

// Register: POSTINC0
#define POSTINC0 POSTINC0
extern volatile unsigned char           POSTINC0            __at(0x3FEE);
#ifndef _LIB_BUILD
asm("POSTINC0 equ 03FEEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POSTINC0               :8;
    };
} POSTINC0bits_t;
extern volatile POSTINC0bits_t POSTINC0bits __at(0x3FEE);
// bitfield macros

// Register: INDF0
#define INDF0 INDF0
extern volatile unsigned char           INDF0               __at(0x3FEF);
#ifndef _LIB_BUILD
asm("INDF0 equ 03FEFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INDF0                  :8;
    };
} INDF0bits_t;
extern volatile INDF0bits_t INDF0bits __at(0x3FEF);
// bitfield macros

// Register: PCON0
#define PCON0 PCON0
extern volatile unsigned char           PCON0               __at(0x3FF0);
#ifndef _LIB_BUILD
asm("PCON0 equ 03FF0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NOT_BOR                :1;
    };
    struct {
        unsigned                        :1;
        unsigned NOT_POR                :1;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_RI                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_RMCLR              :1;
    };
    struct {
        unsigned                        :4;
        unsigned NOT_RWDT               :1;
    };
    struct {
        unsigned                        :5;
        unsigned NOT_WDTWV              :1;
    };
    struct {
        unsigned nBOR                   :1;
        unsigned nPOR                   :1;
        unsigned nRI                    :1;
        unsigned nRMCLR                 :1;
        unsigned nRWDT                  :1;
        unsigned nWDTWV                 :1;
        unsigned STKUNF                 :1;
        unsigned STKOVF                 :1;
    };
    struct {
        unsigned BOR                    :1;
        unsigned POR                    :1;
        unsigned RI                     :1;
        unsigned RMCLR                  :1;
        unsigned RWDT                   :1;
        unsigned WDTWV                  :1;
    };
} PCON0bits_t;
extern volatile PCON0bits_t PCON0bits __at(0x3FF0);
// bitfield macros

// Register: PCON1
#define PCON1 PCON1
extern volatile unsigned char           PCON1               __at(0x3FF1);
#ifndef _LIB_BUILD
asm("PCON1 equ 03FF1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned NOT_MEMV               :1;
    };
    struct {
        unsigned                        :1;
        unsigned nMEMV                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned MEMV                   :1;
    };
} PCON1bits_t;
extern volatile PCON1bits_t PCON1bits __at(0x3FF1);
// bitfield macros

// Register: PROD
#define PROD PROD
extern volatile unsigned short          PROD                __at(0x3FF3);
#ifndef _LIB_BUILD
asm("PROD equ 03FF3h");
#endif

// Register: PRODL
#define PRODL PRODL
extern volatile unsigned char           PRODL               __at(0x3FF3);
#ifndef _LIB_BUILD
asm("PRODL equ 03FF3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRODL                  :8;
    };
} PRODLbits_t;
extern volatile PRODLbits_t PRODLbits __at(0x3FF3);
// bitfield macros

// Register: PRODH
#define PRODH PRODH
extern volatile unsigned char           PRODH               __at(0x3FF4);
#ifndef _LIB_BUILD
asm("PRODH equ 03FF4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRODH                  :8;
    };
} PRODHbits_t;
extern volatile PRODHbits_t PRODHbits __at(0x3FF4);
// bitfield macros

// Register: TABLAT
#define TABLAT TABLAT
extern volatile unsigned char           TABLAT              __at(0x3FF5);
#ifndef _LIB_BUILD
asm("TABLAT equ 03FF5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TABLAT                 :8;
    };
} TABLATbits_t;
extern volatile TABLATbits_t TABLATbits __at(0x3FF5);
// bitfield macros

// Register: TBLPTR
#define TBLPTR TBLPTR
#ifndef __CCI__
extern volatile __uint24                TBLPTR              __at(0x3FF6);
#endif
#ifndef _LIB_BUILD
asm("TBLPTR equ 03FF6h");
#endif

// Register: TBLPTRL
#define TBLPTRL TBLPTRL
extern volatile unsigned char           TBLPTRL             __at(0x3FF6);
#ifndef _LIB_BUILD
asm("TBLPTRL equ 03FF6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TBLPTRL                :8;
    };
} TBLPTRLbits_t;
extern volatile TBLPTRLbits_t TBLPTRLbits __at(0x3FF6);
// bitfield macros

// Register: TBLPTRH
#define TBLPTRH TBLPTRH
extern volatile unsigned char           TBLPTRH             __at(0x3FF7);
#ifndef _LIB_BUILD
asm("TBLPTRH equ 03FF7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TBLPTRH                :8;
    };
} TBLPTRHbits_t;
extern volatile TBLPTRHbits_t TBLPTRHbits __at(0x3FF7);
// bitfield macros

// Register: TBLPTRU
#define TBLPTRU TBLPTRU
extern volatile unsigned char           TBLPTRU             __at(0x3FF8);
#ifndef _LIB_BUILD
asm("TBLPTRU equ 03FF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TBLPTRU                :6;
    };
    struct {
        unsigned                        :5;
        unsigned ACSS                   :1;
    };
} TBLPTRUbits_t;
extern volatile TBLPTRUbits_t TBLPTRUbits __at(0x3FF8);
// bitfield macros

// Register: PCLAT
#define PCLAT PCLAT
#ifndef __CCI__
extern volatile __uint24                PCLAT               __at(0x3FF9);
#endif
#ifndef _LIB_BUILD
asm("PCLAT equ 03FF9h");
#endif

