LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
// Register: PCL
#define PCL PCL
extern volatile unsigned char           PCL                 __at(0x3FF9);
#ifndef _LIB_BUILD
asm("PCL equ 03FF9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCL                    :8;
    };
} PCLbits_t;
extern volatile PCLbits_t PCLbits __at(0x3FF9);
// bitfield macros

// Register: PCLATH
#define PCLATH PCLATH
extern volatile unsigned char           PCLATH              __at(0x3FFA);
#ifndef _LIB_BUILD
asm("PCLATH equ 03FFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :8;
    };
} PCLATHbits_t;
extern volatile PCLATHbits_t PCLATHbits __at(0x3FFA);
// bitfield macros

// Register: PCLATU
#define PCLATU PCLATU
extern volatile unsigned char           PCLATU              __at(0x3FFB);
#ifndef _LIB_BUILD
asm("PCLATU equ 03FFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCU                    :5;
    };
} PCLATUbits_t;
extern volatile PCLATUbits_t PCLATUbits __at(0x3FFB);
// bitfield macros

// Register: STKPTR
#define STKPTR STKPTR
extern volatile unsigned char           STKPTR              __at(0x3FFC);
#ifndef _LIB_BUILD
asm("STKPTR equ 03FFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STKPTR                 :5;
    };
    struct {
        unsigned STKPTR0                :1;
        unsigned STKPTR1                :1;
        unsigned STKPTR2                :1;
        unsigned STKPTR3                :1;
        unsigned STKPTR4                :1;
    };
    struct {
        unsigned SP0                    :1;
        unsigned SP1                    :1;
        unsigned SP2                    :1;
        unsigned SP3                    :1;
        unsigned SP4                    :1;
    };
} STKPTRbits_t;
extern volatile STKPTRbits_t STKPTRbits __at(0x3FFC);
// bitfield macros

// Register: TOS
#define TOS TOS
#ifndef __CCI__
extern volatile __uint24                TOS                 __at(0x3FFD);
#endif
#ifndef _LIB_BUILD
asm("TOS equ 03FFDh");
#endif

// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0x3FFD);
#ifndef _LIB_BUILD
asm("TOSL equ 03FFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0x3FFD);
// bitfield macros

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0x3FFE);
#ifndef _LIB_BUILD
asm("TOSH equ 03FFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0x3FFE);
// bitfield macros

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0x3FFF);
#ifndef _LIB_BUILD
asm("TOSU equ 03FFFh");
#endif

/*
 * Register Mirrors in DMA Space
 */

// Register: IOCAF
#define                                 IOCAF_M1            0x4060
// Register: IOCBF
#define                                 IOCBF_M1            0x4060
// Register: IOCCF
#define                                 IOCCF_M1            0x4060
// Register: IOCEF
#define                                 IOCEF_M1            0x4060
// Register: ADLTHL
#define                                 ADLTHL_M1           0x407C
// Register: ADLTHH
#define                                 ADLTHH_M1           0x407C
// Register: ADUTHL
#define                                 ADUTHL_M1           0x407C
// Register: ADUTHH
#define                                 ADUTHH_M1           0x407C
// Register: ADERRL
#define                                 ADERRL_M1           0x407C
// Register: ADERRH
#define                                 ADERRH_M1           0x407C
// Register: ADSTPTL
#define                                 ADSTPTL_M1          0x407C
// Register: ADSTPTH
#define                                 ADSTPTH_M1          0x407C
// Register: ADFLTRL
#define                                 ADFLTRL_M1          0x407C
// Register: ADFLTRH
#define                                 ADFLTRH_M1          0x407C
// Register: ADACCL
#define                                 ADACCL_M1           0x407C
// Register: ADACCH
#define                                 ADACCH_M1           0x407C
// Register: ADACCU
#define                                 ADACCU_M1           0x407C
// Register: ADCNT
#define                                 ADCNT_M1            0x407C
// Register: ADRPT
#define                                 ADRPT_M1            0x407C
// Register: ADPREVL
#define                                 ADPREVL_M1          0x407C
// Register: ADPREVH
#define                                 ADPREVH_M1          0x407C
// Register: ADACQL
#define                                 ADACQL_M1           0x407C
// Register: ADACQH
#define                                 ADACQH_M1           0x407C
// Register: ADCAP
#define                                 ADCAP_M1            0x407C
// Register: ADPCH
#define                                 ADPCH_M1            0x407C
// Register: ADRESL
#define                                 ADRESL_M1           0x407C
// Register: ADRESH
#define                                 ADRESH_M1           0x407C
// Register: ADLTHL
#define                                 ADLTHL_M2           0x4085
// Register: ADLTHH
#define                                 ADLTHH_M2           0x4085
// Register: ADUTHL
#define                                 ADUTHL_M2           0x4085
// Register: ADUTHH
#define                                 ADUTHH_M2           0x4085
// Register: ADERRL
#define                                 ADERRL_M2           0x4085
// Register: ADERRH
#define                                 ADERRH_M2           0x4085
// Register: ADSTPTL
#define                                 ADSTPTL_M2          0x4085
// Register: ADSTPTH
#define                                 ADSTPTH_M2          0x4085
// Register: ADFLTRL
#define                                 ADFLTRL_M2          0x4085
// Register: ADFLTRH
#define                                 ADFLTRH_M2          0x4085
// Register: ADACCL
#define                                 ADACCL_M2           0x4085
// Register: ADACCH
#define                                 ADACCH_M2           0x4085
// Register: ADACCU
#define                                 ADACCU_M2           0x4085
// Register: ADCNT
#define                                 ADCNT_M2            0x4085
// Register: ADRPT
#define                                 ADRPT_M2            0x4085
// Register: ADPREVL
#define                                 ADPREVL_M2          0x4085
// Register: ADPREVH
#define                                 ADPREVH_M2          0x4085
// Register: ADACQL
#define                                 ADACQL_M2           0x4085
// Register: ADACQH
#define                                 ADACQH_M2           0x4085
// Register: ADCAP
#define                                 ADCAP_M2            0x4085
// Register: ADCON0
#define                                 ADCON0_M1           0x4085
// Register: ADCON1
#define                                 ADCON1_M1           0x4085
// Register: ADCON2
#define                                 ADCON2_M1           0x4085
// Register: ADCON3
#define                                 ADCON3_M1           0x4085
// Register: ADREF
#define                                 ADREF_M1            0x4085
// Register: ADACT
#define                                 ADACT_M1            0x4085
// Register: ADCLK
#define                                 ADCLK_M1            0x4085
// Register: ADPCH
#define                                 ADPCH_M2            0x4085
// Register: ADRESL
#define                                 ADRESL_M2           0x4085
// Register: ADRESH
#define                                 ADRESH_M2           0x4085
// Register: CCPR1L
#define                                 CCPR1L_M1           0x4087
// Register: CCPR1H
#define                                 CCPR1H_M1           0x4087
// Register: T2PR
#define                                 T2PR_M1             0x4087
// Register: CCPR2L
#define                                 CCPR2L_M1           0x4087
// Register: CCPR2H
#define                                 CCPR2H_M1           0x4087
// Register: T2PR
#define                                 T2PR_M2             0x4087
// Register: PWM5DCL
#define                                 PWM5DCL_M1          0x4087
// Register: PWM5DCH
#define                                 PWM5DCH_M1          0x4087
// Register: T2PR
#define                                 T2PR_M3             0x4087
// Register: PWM6DCL
#define                                 PWM6DCL_M1          0x4087
// Register: PWM6DCH
#define                                 PWM6DCH_M1          0x4087
// Register: T2PR
#define                                 T2PR_M4             0x4087
// Register: CCPR3L
#define                                 CCPR3L_M1           0x4087
// Register: CCPR3H
#define                                 CCPR3H_M1           0x4087
// Register: T4PR
#define                                 T4PR_M1             0x4087
// Register: CCPR4L
#define                                 CCPR4L_M1           0x4087
// Register: CCPR4H
#define                                 CCPR4H_M1           0x4087
// Register: T4PR
#define                                 T4PR_M2             0x4087
// Register: PWM7DCL
#define                                 PWM7DCL_M1          0x4087
// Register: PWM7DCH
#define                                 PWM7DCH_M1          0x4087
// Register: T4PR
#define                                 T4PR_M3             0x4087
// Register: PWM8DCL
#define                                 PWM8DCL_M1          0x4087
// Register: PWM8DCH
#define                                 PWM8DCH_M1          0x4087
// Register: T4PR
#define                                 T4PR_M4             0x4087
// Register: CCPR1L
#define                                 CCPR1L_M2           0x4087
// Register: CCPR1H
#define                                 CCPR1H_M2           0x4087
// Register: T6PR
#define                                 T6PR_M1             0x4087
// Register: PWM5DCL
#define                                 PWM5DCL_M2          0x4087
// Register: PWM5DCH
#define                                 PWM5DCH_M2          0x4087
// Register: T6PR
#define                                 T6PR_M2             0x4087
// Register: CCPR1L
#define                                 CCPR1L_M3           0x4089
// Register: CCPR1H
#define                                 CCPR1H_M3           0x4089
// Register: CCPR2L
#define                                 CCPR2L_M2           0x4089
// Register: CCPR2H
#define                                 CCPR2H_M2           0x4089
// Register: CCPR3L
#define                                 CCPR3L_M2           0x4089
// Register: CCPR3H
#define                                 CCPR3H_M2           0x4089
// Register: CCPR4L
#define                                 CCPR4L_M2           0x4089
// Register: CCPR4H
#define                                 CCPR4H_M2           0x4089
// Register: PWM5DCL
#define                                 PWM5DCL_M3          0x4089
// Register: PWM5DCH
#define                                 PWM5DCH_M3          0x4089
// Register: PWM6DCL
#define                                 PWM6DCL_M2          0x4089
// Register: PWM6DCH
#define                                 PWM6DCH_M2          0x4089
// Register: PWM7DCL
#define                                 PWM7DCL_M2          0x4089
// Register: PWM7DCH
#define                                 PWM7DCH_M2          0x4089
// Register: PWM8DCL
#define                                 PWM8DCL_M2          0x4089
// Register: PWM8DCH
#define                                 PWM8DCH_M2          0x4089
// Register: TMR1L
#define                                 TMR1L_M1            0x408F
// Register: TMR1H
#define                                 TMR1H_M1            0x408F
// Register: TMR3L
#define                                 TMR3L_M1            0x408F
// Register: TMR3H
#define                                 TMR3H_M1            0x408F
// Register: TMR5L
#define                                 TMR5L_M1            0x408F
// Register: TMR5H
#define                                 TMR5H_M1            0x408F
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
// CRCCON0<ACCM>
extern volatile __bit                   ACCM                __at(0x1CB44);	// @ (0x3968 * 8 + 4)
#define                                 ACCM_bit            BANKMASK(CRCCON0), 4
// I2C1PIE<ACKT1IE>
extern volatile __bit                   ACKT1IE             __at(0x1EBD6);	// @ (0x3D7A * 8 + 6)
#define                                 ACKT1IE_bit         BANKMASK(I2C1PIE), 6
// I2C1PIR<ACKT1IF>
extern volatile __bit                   ACKT1IF             __at(0x1EBCE);	// @ (0x3D79 * 8 + 6)
#define                                 ACKT1IF_bit         BANKMASK(I2C1PIR), 6
// I2C2PIE<ACKT2IE>
extern volatile __bit                   ACKT2IE             __at(0x1EB26);	// @ (0x3D64 * 8 + 6)
#define                                 ACKT2IE_bit         BANKMASK(I2C2PIE), 6
// I2C2PIR<ACKT2IF>
extern volatile __bit                   ACKT2IF             __at(0x1EB1E);	// @ (0x3D63 * 8 + 6)
#define                                 ACKT2IF_bit         BANKMASK(I2C2PIR), 6
// ADCON2<ACLR>
extern volatile __bit                   ACLR                __at(0x1F7D3);	// @ (0x3EFA * 8 + 3)
#define                                 ACLR_bit            BANKMASK(ADCON2), 3
// ADACQL<ACQ0>
extern volatile __bit                   ACQ0                __at(0x1F798);	// @ (0x3EF3 * 8 + 0)
#define                                 ACQ0_bit            BANKMASK(ADACQL), 0
// ADACQL<ACQ1>
extern volatile __bit                   ACQ1                __at(0x1F799);	// @ (0x3EF3 * 8 + 1)
#define                                 ACQ1_bit            BANKMASK(ADACQL), 1
// ADACQH<ACQ10>
extern volatile __bit                   ACQ10               __at(0x1F7A2);	// @ (0x3EF4 * 8 + 2)
#define                                 ACQ10_bit           BANKMASK(ADACQH), 2
// ADACQH<ACQ11>
extern volatile __bit                   ACQ11               __at(0x1F7A3);	// @ (0x3EF4 * 8 + 3)
#define                                 ACQ11_bit           BANKMASK(ADACQH), 3
// ADACQH<ACQ12>
extern volatile __bit                   ACQ12               __at(0x1F7A4);	// @ (0x3EF4 * 8 + 4)
#define                                 ACQ12_bit           BANKMASK(ADACQH), 4
// ADACQL<ACQ2>
extern volatile __bit                   ACQ2                __at(0x1F79A);	// @ (0x3EF3 * 8 + 2)
#define                                 ACQ2_bit            BANKMASK(ADACQL), 2
// ADACQL<ACQ3>
extern volatile __bit                   ACQ3                __at(0x1F79B);	// @ (0x3EF3 * 8 + 3)
#define                                 ACQ3_bit            BANKMASK(ADACQL), 3
// ADACQL<ACQ4>
extern volatile __bit                   ACQ4                __at(0x1F79C);	// @ (0x3EF3 * 8 + 4)
#define                                 ACQ4_bit            BANKMASK(ADACQL), 4
// ADACQL<ACQ5>
extern volatile __bit                   ACQ5                __at(0x1F79D);	// @ (0x3EF3 * 8 + 5)
#define                                 ACQ5_bit            BANKMASK(ADACQL), 5
// ADACQL<ACQ6>
extern volatile __bit                   ACQ6                __at(0x1F79E);	// @ (0x3EF3 * 8 + 6)
#define                                 ACQ6_bit            BANKMASK(ADACQL), 6
// ADACQL<ACQ7>
extern volatile __bit                   ACQ7                __at(0x1F79F);	// @ (0x3EF3 * 8 + 7)
#define                                 ACQ7_bit            BANKMASK(ADACQL), 7
// ADACQH<ACQ8>
extern volatile __bit                   ACQ8                __at(0x1F7A0);	// @ (0x3EF4 * 8 + 0)
#define                                 ACQ8_bit            BANKMASK(ADACQH), 0
// ADACQH<ACQ9>
extern volatile __bit                   ACQ9                __at(0x1F7A1);	// @ (0x3EF4 * 8 + 1)
#define                                 ACQ9_bit            BANKMASK(ADACQH), 1
// TBLPTRU<ACSS>
extern volatile __bit                   ACSS                __at(0x1FFC5);	// @ (0x3FF8 * 8 + 5)
#define                                 ACSS_bit            BANKMASK(TBLPTRU), 5
// ADACT<ACT0>
extern volatile __bit                   ACT0                __at(0x1F7F0);	// @ (0x3EFE * 8 + 0)
#define                                 ACT0_bit            BANKMASK(ADACT), 0
// ADACT<ACT1>
extern volatile __bit                   ACT1                __at(0x1F7F1);	// @ (0x3EFE * 8 + 1)
#define                                 ACT1_bit            BANKMASK(ADACT), 1
// ADACT<ACT2>
extern volatile __bit                   ACT2                __at(0x1F7F2);	// @ (0x3EFE * 8 + 2)
#define                                 ACT2_bit            BANKMASK(ADACT), 2
// ADACT<ACT3>
extern volatile __bit                   ACT3                __at(0x1F7F3);	// @ (0x3EFE * 8 + 3)
#define                                 ACT3_bit            BANKMASK(ADACT), 3
// ADACT<ACT4>
extern volatile __bit                   ACT4                __at(0x1F7F4);	// @ (0x3EFE * 8 + 4)
#define                                 ACT4_bit            BANKMASK(ADACT), 4
// ADACCL<ADACC0>
extern volatile __bit                   ADACC0              __at(0x1F740);	// @ (0x3EE8 * 8 + 0)
#define                                 ADACC0_bit          BANKMASK(ADACCL), 0
// ADACCL<ADACC1>
extern volatile __bit                   ADACC1              __at(0x1F741);	// @ (0x3EE8 * 8 + 1)
#define                                 ADACC1_bit          BANKMASK(ADACCL), 1
// ADACCH<ADACC10>
extern volatile __bit                   ADACC10             __at(0x1F74A);	// @ (0x3EE9 * 8 + 2)
#define                                 ADACC10_bit         BANKMASK(ADACCH), 2
// ADACCH<ADACC11>
extern volatile __bit                   ADACC11             __at(0x1F74B);	// @ (0x3EE9 * 8 + 3)
#define                                 ADACC11_bit         BANKMASK(ADACCH), 3
// ADACCH<ADACC12>
extern volatile __bit                   ADACC12             __at(0x1F74C);	// @ (0x3EE9 * 8 + 4)
#define                                 ADACC12_bit         BANKMASK(ADACCH), 4
// ADACCH<ADACC13>
extern volatile __bit                   ADACC13             __at(0x1F74D);	// @ (0x3EE9 * 8 + 5)
#define                                 ADACC13_bit         BANKMASK(ADACCH), 5
// ADACCH<ADACC14>
extern volatile __bit                   ADACC14             __at(0x1F74E);	// @ (0x3EE9 * 8 + 6)
#define                                 ADACC14_bit         BANKMASK(ADACCH), 6
// ADACCH<ADACC15>
extern volatile __bit                   ADACC15             __at(0x1F74F);	// @ (0x3EE9 * 8 + 7)
#define                                 ADACC15_bit         BANKMASK(ADACCH), 7
// ADACCU<ADACC16>
extern volatile __bit                   ADACC16             __at(0x1F750);	// @ (0x3EEA * 8 + 0)
#define                                 ADACC16_bit         BANKMASK(ADACCU), 0
// ADACCU<ADACC17>
extern volatile __bit                   ADACC17             __at(0x1F751);	// @ (0x3EEA * 8 + 1)
#define                                 ADACC17_bit         BANKMASK(ADACCU), 1
// ADACCU<ADACC18>
extern volatile __bit                   ADACC18             __at(0x1F752);	// @ (0x3EEA * 8 + 2)
#define                                 ADACC18_bit         BANKMASK(ADACCU), 2
// ADACCU<ADACC19>
extern volatile __bit                   ADACC19             __at(0x1F753);	// @ (0x3EEA * 8 + 3)
#define                                 ADACC19_bit         BANKMASK(ADACCU), 3
// ADACCL<ADACC2>
extern volatile __bit                   ADACC2              __at(0x1F742);	// @ (0x3EE8 * 8 + 2)
#define                                 ADACC2_bit          BANKMASK(ADACCL), 2
// ADACCU<ADACC20>
extern volatile __bit                   ADACC20             __at(0x1F754);	// @ (0x3EEA * 8 + 4)
#define                                 ADACC20_bit         BANKMASK(ADACCU), 4
// ADACCU<ADACC21>
extern volatile __bit                   ADACC21             __at(0x1F755);	// @ (0x3EEA * 8 + 5)
#define                                 ADACC21_bit         BANKMASK(ADACCU), 5
// ADACCU<ADACC22>
extern volatile __bit                   ADACC22             __at(0x1F756);	// @ (0x3EEA * 8 + 6)
#define                                 ADACC22_bit         BANKMASK(ADACCU), 6
// ADACCU<ADACC23>
extern volatile __bit                   ADACC23             __at(0x1F757);	// @ (0x3EEA * 8 + 7)
#define                                 ADACC23_bit         BANKMASK(ADACCU), 7
// ADACCL<ADACC3>
extern volatile __bit                   ADACC3              __at(0x1F743);	// @ (0x3EE8 * 8 + 3)
#define                                 ADACC3_bit          BANKMASK(ADACCL), 3
// ADACCL<ADACC4>
extern volatile __bit                   ADACC4              __at(0x1F744);	// @ (0x3EE8 * 8 + 4)
#define                                 ADACC4_bit          BANKMASK(ADACCL), 4
// ADACCL<ADACC5>
extern volatile __bit                   ADACC5              __at(0x1F745);	// @ (0x3EE8 * 8 + 5)
#define                                 ADACC5_bit          BANKMASK(ADACCL), 5
// ADACCL<ADACC6>
extern volatile __bit                   ADACC6              __at(0x1F746);	// @ (0x3EE8 * 8 + 6)
#define                                 ADACC6_bit          BANKMASK(ADACCL), 6
// ADACCL<ADACC7>
extern volatile __bit                   ADACC7              __at(0x1F747);	// @ (0x3EE8 * 8 + 7)
#define                                 ADACC7_bit          BANKMASK(ADACCL), 7
// ADACCH<ADACC8>
extern volatile __bit                   ADACC8              __at(0x1F748);	// @ (0x3EE9 * 8 + 0)
#define                                 ADACC8_bit          BANKMASK(ADACCH), 0
// ADACCH<ADACC9>
extern volatile __bit                   ADACC9              __at(0x1F749);	// @ (0x3EE9 * 8 + 1)
#define                                 ADACC9_bit          BANKMASK(ADACCH), 1
// ADCON2<ADACLR>
extern volatile __bit                   ADACLR              __at(0x1F7D3);	// @ (0x3EFA * 8 + 3)
#define                                 ADACLR_bit          BANKMASK(ADCON2), 3
// ADACQL<ADACQ0>
extern volatile __bit                   ADACQ0              __at(0x1F798);	// @ (0x3EF3 * 8 + 0)
#define                                 ADACQ0_bit          BANKMASK(ADACQL), 0
// ADACQL<ADACQ1>
extern volatile __bit                   ADACQ1              __at(0x1F799);	// @ (0x3EF3 * 8 + 1)
#define                                 ADACQ1_bit          BANKMASK(ADACQL), 1
// ADACQH<ADACQ10>
extern volatile __bit                   ADACQ10             __at(0x1F7A2);	// @ (0x3EF4 * 8 + 2)
#define                                 ADACQ10_bit         BANKMASK(ADACQH), 2
// ADACQH<ADACQ11>
extern volatile __bit                   ADACQ11             __at(0x1F7A3);	// @ (0x3EF4 * 8 + 3)
#define                                 ADACQ11_bit         BANKMASK(ADACQH), 3
// ADACQH<ADACQ12>
extern volatile __bit                   ADACQ12             __at(0x1F7A4);	// @ (0x3EF4 * 8 + 4)
#define                                 ADACQ12_bit         BANKMASK(ADACQH), 4
// ADACQL<ADACQ2>
extern volatile __bit                   ADACQ2              __at(0x1F79A);	// @ (0x3EF3 * 8 + 2)
#define                                 ADACQ2_bit          BANKMASK(ADACQL), 2
// ADACQL<ADACQ3>
extern volatile __bit                   ADACQ3              __at(0x1F79B);	// @ (0x3EF3 * 8 + 3)
#define                                 ADACQ3_bit          BANKMASK(ADACQL), 3
// ADACQL<ADACQ4>
extern volatile __bit                   ADACQ4              __at(0x1F79C);	// @ (0x3EF3 * 8 + 4)
#define                                 ADACQ4_bit          BANKMASK(ADACQL), 4
// ADACQL<ADACQ5>
