LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   ADACQ5              __at(0x1F79D);	// @ (0x3EF3 * 8 + 5)
#define                                 ADACQ5_bit          BANKMASK(ADACQL), 5
// ADACQL<ADACQ6>
extern volatile __bit                   ADACQ6              __at(0x1F79E);	// @ (0x3EF3 * 8 + 6)
#define                                 ADACQ6_bit          BANKMASK(ADACQL), 6
// ADACQL<ADACQ7>
extern volatile __bit                   ADACQ7              __at(0x1F79F);	// @ (0x3EF3 * 8 + 7)
#define                                 ADACQ7_bit          BANKMASK(ADACQL), 7
// ADACQH<ADACQ8>
extern volatile __bit                   ADACQ8              __at(0x1F7A0);	// @ (0x3EF4 * 8 + 0)
#define                                 ADACQ8_bit          BANKMASK(ADACQH), 0
// ADACQH<ADACQ9>
extern volatile __bit                   ADACQ9              __at(0x1F7A1);	// @ (0x3EF4 * 8 + 1)
#define                                 ADACQ9_bit          BANKMASK(ADACQH), 1
// ADACT<ADACT0>
extern volatile __bit                   ADACT0              __at(0x1F7F0);	// @ (0x3EFE * 8 + 0)
#define                                 ADACT0_bit          BANKMASK(ADACT), 0
// ADACT<ADACT1>
extern volatile __bit                   ADACT1              __at(0x1F7F1);	// @ (0x3EFE * 8 + 1)
#define                                 ADACT1_bit          BANKMASK(ADACT), 1
// ADACT<ADACT2>
extern volatile __bit                   ADACT2              __at(0x1F7F2);	// @ (0x3EFE * 8 + 2)
#define                                 ADACT2_bit          BANKMASK(ADACT), 2
// ADACT<ADACT3>
extern volatile __bit                   ADACT3              __at(0x1F7F3);	// @ (0x3EFE * 8 + 3)
#define                                 ADACT3_bit          BANKMASK(ADACT), 3
// ADACT<ADACT4>
extern volatile __bit                   ADACT4              __at(0x1F7F4);	// @ (0x3EFE * 8 + 4)
#define                                 ADACT4_bit          BANKMASK(ADACT), 4
// ADSTAT<ADAOV>
extern volatile __bit                   ADAOV               __at(0x1F7E7);	// @ (0x3EFC * 8 + 7)
#define                                 ADAOV_bit           BANKMASK(ADSTAT), 7
// ADCON0<ADCAL>
extern volatile __bit                   ADCAL               __at(0x1F7C7);	// @ (0x3EF8 * 8 + 7)
#define                                 ADCAL_bit           BANKMASK(ADCON0), 7
// ADCON3<ADCALC0>
extern volatile __bit                   ADCALC0             __at(0x1F7DC);	// @ (0x3EFB * 8 + 4)
#define                                 ADCALC0_bit         BANKMASK(ADCON3), 4
// ADCON3<ADCALC1>
extern volatile __bit                   ADCALC1             __at(0x1F7DD);	// @ (0x3EFB * 8 + 5)
#define                                 ADCALC1_bit         BANKMASK(ADCON3), 5
// ADCON3<ADCALC2>
extern volatile __bit                   ADCALC2             __at(0x1F7DE);	// @ (0x3EFB * 8 + 6)
#define                                 ADCALC2_bit         BANKMASK(ADCON3), 6
// ADCAP<ADCAP0>
extern volatile __bit                   ADCAP0              __at(0x1F7A8);	// @ (0x3EF5 * 8 + 0)
#define                                 ADCAP0_bit          BANKMASK(ADCAP), 0
// ADCAP<ADCAP1>
extern volatile __bit                   ADCAP1              __at(0x1F7A9);	// @ (0x3EF5 * 8 + 1)
#define                                 ADCAP1_bit          BANKMASK(ADCAP), 1
// ADCAP<ADCAP2>
extern volatile __bit                   ADCAP2              __at(0x1F7AA);	// @ (0x3EF5 * 8 + 2)
#define                                 ADCAP2_bit          BANKMASK(ADCAP), 2
// ADCAP<ADCAP3>
extern volatile __bit                   ADCAP3              __at(0x1F7AB);	// @ (0x3EF5 * 8 + 3)
#define                                 ADCAP3_bit          BANKMASK(ADCAP), 3
// ADCAP<ADCAP4>
extern volatile __bit                   ADCAP4              __at(0x1F7AC);	// @ (0x3EF5 * 8 + 4)
#define                                 ADCAP4_bit          BANKMASK(ADCAP), 4
// PMD2<ADCMD>
extern volatile __bit                   ADCMD               __at(0x1CE15);	// @ (0x39C2 * 8 + 5)
#define                                 ADCMD_bit           BANKMASK(PMD2), 5
// ADCNT<ADCNT0>
extern volatile __bit                   ADCNT0              __at(0x1F758);	// @ (0x3EEB * 8 + 0)
#define                                 ADCNT0_bit          BANKMASK(ADCNT), 0
// ADCNT<ADCNT1>
extern volatile __bit                   ADCNT1              __at(0x1F759);	// @ (0x3EEB * 8 + 1)
#define                                 ADCNT1_bit          BANKMASK(ADCNT), 1
// ADCNT<ADCNT2>
extern volatile __bit                   ADCNT2              __at(0x1F75A);	// @ (0x3EEB * 8 + 2)
#define                                 ADCNT2_bit          BANKMASK(ADCNT), 2
// ADCNT<ADCNT3>
extern volatile __bit                   ADCNT3              __at(0x1F75B);	// @ (0x3EEB * 8 + 3)
#define                                 ADCNT3_bit          BANKMASK(ADCNT), 3
// ADCNT<ADCNT4>
extern volatile __bit                   ADCNT4              __at(0x1F75C);	// @ (0x3EEB * 8 + 4)
#define                                 ADCNT4_bit          BANKMASK(ADCNT), 4
// ADCNT<ADCNT5>
extern volatile __bit                   ADCNT5              __at(0x1F75D);	// @ (0x3EEB * 8 + 5)
#define                                 ADCNT5_bit          BANKMASK(ADCNT), 5
// ADCNT<ADCNT6>
extern volatile __bit                   ADCNT6              __at(0x1F75E);	// @ (0x3EEB * 8 + 6)
#define                                 ADCNT6_bit          BANKMASK(ADCNT), 6
// ADCNT<ADCNT7>
extern volatile __bit                   ADCNT7              __at(0x1F75F);	// @ (0x3EEB * 8 + 7)
#define                                 ADCNT7_bit          BANKMASK(ADCNT), 7
// ADCON0<ADCONT>
extern volatile __bit                   ADCONT              __at(0x1F7C6);	// @ (0x3EF8 * 8 + 6)
#define                                 ADCONT_bit          BANKMASK(ADCON0), 6
// ADCP<ADCPON>
extern volatile __bit                   ADCPON              __at(0x1F6BF);	// @ (0x3ED7 * 8 + 7)
#define                                 ADCPON_bit          BANKMASK(ADCP), 7
// ADCP<ADCPRDY>
extern volatile __bit                   ADCPRDY             __at(0x1F6B8);	// @ (0x3ED7 * 8 + 0)
#define                                 ADCPRDY_bit         BANKMASK(ADCP), 0
// ADCON2<ADCRS0>
extern volatile __bit                   ADCRS0              __at(0x1F7D4);	// @ (0x3EFA * 8 + 4)
#define                                 ADCRS0_bit          BANKMASK(ADCON2), 4
// ADCON2<ADCRS1>
extern volatile __bit                   ADCRS1              __at(0x1F7D5);	// @ (0x3EFA * 8 + 5)
#define                                 ADCRS1_bit          BANKMASK(ADCON2), 5
// ADCON2<ADCRS2>
extern volatile __bit                   ADCRS2              __at(0x1F7D6);	// @ (0x3EFA * 8 + 6)
#define                                 ADCRS2_bit          BANKMASK(ADCON2), 6
// ADCON0<ADCS>
extern volatile __bit                   ADCS                __at(0x1F7C4);	// @ (0x3EF8 * 8 + 4)
#define                                 ADCS_bit            BANKMASK(ADCON0), 4
// ADCLK<ADCS0>
extern volatile __bit                   ADCS0               __at(0x1F7F8);	// @ (0x3EFF * 8 + 0)
#define                                 ADCS0_bit           BANKMASK(ADCLK), 0
// ADCLK<ADCS1>
extern volatile __bit                   ADCS1               __at(0x1F7F9);	// @ (0x3EFF * 8 + 1)
#define                                 ADCS1_bit           BANKMASK(ADCLK), 1
// ADCLK<ADCS2>
extern volatile __bit                   ADCS2               __at(0x1F7FA);	// @ (0x3EFF * 8 + 2)
#define                                 ADCS2_bit           BANKMASK(ADCLK), 2
// ADCLK<ADCS3>
extern volatile __bit                   ADCS3               __at(0x1F7FB);	// @ (0x3EFF * 8 + 3)
#define                                 ADCS3_bit           BANKMASK(ADCLK), 3
// ADCLK<ADCS4>
extern volatile __bit                   ADCS4               __at(0x1F7FC);	// @ (0x3EFF * 8 + 4)
#define                                 ADCS4_bit           BANKMASK(ADCLK), 4
// ADCLK<ADCS5>
extern volatile __bit                   ADCS5               __at(0x1F7FD);	// @ (0x3EFF * 8 + 5)
#define                                 ADCS5_bit           BANKMASK(ADCLK), 5
// ADCON1<ADDSEN>
extern volatile __bit                   ADDSEN              __at(0x1F7C8);	// @ (0x3EF9 * 8 + 0)
#define                                 ADDSEN_bit          BANKMASK(ADCON1), 0
// ADERRL<ADERR0>
extern volatile __bit                   ADERR0              __at(0x1F710);	// @ (0x3EE2 * 8 + 0)
#define                                 ADERR0_bit          BANKMASK(ADERRL), 0
// ADERRL<ADERR1>
extern volatile __bit                   ADERR1              __at(0x1F711);	// @ (0x3EE2 * 8 + 1)
#define                                 ADERR1_bit          BANKMASK(ADERRL), 1
// ADERRH<ADERR10>
extern volatile __bit                   ADERR10             __at(0x1F71A);	// @ (0x3EE3 * 8 + 2)
#define                                 ADERR10_bit         BANKMASK(ADERRH), 2
// ADERRH<ADERR11>
extern volatile __bit                   ADERR11             __at(0x1F71B);	// @ (0x3EE3 * 8 + 3)
#define                                 ADERR11_bit         BANKMASK(ADERRH), 3
// ADERRH<ADERR12>
extern volatile __bit                   ADERR12             __at(0x1F71C);	// @ (0x3EE3 * 8 + 4)
#define                                 ADERR12_bit         BANKMASK(ADERRH), 4
// ADERRH<ADERR13>
extern volatile __bit                   ADERR13             __at(0x1F71D);	// @ (0x3EE3 * 8 + 5)
#define                                 ADERR13_bit         BANKMASK(ADERRH), 5
// ADERRH<ADERR14>
extern volatile __bit                   ADERR14             __at(0x1F71E);	// @ (0x3EE3 * 8 + 6)
#define                                 ADERR14_bit         BANKMASK(ADERRH), 6
// ADERRH<ADERR15>
extern volatile __bit                   ADERR15             __at(0x1F71F);	// @ (0x3EE3 * 8 + 7)
#define                                 ADERR15_bit         BANKMASK(ADERRH), 7
// ADERRL<ADERR2>
extern volatile __bit                   ADERR2              __at(0x1F712);	// @ (0x3EE2 * 8 + 2)
#define                                 ADERR2_bit          BANKMASK(ADERRL), 2
// ADERRL<ADERR3>
extern volatile __bit                   ADERR3              __at(0x1F713);	// @ (0x3EE2 * 8 + 3)
#define                                 ADERR3_bit          BANKMASK(ADERRL), 3
// ADERRL<ADERR4>
extern volatile __bit                   ADERR4              __at(0x1F714);	// @ (0x3EE2 * 8 + 4)
#define                                 ADERR4_bit          BANKMASK(ADERRL), 4
// ADERRL<ADERR5>
extern volatile __bit                   ADERR5              __at(0x1F715);	// @ (0x3EE2 * 8 + 5)
#define                                 ADERR5_bit          BANKMASK(ADERRL), 5
// ADERRL<ADERR6>
extern volatile __bit                   ADERR6              __at(0x1F716);	// @ (0x3EE2 * 8 + 6)
#define                                 ADERR6_bit          BANKMASK(ADERRL), 6
// ADERRL<ADERR7>
extern volatile __bit                   ADERR7              __at(0x1F717);	// @ (0x3EE2 * 8 + 7)
#define                                 ADERR7_bit          BANKMASK(ADERRL), 7
// ADERRH<ADERR8>
extern volatile __bit                   ADERR8              __at(0x1F718);	// @ (0x3EE3 * 8 + 0)
#define                                 ADERR8_bit          BANKMASK(ADERRH), 0
// ADERRH<ADERR9>
extern volatile __bit                   ADERR9              __at(0x1F719);	// @ (0x3EE3 * 8 + 1)
#define                                 ADERR9_bit          BANKMASK(ADERRH), 1
// ADFLTRL<ADFLTR0>
extern volatile __bit                   ADFLTR0             __at(0x1F730);	// @ (0x3EE6 * 8 + 0)
#define                                 ADFLTR0_bit         BANKMASK(ADFLTRL), 0
// ADFLTRL<ADFLTR1>
extern volatile __bit                   ADFLTR1             __at(0x1F731);	// @ (0x3EE6 * 8 + 1)
#define                                 ADFLTR1_bit         BANKMASK(ADFLTRL), 1
// ADFLTRH<ADFLTR10>
extern volatile __bit                   ADFLTR10            __at(0x1F73A);	// @ (0x3EE7 * 8 + 2)
#define                                 ADFLTR10_bit        BANKMASK(ADFLTRH), 2
// ADFLTRH<ADFLTR11>
extern volatile __bit                   ADFLTR11            __at(0x1F73B);	// @ (0x3EE7 * 8 + 3)
#define                                 ADFLTR11_bit        BANKMASK(ADFLTRH), 3
// ADFLTRH<ADFLTR12>
extern volatile __bit                   ADFLTR12            __at(0x1F73C);	// @ (0x3EE7 * 8 + 4)
#define                                 ADFLTR12_bit        BANKMASK(ADFLTRH), 4
// ADFLTRH<ADFLTR13>
extern volatile __bit                   ADFLTR13            __at(0x1F73D);	// @ (0x3EE7 * 8 + 5)
#define                                 ADFLTR13_bit        BANKMASK(ADFLTRH), 5
// ADFLTRH<ADFLTR14>
extern volatile __bit                   ADFLTR14            __at(0x1F73E);	// @ (0x3EE7 * 8 + 6)
#define                                 ADFLTR14_bit        BANKMASK(ADFLTRH), 6
// ADFLTRH<ADFLTR15>
extern volatile __bit                   ADFLTR15            __at(0x1F73F);	// @ (0x3EE7 * 8 + 7)
#define                                 ADFLTR15_bit        BANKMASK(ADFLTRH), 7
// ADFLTRL<ADFLTR2>
extern volatile __bit                   ADFLTR2             __at(0x1F732);	// @ (0x3EE6 * 8 + 2)
#define                                 ADFLTR2_bit         BANKMASK(ADFLTRL), 2
// ADFLTRL<ADFLTR3>
extern volatile __bit                   ADFLTR3             __at(0x1F733);	// @ (0x3EE6 * 8 + 3)
#define                                 ADFLTR3_bit         BANKMASK(ADFLTRL), 3
// ADFLTRL<ADFLTR4>
extern volatile __bit                   ADFLTR4             __at(0x1F734);	// @ (0x3EE6 * 8 + 4)
#define                                 ADFLTR4_bit         BANKMASK(ADFLTRL), 4
// ADFLTRL<ADFLTR5>
extern volatile __bit                   ADFLTR5             __at(0x1F735);	// @ (0x3EE6 * 8 + 5)
#define                                 ADFLTR5_bit         BANKMASK(ADFLTRL), 5
// ADFLTRL<ADFLTR6>
extern volatile __bit                   ADFLTR6             __at(0x1F736);	// @ (0x3EE6 * 8 + 6)
#define                                 ADFLTR6_bit         BANKMASK(ADFLTRL), 6
// ADFLTRL<ADFLTR7>
extern volatile __bit                   ADFLTR7             __at(0x1F737);	// @ (0x3EE6 * 8 + 7)
#define                                 ADFLTR7_bit         BANKMASK(ADFLTRL), 7
// ADFLTRH<ADFLTR8>
extern volatile __bit                   ADFLTR8             __at(0x1F738);	// @ (0x3EE7 * 8 + 0)
#define                                 ADFLTR8_bit         BANKMASK(ADFLTRH), 0
// ADFLTRH<ADFLTR9>
extern volatile __bit                   ADFLTR9             __at(0x1F739);	// @ (0x3EE7 * 8 + 1)
#define                                 ADFLTR9_bit         BANKMASK(ADFLTRH), 1
// ADCON0<ADFM0>
extern volatile __bit                   ADFM0               __at(0x1F7C2);	// @ (0x3EF8 * 8 + 2)
#define                                 ADFM0_bit           BANKMASK(ADCON0), 2
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0x1F608);	// @ (0x3EC1 * 8 + 0)
#define                                 ADFVR0_bit          BANKMASK(FVRCON), 0
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0x1F609);	// @ (0x3EC1 * 8 + 1)
#define                                 ADFVR1_bit          BANKMASK(FVRCON), 1
// ADCON0<ADGO>
extern volatile __bit                   ADGO                __at(0x1F7C0);	// @ (0x3EF8 * 8 + 0)
#define                                 ADGO_bit            BANKMASK(ADCON0), 0
// ADCON1<ADGPOL>
extern volatile __bit                   ADGPOL              __at(0x1F7CD);	// @ (0x3EF9 * 8 + 5)
#define                                 ADGPOL_bit          BANKMASK(ADCON1), 5
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x1CC8A);	// @ (0x3991 * 8 + 2)
#define                                 ADIE_bit            BANKMASK(PIE1), 2
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x1CD0A);	// @ (0x39A1 * 8 + 2)
#define                                 ADIF_bit            BANKMASK(PIR1), 2
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x1CC0A);	// @ (0x3981 * 8 + 2)
#define                                 ADIP_bit            BANKMASK(IPR1), 2
// ADCON1<ADIPEN>
extern volatile __bit                   ADIPEN              __at(0x1F7CE);	// @ (0x3EF9 * 8 + 6)
#define                                 ADIPEN_bit          BANKMASK(ADCON1), 6
// ADLTHL<ADLTH0>
extern volatile __bit                   ADLTH0              __at(0x1F6F0);	// @ (0x3EDE * 8 + 0)
#define                                 ADLTH0_bit          BANKMASK(ADLTHL), 0
// ADLTHL<ADLTH1>
extern volatile __bit                   ADLTH1              __at(0x1F6F1);	// @ (0x3EDE * 8 + 1)
#define                                 ADLTH1_bit          BANKMASK(ADLTHL), 1
// ADLTHH<ADLTH10>
extern volatile __bit                   ADLTH10             __at(0x1F6FA);	// @ (0x3EDF * 8 + 2)
#define                                 ADLTH10_bit         BANKMASK(ADLTHH), 2
// ADLTHH<ADLTH11>
extern volatile __bit                   ADLTH11             __at(0x1F6FB);	// @ (0x3EDF * 8 + 3)
#define                                 ADLTH11_bit         BANKMASK(ADLTHH), 3
// ADLTHH<ADLTH12>
extern volatile __bit                   ADLTH12             __at(0x1F6FC);	// @ (0x3EDF * 8 + 4)
#define                                 ADLTH12_bit         BANKMASK(ADLTHH), 4
// ADLTHH<ADLTH13>
extern volatile __bit                   ADLTH13             __at(0x1F6FD);	// @ (0x3EDF * 8 + 5)
#define                                 ADLTH13_bit         BANKMASK(ADLTHH), 5
// ADLTHH<ADLTH14>
extern volatile __bit                   ADLTH14             __at(0x1F6FE);	// @ (0x3EDF * 8 + 6)
#define                                 ADLTH14_bit         BANKMASK(ADLTHH), 6
// ADLTHH<ADLTH15>
extern volatile __bit                   ADLTH15             __at(0x1F6FF);	// @ (0x3EDF * 8 + 7)
#define                                 ADLTH15_bit         BANKMASK(ADLTHH), 7
// ADLTHL<ADLTH2>
extern volatile __bit                   ADLTH2              __at(0x1F6F2);	// @ (0x3EDE * 8 + 2)
#define                                 ADLTH2_bit          BANKMASK(ADLTHL), 2
// ADLTHL<ADLTH3>
extern volatile __bit                   ADLTH3              __at(0x1F6F3);	// @ (0x3EDE * 8 + 3)
#define                                 ADLTH3_bit          BANKMASK(ADLTHL), 3
// ADLTHL<ADLTH4>
extern volatile __bit                   ADLTH4              __at(0x1F6F4);	// @ (0x3EDE * 8 + 4)
#define                                 ADLTH4_bit          BANKMASK(ADLTHL), 4
// ADLTHL<ADLTH5>
extern volatile __bit                   ADLTH5              __at(0x1F6F5);	// @ (0x3EDE * 8 + 5)
#define                                 ADLTH5_bit          BANKMASK(ADLTHL), 5
// ADLTHL<ADLTH6>
extern volatile __bit                   ADLTH6              __at(0x1F6F6);	// @ (0x3EDE * 8 + 6)
#define                                 ADLTH6_bit          BANKMASK(ADLTHL), 6
// ADLTHL<ADLTH7>
extern volatile __bit                   ADLTH7              __at(0x1F6F7);	// @ (0x3EDE * 8 + 7)
#define                                 ADLTH7_bit          BANKMASK(ADLTHL), 7
// ADLTHH<ADLTH8>
extern volatile __bit                   ADLTH8              __at(0x1F6F8);	// @ (0x3EDF * 8 + 0)
#define                                 ADLTH8_bit          BANKMASK(ADLTHH), 0
// ADLTHH<ADLTH9>
extern volatile __bit                   ADLTH9              __at(0x1F6F9);	// @ (0x3EDF * 8 + 1)
#define                                 ADLTH9_bit          BANKMASK(ADLTHH), 1
// ADSTAT<ADLTHR>
extern volatile __bit                   ADLTHR              __at(0x1F7E5);	// @ (0x3EFC * 8 + 5)
#define                                 ADLTHR_bit          BANKMASK(ADSTAT), 5
// ADSTAT<ADMATH>
extern volatile __bit                   ADMATH              __at(0x1F7E4);	// @ (0x3EFC * 8 + 4)
#define                                 ADMATH_bit          BANKMASK(ADSTAT), 4
// ADCON2<ADMD0>
extern volatile __bit                   ADMD0               __at(0x1F7D0);	// @ (0x3EFA * 8 + 0)
#define                                 ADMD0_bit           BANKMASK(ADCON2), 0
// ADCON2<ADMD1>
extern volatile __bit                   ADMD1               __at(0x1F7D1);	// @ (0x3EFA * 8 + 1)
#define                                 ADMD1_bit           BANKMASK(ADCON2), 1
// ADCON2<ADMD2>
extern volatile __bit                   ADMD2               __at(0x1F7D2);	// @ (0x3EFA * 8 + 2)
#define                                 ADMD2_bit           BANKMASK(ADCON2), 2
// ADREF<ADNREF0>
extern volatile __bit                   ADNREF0             __at(0x1F7EC);	// @ (0x3EFD * 8 + 4)
#define                                 ADNREF0_bit         BANKMASK(ADREF), 4
// OSCEN<ADOEN>
extern volatile __bit                   ADOEN               __at(0x1CEEA);	// @ (0x39DD * 8 + 2)
#define                                 ADOEN_bit           BANKMASK(OSCEN), 2
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x1F7C7);	// @ (0x3EF8 * 8 + 7)
#define                                 ADON_bit            BANKMASK(ADCON0), 7
// OSCSTAT<ADOR>
extern volatile __bit                   ADOR                __at(0x1CEE2);	// @ (0x39DC * 8 + 2)
#define                                 ADOR_bit            BANKMASK(OSCSTAT), 2
// ADSTAT<ADOV>
extern volatile __bit                   ADOV                __at(0x1F7E7);	// @ (0x3EFC * 8 + 7)
#define                                 ADOV_bit            BANKMASK(ADSTAT), 7
// ADPCH<ADPCH0>
extern volatile __bit                   ADPCH0              __at(0x1F788);	// @ (0x3EF1 * 8 + 0)
#define                                 ADPCH0_bit          BANKMASK(ADPCH), 0
// ADPCH<ADPCH1>
extern volatile __bit                   ADPCH1              __at(0x1F789);	// @ (0x3EF1 * 8 + 1)
#define                                 ADPCH1_bit          BANKMASK(ADPCH), 1
// ADPCH<ADPCH2>
extern volatile __bit                   ADPCH2              __at(0x1F78A);	// @ (0x3EF1 * 8 + 2)
#define                                 ADPCH2_bit          BANKMASK(ADPCH), 2
// ADPCH<ADPCH3>
extern volatile __bit                   ADPCH3              __at(0x1F78B);	// @ (0x3EF1 * 8 + 3)
#define                                 ADPCH3_bit          BANKMASK(ADPCH), 3
// ADPCH<ADPCH4>
extern volatile __bit                   ADPCH4              __at(0x1F78C);	// @ (0x3EF1 * 8 + 4)
#define                                 ADPCH4_bit          BANKMASK(ADPCH), 4
// ADPCH<ADPCH5>
extern volatile __bit                   ADPCH5              __at(0x1F78D);	// @ (0x3EF1 * 8 + 5)
#define                                 ADPCH5_bit          BANKMASK(ADPCH), 5
// ADCON1<ADPPOL>
extern volatile __bit                   ADPPOL              __at(0x1F7CF);	// @ (0x3EF9 * 8 + 7)
#define                                 ADPPOL_bit          BANKMASK(ADCON1), 7
// ADPREL<ADPRE0>
extern volatile __bit                   ADPRE0              __at(0x1F7B0);	// @ (0x3EF6 * 8 + 0)
#define                                 ADPRE0_bit          BANKMASK(ADPREL), 0
// ADPREL<ADPRE1>
extern volatile __bit                   ADPRE1              __at(0x1F7B1);	// @ (0x3EF6 * 8 + 1)
#define                                 ADPRE1_bit          BANKMASK(ADPREL), 1
// ADPREH<ADPRE10>
extern volatile __bit                   ADPRE10             __at(0x1F7BA);	// @ (0x3EF7 * 8 + 2)
#define                                 ADPRE10_bit         BANKMASK(ADPREH), 2
// ADPREH<ADPRE11>
extern volatile __bit                   ADPRE11             __at(0x1F7BB);	// @ (0x3EF7 * 8 + 3)
#define                                 ADPRE11_bit         BANKMASK(ADPREH), 3
// ADPREH<ADPRE12>
extern volatile __bit                   ADPRE12             __at(0x1F7BC);	// @ (0x3EF7 * 8 + 4)
#define                                 ADPRE12_bit         BANKMASK(ADPREH), 4
// ADPREL<ADPRE2>
extern volatile __bit                   ADPRE2              __at(0x1F7B2);	// @ (0x3EF6 * 8 + 2)
#define                                 ADPRE2_bit          BANKMASK(ADPREL), 2
// ADPREL<ADPRE3>
