LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   ADPRE3              __at(0x1F7B3);	// @ (0x3EF6 * 8 + 3)
#define                                 ADPRE3_bit          BANKMASK(ADPREL), 3
// ADPREL<ADPRE4>
extern volatile __bit                   ADPRE4              __at(0x1F7B4);	// @ (0x3EF6 * 8 + 4)
#define                                 ADPRE4_bit          BANKMASK(ADPREL), 4
// ADPREL<ADPRE5>
extern volatile __bit                   ADPRE5              __at(0x1F7B5);	// @ (0x3EF6 * 8 + 5)
#define                                 ADPRE5_bit          BANKMASK(ADPREL), 5
// ADPREL<ADPRE6>
extern volatile __bit                   ADPRE6              __at(0x1F7B6);	// @ (0x3EF6 * 8 + 6)
#define                                 ADPRE6_bit          BANKMASK(ADPREL), 6
// ADPREL<ADPRE7>
extern volatile __bit                   ADPRE7              __at(0x1F7B7);	// @ (0x3EF6 * 8 + 7)
#define                                 ADPRE7_bit          BANKMASK(ADPREL), 7
// ADPREH<ADPRE8>
extern volatile __bit                   ADPRE8              __at(0x1F7B8);	// @ (0x3EF7 * 8 + 0)
#define                                 ADPRE8_bit          BANKMASK(ADPREH), 0
// ADPREH<ADPRE9>
extern volatile __bit                   ADPRE9              __at(0x1F7B9);	// @ (0x3EF7 * 8 + 1)
#define                                 ADPRE9_bit          BANKMASK(ADPREH), 1
// ADREF<ADPREF0>
extern volatile __bit                   ADPREF0             __at(0x1F7E8);	// @ (0x3EFD * 8 + 0)
#define                                 ADPREF0_bit         BANKMASK(ADREF), 0
// ADREF<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x1F7E9);	// @ (0x3EFD * 8 + 1)
#define                                 ADPREF1_bit         BANKMASK(ADREF), 1
// ADPREVL<ADPREV0>
extern volatile __bit                   ADPREV0             __at(0x1F768);	// @ (0x3EED * 8 + 0)
#define                                 ADPREV0_bit         BANKMASK(ADPREVL), 0
// ADPREVL<ADPREV1>
extern volatile __bit                   ADPREV1             __at(0x1F769);	// @ (0x3EED * 8 + 1)
#define                                 ADPREV1_bit         BANKMASK(ADPREVL), 1
// ADPREVH<ADPREV10>
extern volatile __bit                   ADPREV10            __at(0x1F772);	// @ (0x3EEE * 8 + 2)
#define                                 ADPREV10_bit        BANKMASK(ADPREVH), 2
// ADPREVH<ADPREV11>
extern volatile __bit                   ADPREV11            __at(0x1F773);	// @ (0x3EEE * 8 + 3)
#define                                 ADPREV11_bit        BANKMASK(ADPREVH), 3
// ADPREVH<ADPREV12>
extern volatile __bit                   ADPREV12            __at(0x1F774);	// @ (0x3EEE * 8 + 4)
#define                                 ADPREV12_bit        BANKMASK(ADPREVH), 4
// ADPREVH<ADPREV13>
extern volatile __bit                   ADPREV13            __at(0x1F775);	// @ (0x3EEE * 8 + 5)
#define                                 ADPREV13_bit        BANKMASK(ADPREVH), 5
// ADPREVH<ADPREV14>
extern volatile __bit                   ADPREV14            __at(0x1F776);	// @ (0x3EEE * 8 + 6)
#define                                 ADPREV14_bit        BANKMASK(ADPREVH), 6
// ADPREVH<ADPREV15>
extern volatile __bit                   ADPREV15            __at(0x1F777);	// @ (0x3EEE * 8 + 7)
#define                                 ADPREV15_bit        BANKMASK(ADPREVH), 7
// ADPREVL<ADPREV2>
extern volatile __bit                   ADPREV2             __at(0x1F76A);	// @ (0x3EED * 8 + 2)
#define                                 ADPREV2_bit         BANKMASK(ADPREVL), 2
// ADPREVL<ADPREV3>
extern volatile __bit                   ADPREV3             __at(0x1F76B);	// @ (0x3EED * 8 + 3)
#define                                 ADPREV3_bit         BANKMASK(ADPREVL), 3
// ADPREVL<ADPREV4>
extern volatile __bit                   ADPREV4             __at(0x1F76C);	// @ (0x3EED * 8 + 4)
#define                                 ADPREV4_bit         BANKMASK(ADPREVL), 4
// ADPREVL<ADPREV5>
extern volatile __bit                   ADPREV5             __at(0x1F76D);	// @ (0x3EED * 8 + 5)
#define                                 ADPREV5_bit         BANKMASK(ADPREVL), 5
// ADPREVL<ADPREV6>
extern volatile __bit                   ADPREV6             __at(0x1F76E);	// @ (0x3EED * 8 + 6)
#define                                 ADPREV6_bit         BANKMASK(ADPREVL), 6
// ADPREVL<ADPREV7>
extern volatile __bit                   ADPREV7             __at(0x1F76F);	// @ (0x3EED * 8 + 7)
#define                                 ADPREV7_bit         BANKMASK(ADPREVL), 7
// ADPREVH<ADPREV8>
extern volatile __bit                   ADPREV8             __at(0x1F770);	// @ (0x3EEE * 8 + 0)
#define                                 ADPREV8_bit         BANKMASK(ADPREVH), 0
// ADPREVH<ADPREV9>
extern volatile __bit                   ADPREV9             __at(0x1F771);	// @ (0x3EEE * 8 + 1)
#define                                 ADPREV9_bit         BANKMASK(ADPREVH), 1
// ADCON2<ADPSIS>
extern volatile __bit                   ADPSIS              __at(0x1F7D7);	// @ (0x3EFA * 8 + 7)
#define                                 ADPSIS_bit          BANKMASK(ADCON2), 7
// NVMADRL<ADR0>
extern volatile __bit                   ADR0                __at(0x1CF00);	// @ (0x39E0 * 8 + 0)
#define                                 ADR0_bit            BANKMASK(NVMADRL), 0
// NVMADRL<ADR1>
extern volatile __bit                   ADR1                __at(0x1CF01);	// @ (0x39E0 * 8 + 1)
#define                                 ADR1_bit            BANKMASK(NVMADRL), 1
// I2C1PIE<ADR1IE>
extern volatile __bit                   ADR1IE              __at(0x1EBD3);	// @ (0x3D7A * 8 + 3)
#define                                 ADR1IE_bit          BANKMASK(I2C1PIE), 3
// I2C1PIR<ADR1IF>
extern volatile __bit                   ADR1IF              __at(0x1EBCB);	// @ (0x3D79 * 8 + 3)
#define                                 ADR1IF_bit          BANKMASK(I2C1PIR), 3
// NVMADRL<ADR2>
extern volatile __bit                   ADR2                __at(0x1CF02);	// @ (0x39E0 * 8 + 2)
#define                                 ADR2_bit            BANKMASK(NVMADRL), 2
// I2C2PIE<ADR2IE>
extern volatile __bit                   ADR2IE              __at(0x1EB23);	// @ (0x3D64 * 8 + 3)
#define                                 ADR2IE_bit          BANKMASK(I2C2PIE), 3
// I2C2PIR<ADR2IF>
extern volatile __bit                   ADR2IF              __at(0x1EB1B);	// @ (0x3D63 * 8 + 3)
#define                                 ADR2IF_bit          BANKMASK(I2C2PIR), 3
// NVMADRL<ADR3>
extern volatile __bit                   ADR3                __at(0x1CF03);	// @ (0x39E0 * 8 + 3)
#define                                 ADR3_bit            BANKMASK(NVMADRL), 3
// NVMADRL<ADR4>
extern volatile __bit                   ADR4                __at(0x1CF04);	// @ (0x39E0 * 8 + 4)
#define                                 ADR4_bit            BANKMASK(NVMADRL), 4
// NVMADRL<ADR5>
extern volatile __bit                   ADR5                __at(0x1CF05);	// @ (0x39E0 * 8 + 5)
#define                                 ADR5_bit            BANKMASK(NVMADRL), 5
// NVMADRL<ADR6>
extern volatile __bit                   ADR6                __at(0x1CF06);	// @ (0x39E0 * 8 + 6)
#define                                 ADR6_bit            BANKMASK(NVMADRL), 6
// NVMADRL<ADR7>
extern volatile __bit                   ADR7                __at(0x1CF07);	// @ (0x39E0 * 8 + 7)
#define                                 ADR7_bit            BANKMASK(NVMADRL), 7
// NVMADRH<ADR8>
extern volatile __bit                   ADR8                __at(0x1CF08);	// @ (0x39E1 * 8 + 0)
#define                                 ADR8_bit            BANKMASK(NVMADRH), 0
// NVMADRH<ADR9>
extern volatile __bit                   ADR9                __at(0x1CF09);	// @ (0x39E1 * 8 + 1)
#define                                 ADR9_bit            BANKMASK(NVMADRH), 1
// ADRESL<ADRES0>
extern volatile __bit                   ADRES0              __at(0x1F778);	// @ (0x3EEF * 8 + 0)
#define                                 ADRES0_bit          BANKMASK(ADRESL), 0
// ADRESL<ADRES1>
extern volatile __bit                   ADRES1              __at(0x1F779);	// @ (0x3EEF * 8 + 1)
#define                                 ADRES1_bit          BANKMASK(ADRESL), 1
// ADRESH<ADRES10>
extern volatile __bit                   ADRES10             __at(0x1F782);	// @ (0x3EF0 * 8 + 2)
#define                                 ADRES10_bit         BANKMASK(ADRESH), 2
// ADRESH<ADRES11>
extern volatile __bit                   ADRES11             __at(0x1F783);	// @ (0x3EF0 * 8 + 3)
#define                                 ADRES11_bit         BANKMASK(ADRESH), 3
// ADRESH<ADRES12>
extern volatile __bit                   ADRES12             __at(0x1F784);	// @ (0x3EF0 * 8 + 4)
#define                                 ADRES12_bit         BANKMASK(ADRESH), 4
// ADRESH<ADRES13>
extern volatile __bit                   ADRES13             __at(0x1F785);	// @ (0x3EF0 * 8 + 5)
#define                                 ADRES13_bit         BANKMASK(ADRESH), 5
// ADRESH<ADRES14>
extern volatile __bit                   ADRES14             __at(0x1F786);	// @ (0x3EF0 * 8 + 6)
#define                                 ADRES14_bit         BANKMASK(ADRESH), 6
// ADRESH<ADRES15>
extern volatile __bit                   ADRES15             __at(0x1F787);	// @ (0x3EF0 * 8 + 7)
#define                                 ADRES15_bit         BANKMASK(ADRESH), 7
// ADRESL<ADRES2>
extern volatile __bit                   ADRES2              __at(0x1F77A);	// @ (0x3EEF * 8 + 2)
#define                                 ADRES2_bit          BANKMASK(ADRESL), 2
// ADRESL<ADRES3>
extern volatile __bit                   ADRES3              __at(0x1F77B);	// @ (0x3EEF * 8 + 3)
#define                                 ADRES3_bit          BANKMASK(ADRESL), 3
// ADRESL<ADRES4>
extern volatile __bit                   ADRES4              __at(0x1F77C);	// @ (0x3EEF * 8 + 4)
#define                                 ADRES4_bit          BANKMASK(ADRESL), 4
// ADRESL<ADRES5>
extern volatile __bit                   ADRES5              __at(0x1F77D);	// @ (0x3EEF * 8 + 5)
#define                                 ADRES5_bit          BANKMASK(ADRESL), 5
// ADRESL<ADRES6>
extern volatile __bit                   ADRES6              __at(0x1F77E);	// @ (0x3EEF * 8 + 6)
#define                                 ADRES6_bit          BANKMASK(ADRESL), 6
// ADRESL<ADRES7>
extern volatile __bit                   ADRES7              __at(0x1F77F);	// @ (0x3EEF * 8 + 7)
#define                                 ADRES7_bit          BANKMASK(ADRESL), 7
// ADRESH<ADRES8>
extern volatile __bit                   ADRES8              __at(0x1F780);	// @ (0x3EF0 * 8 + 0)
#define                                 ADRES8_bit          BANKMASK(ADRESH), 0
// ADRESH<ADRES9>
extern volatile __bit                   ADRES9              __at(0x1F781);	// @ (0x3EF0 * 8 + 1)
#define                                 ADRES9_bit          BANKMASK(ADRESH), 1
// ADRPT<ADRPT0>
extern volatile __bit                   ADRPT0              __at(0x1F760);	// @ (0x3EEC * 8 + 0)
#define                                 ADRPT0_bit          BANKMASK(ADRPT), 0
// ADRPT<ADRPT1>
extern volatile __bit                   ADRPT1              __at(0x1F761);	// @ (0x3EEC * 8 + 1)
#define                                 ADRPT1_bit          BANKMASK(ADRPT), 1
// ADRPT<ADRPT2>
extern volatile __bit                   ADRPT2              __at(0x1F762);	// @ (0x3EEC * 8 + 2)
#define                                 ADRPT2_bit          BANKMASK(ADRPT), 2
// ADRPT<ADRPT3>
extern volatile __bit                   ADRPT3              __at(0x1F763);	// @ (0x3EEC * 8 + 3)
#define                                 ADRPT3_bit          BANKMASK(ADRPT), 3
// ADRPT<ADRPT4>
extern volatile __bit                   ADRPT4              __at(0x1F764);	// @ (0x3EEC * 8 + 4)
#define                                 ADRPT4_bit          BANKMASK(ADRPT), 4
// ADRPT<ADRPT5>
extern volatile __bit                   ADRPT5              __at(0x1F765);	// @ (0x3EEC * 8 + 5)
#define                                 ADRPT5_bit          BANKMASK(ADRPT), 5
// ADRPT<ADRPT6>
extern volatile __bit                   ADRPT6              __at(0x1F766);	// @ (0x3EEC * 8 + 6)
#define                                 ADRPT6_bit          BANKMASK(ADRPT), 6
// ADRPT<ADRPT7>
extern volatile __bit                   ADRPT7              __at(0x1F767);	// @ (0x3EEC * 8 + 7)
#define                                 ADRPT7_bit          BANKMASK(ADRPT), 7
// ADCON3<ADSOI>
extern volatile __bit                   ADSOI               __at(0x1F7DB);	// @ (0x3EFB * 8 + 3)
#define                                 ADSOI_bit           BANKMASK(ADCON3), 3
// ADSTAT<ADSTAT0>
extern volatile __bit                   ADSTAT0             __at(0x1F7E0);	// @ (0x3EFC * 8 + 0)
#define                                 ADSTAT0_bit         BANKMASK(ADSTAT), 0
// ADSTAT<ADSTAT1>
extern volatile __bit                   ADSTAT1             __at(0x1F7E1);	// @ (0x3EFC * 8 + 1)
#define                                 ADSTAT1_bit         BANKMASK(ADSTAT), 1
// ADSTAT<ADSTAT2>
extern volatile __bit                   ADSTAT2             __at(0x1F7E2);	// @ (0x3EFC * 8 + 2)
#define                                 ADSTAT2_bit         BANKMASK(ADSTAT), 2
// ADSTPTL<ADSTPT0>
extern volatile __bit                   ADSTPT0             __at(0x1F720);	// @ (0x3EE4 * 8 + 0)
#define                                 ADSTPT0_bit         BANKMASK(ADSTPTL), 0
// ADSTPTL<ADSTPT1>
extern volatile __bit                   ADSTPT1             __at(0x1F721);	// @ (0x3EE4 * 8 + 1)
#define                                 ADSTPT1_bit         BANKMASK(ADSTPTL), 1
// ADSTPTH<ADSTPT10>
extern volatile __bit                   ADSTPT10            __at(0x1F72A);	// @ (0x3EE5 * 8 + 2)
#define                                 ADSTPT10_bit        BANKMASK(ADSTPTH), 2
// ADSTPTH<ADSTPT11>
extern volatile __bit                   ADSTPT11            __at(0x1F72B);	// @ (0x3EE5 * 8 + 3)
#define                                 ADSTPT11_bit        BANKMASK(ADSTPTH), 3
// ADSTPTH<ADSTPT12>
extern volatile __bit                   ADSTPT12            __at(0x1F72C);	// @ (0x3EE5 * 8 + 4)
#define                                 ADSTPT12_bit        BANKMASK(ADSTPTH), 4
// ADSTPTH<ADSTPT13>
extern volatile __bit                   ADSTPT13            __at(0x1F72D);	// @ (0x3EE5 * 8 + 5)
#define                                 ADSTPT13_bit        BANKMASK(ADSTPTH), 5
// ADSTPTH<ADSTPT14>
extern volatile __bit                   ADSTPT14            __at(0x1F72E);	// @ (0x3EE5 * 8 + 6)
#define                                 ADSTPT14_bit        BANKMASK(ADSTPTH), 6
// ADSTPTH<ADSTPT15>
extern volatile __bit                   ADSTPT15            __at(0x1F72F);	// @ (0x3EE5 * 8 + 7)
#define                                 ADSTPT15_bit        BANKMASK(ADSTPTH), 7
// ADSTPTL<ADSTPT2>
extern volatile __bit                   ADSTPT2             __at(0x1F722);	// @ (0x3EE4 * 8 + 2)
#define                                 ADSTPT2_bit         BANKMASK(ADSTPTL), 2
// ADSTPTL<ADSTPT3>
extern volatile __bit                   ADSTPT3             __at(0x1F723);	// @ (0x3EE4 * 8 + 3)
#define                                 ADSTPT3_bit         BANKMASK(ADSTPTL), 3
// ADSTPTL<ADSTPT4>
extern volatile __bit                   ADSTPT4             __at(0x1F724);	// @ (0x3EE4 * 8 + 4)
#define                                 ADSTPT4_bit         BANKMASK(ADSTPTL), 4
// ADSTPTL<ADSTPT5>
extern volatile __bit                   ADSTPT5             __at(0x1F725);	// @ (0x3EE4 * 8 + 5)
#define                                 ADSTPT5_bit         BANKMASK(ADSTPTL), 5
// ADSTPTL<ADSTPT6>
extern volatile __bit                   ADSTPT6             __at(0x1F726);	// @ (0x3EE4 * 8 + 6)
#define                                 ADSTPT6_bit         BANKMASK(ADSTPTL), 6
// ADSTPTL<ADSTPT7>
extern volatile __bit                   ADSTPT7             __at(0x1F727);	// @ (0x3EE4 * 8 + 7)
#define                                 ADSTPT7_bit         BANKMASK(ADSTPTL), 7
// ADSTPTH<ADSTPT8>
extern volatile __bit                   ADSTPT8             __at(0x1F728);	// @ (0x3EE5 * 8 + 0)
#define                                 ADSTPT8_bit         BANKMASK(ADSTPTH), 0
// ADSTPTH<ADSTPT9>
extern volatile __bit                   ADSTPT9             __at(0x1F729);	// @ (0x3EE5 * 8 + 1)
#define                                 ADSTPT9_bit         BANKMASK(ADSTPTH), 1
// PIE1<ADTIE>
extern volatile __bit                   ADTIE               __at(0x1CC8B);	// @ (0x3991 * 8 + 3)
#define                                 ADTIE_bit           BANKMASK(PIE1), 3
// PIR1<ADTIF>
extern volatile __bit                   ADTIF               __at(0x1CD0B);	// @ (0x39A1 * 8 + 3)
#define                                 ADTIF_bit           BANKMASK(PIR1), 3
// IPR1<ADTIP>
extern volatile __bit                   ADTIP               __at(0x1CC0B);	// @ (0x3981 * 8 + 3)
#define                                 ADTIP_bit           BANKMASK(IPR1), 3
// ADCON3<ADTMD0>
extern volatile __bit                   ADTMD0              __at(0x1F7D8);	// @ (0x3EFB * 8 + 0)
#define                                 ADTMD0_bit          BANKMASK(ADCON3), 0
// ADCON3<ADTMD1>
extern volatile __bit                   ADTMD1              __at(0x1F7D9);	// @ (0x3EFB * 8 + 1)
#define                                 ADTMD1_bit          BANKMASK(ADCON3), 1
// ADCON3<ADTMD2>
extern volatile __bit                   ADTMD2              __at(0x1F7DA);	// @ (0x3EFB * 8 + 2)
#define                                 ADTMD2_bit          BANKMASK(ADCON3), 2
// ADUTHL<ADUTH0>
extern volatile __bit                   ADUTH0              __at(0x1F700);	// @ (0x3EE0 * 8 + 0)
#define                                 ADUTH0_bit          BANKMASK(ADUTHL), 0
// ADUTHL<ADUTH1>
extern volatile __bit                   ADUTH1              __at(0x1F701);	// @ (0x3EE0 * 8 + 1)
#define                                 ADUTH1_bit          BANKMASK(ADUTHL), 1
// ADUTHH<ADUTH10>
extern volatile __bit                   ADUTH10             __at(0x1F70A);	// @ (0x3EE1 * 8 + 2)
#define                                 ADUTH10_bit         BANKMASK(ADUTHH), 2
// ADUTHH<ADUTH11>
extern volatile __bit                   ADUTH11             __at(0x1F70B);	// @ (0x3EE1 * 8 + 3)
#define                                 ADUTH11_bit         BANKMASK(ADUTHH), 3
// ADUTHH<ADUTH12>
extern volatile __bit                   ADUTH12             __at(0x1F70C);	// @ (0x3EE1 * 8 + 4)
#define                                 ADUTH12_bit         BANKMASK(ADUTHH), 4
// ADUTHH<ADUTH13>
extern volatile __bit                   ADUTH13             __at(0x1F70D);	// @ (0x3EE1 * 8 + 5)
#define                                 ADUTH13_bit         BANKMASK(ADUTHH), 5
// ADUTHH<ADUTH14>
extern volatile __bit                   ADUTH14             __at(0x1F70E);	// @ (0x3EE1 * 8 + 6)
#define                                 ADUTH14_bit         BANKMASK(ADUTHH), 6
// ADUTHH<ADUTH15>
extern volatile __bit                   ADUTH15             __at(0x1F70F);	// @ (0x3EE1 * 8 + 7)
#define                                 ADUTH15_bit         BANKMASK(ADUTHH), 7
// ADUTHL<ADUTH2>
extern volatile __bit                   ADUTH2              __at(0x1F702);	// @ (0x3EE0 * 8 + 2)
#define                                 ADUTH2_bit          BANKMASK(ADUTHL), 2
// ADUTHL<ADUTH3>
extern volatile __bit                   ADUTH3              __at(0x1F703);	// @ (0x3EE0 * 8 + 3)
#define                                 ADUTH3_bit          BANKMASK(ADUTHL), 3
// ADUTHL<ADUTH4>
extern volatile __bit                   ADUTH4              __at(0x1F704);	// @ (0x3EE0 * 8 + 4)
#define                                 ADUTH4_bit          BANKMASK(ADUTHL), 4
// ADUTHL<ADUTH5>
extern volatile __bit                   ADUTH5              __at(0x1F705);	// @ (0x3EE0 * 8 + 5)
#define                                 ADUTH5_bit          BANKMASK(ADUTHL), 5
// ADUTHL<ADUTH6>
extern volatile __bit                   ADUTH6              __at(0x1F706);	// @ (0x3EE0 * 8 + 6)
#define                                 ADUTH6_bit          BANKMASK(ADUTHL), 6
// ADUTHL<ADUTH7>
extern volatile __bit                   ADUTH7              __at(0x1F707);	// @ (0x3EE0 * 8 + 7)
#define                                 ADUTH7_bit          BANKMASK(ADUTHL), 7
// ADUTHH<ADUTH8>
extern volatile __bit                   ADUTH8              __at(0x1F708);	// @ (0x3EE1 * 8 + 0)
#define                                 ADUTH8_bit          BANKMASK(ADUTHH), 0
// ADUTHH<ADUTH9>
extern volatile __bit                   ADUTH9              __at(0x1F709);	// @ (0x3EE1 * 8 + 1)
#define                                 ADUTH9_bit          BANKMASK(ADUTHH), 1
// ADSTAT<ADUTHR>
extern volatile __bit                   ADUTHR              __at(0x1F7E6);	// @ (0x3EFC * 8 + 6)
#define                                 ADUTHR_bit          BANKMASK(ADSTAT), 6
// ANSELA<ANSELA0>
extern volatile __bit                   ANSELA0             __at(0x1D200);	// @ (0x3A40 * 8 + 0)
#define                                 ANSELA0_bit         BANKMASK(ANSELA), 0
// ANSELA<ANSELA1>
extern volatile __bit                   ANSELA1             __at(0x1D201);	// @ (0x3A40 * 8 + 1)
#define                                 ANSELA1_bit         BANKMASK(ANSELA), 1
// ANSELA<ANSELA2>
extern volatile __bit                   ANSELA2             __at(0x1D202);	// @ (0x3A40 * 8 + 2)
#define                                 ANSELA2_bit         BANKMASK(ANSELA), 2
// ANSELA<ANSELA3>
extern volatile __bit                   ANSELA3             __at(0x1D203);	// @ (0x3A40 * 8 + 3)
#define                                 ANSELA3_bit         BANKMASK(ANSELA), 3
// ANSELA<ANSELA4>
extern volatile __bit                   ANSELA4             __at(0x1D204);	// @ (0x3A40 * 8 + 4)
#define                                 ANSELA4_bit         BANKMASK(ANSELA), 4
// ANSELA<ANSELA5>
extern volatile __bit                   ANSELA5             __at(0x1D205);	// @ (0x3A40 * 8 + 5)
#define                                 ANSELA5_bit         BANKMASK(ANSELA), 5
// ANSELA<ANSELA6>
extern volatile __bit                   ANSELA6             __at(0x1D206);	// @ (0x3A40 * 8 + 6)
#define                                 ANSELA6_bit         BANKMASK(ANSELA), 6
// ANSELA<ANSELA7>
extern volatile __bit                   ANSELA7             __at(0x1D207);	// @ (0x3A40 * 8 + 7)
#define                                 ANSELA7_bit         BANKMASK(ANSELA), 7
// ANSELB<ANSELB0>
extern volatile __bit                   ANSELB0             __at(0x1D280);	// @ (0x3A50 * 8 + 0)
#define                                 ANSELB0_bit         BANKMASK(ANSELB), 0
// ANSELB<ANSELB1>
extern volatile __bit                   ANSELB1             __at(0x1D281);	// @ (0x3A50 * 8 + 1)
#define                                 ANSELB1_bit         BANKMASK(ANSELB), 1
// ANSELB<ANSELB2>
extern volatile __bit                   ANSELB2             __at(0x1D282);	// @ (0x3A50 * 8 + 2)
#define                                 ANSELB2_bit         BANKMASK(ANSELB), 2
// ANSELB<ANSELB3>
extern volatile __bit                   ANSELB3             __at(0x1D283);	// @ (0x3A50 * 8 + 3)
#define                                 ANSELB3_bit         BANKMASK(ANSELB), 3
// ANSELB<ANSELB4>
extern volatile __bit                   ANSELB4             __at(0x1D284);	// @ (0x3A50 * 8 + 4)
#define                                 ANSELB4_bit         BANKMASK(ANSELB), 4
// ANSELB<ANSELB5>
extern volatile __bit                   ANSELB5             __at(0x1D285);	// @ (0x3A50 * 8 + 5)
#define                                 ANSELB5_bit         BANKMASK(ANSELB), 5
// ANSELB<ANSELB6>
extern volatile __bit                   ANSELB6             __at(0x1D286);	// @ (0x3A50 * 8 + 6)
#define                                 ANSELB6_bit         BANKMASK(ANSELB), 6
// ANSELB<ANSELB7>
extern volatile __bit                   ANSELB7             __at(0x1D287);	// @ (0x3A50 * 8 + 7)
