LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
#define                                 ANSELB7_bit         BANKMASK(ANSELB), 7
// ANSELC<ANSELC0>
extern volatile __bit                   ANSELC0             __at(0x1D300);	// @ (0x3A60 * 8 + 0)
#define                                 ANSELC0_bit         BANKMASK(ANSELC), 0
// ANSELC<ANSELC1>
extern volatile __bit                   ANSELC1             __at(0x1D301);	// @ (0x3A60 * 8 + 1)
#define                                 ANSELC1_bit         BANKMASK(ANSELC), 1
// ANSELC<ANSELC2>
extern volatile __bit                   ANSELC2             __at(0x1D302);	// @ (0x3A60 * 8 + 2)
#define                                 ANSELC2_bit         BANKMASK(ANSELC), 2
// ANSELC<ANSELC3>
extern volatile __bit                   ANSELC3             __at(0x1D303);	// @ (0x3A60 * 8 + 3)
#define                                 ANSELC3_bit         BANKMASK(ANSELC), 3
// ANSELC<ANSELC4>
extern volatile __bit                   ANSELC4             __at(0x1D304);	// @ (0x3A60 * 8 + 4)
#define                                 ANSELC4_bit         BANKMASK(ANSELC), 4
// ANSELC<ANSELC5>
extern volatile __bit                   ANSELC5             __at(0x1D305);	// @ (0x3A60 * 8 + 5)
#define                                 ANSELC5_bit         BANKMASK(ANSELC), 5
// ANSELC<ANSELC6>
extern volatile __bit                   ANSELC6             __at(0x1D306);	// @ (0x3A60 * 8 + 6)
#define                                 ANSELC6_bit         BANKMASK(ANSELC), 6
// ANSELC<ANSELC7>
extern volatile __bit                   ANSELC7             __at(0x1D307);	// @ (0x3A60 * 8 + 7)
#define                                 ANSELC7_bit         BANKMASK(ANSELC), 7
// ANSELD<ANSELD0>
extern volatile __bit                   ANSELD0             __at(0x1D380);	// @ (0x3A70 * 8 + 0)
#define                                 ANSELD0_bit         BANKMASK(ANSELD), 0
// ANSELD<ANSELD1>
extern volatile __bit                   ANSELD1             __at(0x1D381);	// @ (0x3A70 * 8 + 1)
#define                                 ANSELD1_bit         BANKMASK(ANSELD), 1
// ANSELD<ANSELD2>
extern volatile __bit                   ANSELD2             __at(0x1D382);	// @ (0x3A70 * 8 + 2)
#define                                 ANSELD2_bit         BANKMASK(ANSELD), 2
// ANSELD<ANSELD3>
extern volatile __bit                   ANSELD3             __at(0x1D383);	// @ (0x3A70 * 8 + 3)
#define                                 ANSELD3_bit         BANKMASK(ANSELD), 3
// ANSELD<ANSELD4>
extern volatile __bit                   ANSELD4             __at(0x1D384);	// @ (0x3A70 * 8 + 4)
#define                                 ANSELD4_bit         BANKMASK(ANSELD), 4
// ANSELD<ANSELD5>
extern volatile __bit                   ANSELD5             __at(0x1D385);	// @ (0x3A70 * 8 + 5)
#define                                 ANSELD5_bit         BANKMASK(ANSELD), 5
// ANSELD<ANSELD6>
extern volatile __bit                   ANSELD6             __at(0x1D386);	// @ (0x3A70 * 8 + 6)
#define                                 ANSELD6_bit         BANKMASK(ANSELD), 6
// ANSELD<ANSELD7>
extern volatile __bit                   ANSELD7             __at(0x1D387);	// @ (0x3A70 * 8 + 7)
#define                                 ANSELD7_bit         BANKMASK(ANSELD), 7
// ANSELE<ANSELE0>
extern volatile __bit                   ANSELE0             __at(0x1D400);	// @ (0x3A80 * 8 + 0)
#define                                 ANSELE0_bit         BANKMASK(ANSELE), 0
// ANSELE<ANSELE1>
extern volatile __bit                   ANSELE1             __at(0x1D401);	// @ (0x3A80 * 8 + 1)
#define                                 ANSELE1_bit         BANKMASK(ANSELE), 1
// ANSELE<ANSELE2>
extern volatile __bit                   ANSELE2             __at(0x1D402);	// @ (0x3A80 * 8 + 2)
#define                                 ANSELE2_bit         BANKMASK(ANSELE), 2
// SMT1STAT<AS>
extern volatile __bit                   AS                  __at(0x1F900);	// @ (0x3F20 * 8 + 0)
#define                                 AS_bit              BANKMASK(SMT1STAT), 0
// T0CON1<ASYNC>
extern volatile __bit                   ASYNC               __at(0x1FDCC);	// @ (0x3FB9 * 8 + 4)
#define                                 ASYNC_bit           BANKMASK(T0CON1), 4
// IVTBASEL<BASE0>
extern volatile __bit                   BASE0               __at(0x1FEA8);	// @ (0x3FD5 * 8 + 0)
#define                                 BASE0_bit           BANKMASK(IVTBASEL), 0
// IVTBASEL<BASE1>
extern volatile __bit                   BASE1               __at(0x1FEA9);	// @ (0x3FD5 * 8 + 1)
#define                                 BASE1_bit           BANKMASK(IVTBASEL), 1
// IVTBASEH<BASE10>
extern volatile __bit                   BASE10              __at(0x1FEB2);	// @ (0x3FD6 * 8 + 2)
#define                                 BASE10_bit          BANKMASK(IVTBASEH), 2
// IVTBASEH<BASE11>
extern volatile __bit                   BASE11              __at(0x1FEB3);	// @ (0x3FD6 * 8 + 3)
#define                                 BASE11_bit          BANKMASK(IVTBASEH), 3
// IVTBASEH<BASE12>
extern volatile __bit                   BASE12              __at(0x1FEB4);	// @ (0x3FD6 * 8 + 4)
#define                                 BASE12_bit          BANKMASK(IVTBASEH), 4
// IVTBASEH<BASE13>
extern volatile __bit                   BASE13              __at(0x1FEB5);	// @ (0x3FD6 * 8 + 5)
#define                                 BASE13_bit          BANKMASK(IVTBASEH), 5
// IVTBASEH<BASE14>
extern volatile __bit                   BASE14              __at(0x1FEB6);	// @ (0x3FD6 * 8 + 6)
#define                                 BASE14_bit          BANKMASK(IVTBASEH), 6
// IVTBASEH<BASE15>
extern volatile __bit                   BASE15              __at(0x1FEB7);	// @ (0x3FD6 * 8 + 7)
#define                                 BASE15_bit          BANKMASK(IVTBASEH), 7
// IVTBASEU<BASE16>
extern volatile __bit                   BASE16              __at(0x1FEB8);	// @ (0x3FD7 * 8 + 0)
#define                                 BASE16_bit          BANKMASK(IVTBASEU), 0
// IVTBASEU<BASE17>
extern volatile __bit                   BASE17              __at(0x1FEB9);	// @ (0x3FD7 * 8 + 1)
#define                                 BASE17_bit          BANKMASK(IVTBASEU), 1
// IVTBASEU<BASE18>
extern volatile __bit                   BASE18              __at(0x1FEBA);	// @ (0x3FD7 * 8 + 2)
#define                                 BASE18_bit          BANKMASK(IVTBASEU), 2
// IVTBASEU<BASE19>
extern volatile __bit                   BASE19              __at(0x1FEBB);	// @ (0x3FD7 * 8 + 3)
#define                                 BASE19_bit          BANKMASK(IVTBASEU), 3
// IVTBASEL<BASE2>
extern volatile __bit                   BASE2               __at(0x1FEAA);	// @ (0x3FD5 * 8 + 2)
#define                                 BASE2_bit           BANKMASK(IVTBASEL), 2
// IVTBASEU<BASE20>
extern volatile __bit                   BASE20              __at(0x1FEBC);	// @ (0x3FD7 * 8 + 4)
#define                                 BASE20_bit          BANKMASK(IVTBASEU), 4
// IVTBASEL<BASE3>
extern volatile __bit                   BASE3               __at(0x1FEAB);	// @ (0x3FD5 * 8 + 3)
#define                                 BASE3_bit           BANKMASK(IVTBASEL), 3
// IVTBASEL<BASE4>
extern volatile __bit                   BASE4               __at(0x1FEAC);	// @ (0x3FD5 * 8 + 4)
#define                                 BASE4_bit           BANKMASK(IVTBASEL), 4
// IVTBASEL<BASE5>
extern volatile __bit                   BASE5               __at(0x1FEAD);	// @ (0x3FD5 * 8 + 5)
#define                                 BASE5_bit           BANKMASK(IVTBASEL), 5
// IVTBASEL<BASE6>
extern volatile __bit                   BASE6               __at(0x1FEAE);	// @ (0x3FD5 * 8 + 6)
#define                                 BASE6_bit           BANKMASK(IVTBASEL), 6
// IVTBASEL<BASE7>
extern volatile __bit                   BASE7               __at(0x1FEAF);	// @ (0x3FD5 * 8 + 7)
#define                                 BASE7_bit           BANKMASK(IVTBASEL), 7
// IVTBASEH<BASE8>
extern volatile __bit                   BASE8               __at(0x1FEB0);	// @ (0x3FD6 * 8 + 0)
#define                                 BASE8_bit           BANKMASK(IVTBASEH), 0
// IVTBASEH<BASE9>
extern volatile __bit                   BASE9               __at(0x1FEB1);	// @ (0x3FD6 * 8 + 1)
#define                                 BASE9_bit           BANKMASK(IVTBASEH), 1
// SPI1BAUD<BAUD0>
extern volatile __bit                   BAUD0               __at(0x1E8C8);	// @ (0x3D19 * 8 + 0)
#define                                 BAUD0_bit           BANKMASK(SPI1BAUD), 0
// SPI1BAUD<BAUD1>
extern volatile __bit                   BAUD1               __at(0x1E8C9);	// @ (0x3D19 * 8 + 1)
#define                                 BAUD1_bit           BANKMASK(SPI1BAUD), 1
// SPI1BAUD<BAUD2>
extern volatile __bit                   BAUD2               __at(0x1E8CA);	// @ (0x3D19 * 8 + 2)
#define                                 BAUD2_bit           BANKMASK(SPI1BAUD), 2
// SPI1BAUD<BAUD3>
extern volatile __bit                   BAUD3               __at(0x1E8CB);	// @ (0x3D19 * 8 + 3)
#define                                 BAUD3_bit           BANKMASK(SPI1BAUD), 3
// SPI1BAUD<BAUD4>
extern volatile __bit                   BAUD4               __at(0x1E8CC);	// @ (0x3D19 * 8 + 4)
#define                                 BAUD4_bit           BANKMASK(SPI1BAUD), 4
// SPI1BAUD<BAUD5>
extern volatile __bit                   BAUD5               __at(0x1E8CD);	// @ (0x3D19 * 8 + 5)
#define                                 BAUD5_bit           BANKMASK(SPI1BAUD), 5
// SPI1BAUD<BAUD6>
extern volatile __bit                   BAUD6               __at(0x1E8CE);	// @ (0x3D19 * 8 + 6)
#define                                 BAUD6_bit           BANKMASK(SPI1BAUD), 6
// SPI1BAUD<BAUD7>
extern volatile __bit                   BAUD7               __at(0x1E8CF);	// @ (0x3D19 * 8 + 7)
#define                                 BAUD7_bit           BANKMASK(SPI1BAUD), 7
// I2C1ERR<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x1EBB1);	// @ (0x3D76 * 8 + 1)
#define                                 BCL1IE_bit          BANKMASK(I2C1ERR), 1
// I2C1ERR<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x1EBB5);	// @ (0x3D76 * 8 + 5)
#define                                 BCL1IF_bit          BANKMASK(I2C1ERR), 5
// I2C2ERR<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x1EB01);	// @ (0x3D60 * 8 + 1)
#define                                 BCL2IE_bit          BANKMASK(I2C2ERR), 1
// I2C2ERR<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0x1EB05);	// @ (0x3D60 * 8 + 5)
#define                                 BCL2IF_bit          BANKMASK(I2C2ERR), 5
// MD1CON0<BIT>
extern volatile __bit                   BIT                 __at(0x1E7D0);	// @ (0x3CFA * 8 + 0)
#define                                 BIT_bit             BANKMASK(MD1CON0), 0
// SPI1CON0<BMODE>
extern volatile __bit                   BMODE               __at(0x1E8A0);	// @ (0x3D14 * 8 + 0)
#define                                 BMODE_bit           BANKMASK(SPI1CON0), 0
// PCON0<BOR>
extern volatile __bit                   BOR                 __at(0x1FF80);	// @ (0x3FF0 * 8 + 0)
#define                                 BOR_bit             BANKMASK(PCON0), 0
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x1CE80);	// @ (0x39D0 * 8 + 0)
#define                                 BORRDY_bit          BANKMASK(BORCON), 0
// I2C1ERR<BTO1IE>
extern volatile __bit                   BTO1IE              __at(0x1EBB2);	// @ (0x3D76 * 8 + 2)
#define                                 BTO1IE_bit          BANKMASK(I2C1ERR), 2
// I2C1ERR<BTO1IF>
extern volatile __bit                   BTO1IF              __at(0x1EBB6);	// @ (0x3D76 * 8 + 6)
#define                                 BTO1IF_bit          BANKMASK(I2C1ERR), 6
// I2C2ERR<BTO2IE>
extern volatile __bit                   BTO2IE              __at(0x1EB02);	// @ (0x3D60 * 8 + 2)
#define                                 BTO2IE_bit          BANKMASK(I2C2ERR), 2
// I2C2ERR<BTO2IF>
extern volatile __bit                   BTO2IF              __at(0x1EB06);	// @ (0x3D60 * 8 + 6)
#define                                 BTO2IF_bit          BANKMASK(I2C2ERR), 6
// SCANCON0<BURSTMD>
extern volatile __bit                   BURSTMD             __at(0x1CBE1);	// @ (0x397C * 8 + 1)
#define                                 BURSTMD_bit         BANKMASK(SCANCON0), 1
// U1CON2<C0EN>
extern volatile __bit                   C0EN                __at(0x1EFA3);	// @ (0x3DF4 * 8 + 3)
#define                                 C0EN_bit            BANKMASK(U1CON2), 3
// CM1CON0<C1EN>
extern volatile __bit                   C1EN                __at(0x1F5E7);	// @ (0x3EBC * 8 + 7)
#define                                 C1EN_bit            BANKMASK(CM1CON0), 7
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x1F5E1);	// @ (0x3EBC * 8 + 1)
#define                                 C1HYS_bit           BANKMASK(CM1CON0), 1
// PIE1<C1IE>
extern volatile __bit                   C1IE                __at(0x1CC8C);	// @ (0x3991 * 8 + 4)
#define                                 C1IE_bit            BANKMASK(PIE1), 4
// PIR1<C1IF>
extern volatile __bit                   C1IF                __at(0x1CD0C);	// @ (0x39A1 * 8 + 4)
#define                                 C1IF_bit            BANKMASK(PIR1), 4
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x1F5E8);	// @ (0x3EBD * 8 + 0)
#define                                 C1INTN_bit          BANKMASK(CM1CON1), 0
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x1F5E9);	// @ (0x3EBD * 8 + 1)
#define                                 C1INTP_bit          BANKMASK(CM1CON1), 1
// IPR1<C1IP>
extern volatile __bit                   C1IP                __at(0x1CC0C);	// @ (0x3981 * 8 + 4)
#define                                 C1IP_bit            BANKMASK(IPR1), 4
// CM1NCH<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x1F5F0);	// @ (0x3EBE * 8 + 0)
#define                                 C1NCH0_bit          BANKMASK(CM1NCH), 0
// CM1NCH<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x1F5F1);	// @ (0x3EBE * 8 + 1)
#define                                 C1NCH1_bit          BANKMASK(CM1NCH), 1
// CM1NCH<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x1F5F2);	// @ (0x3EBE * 8 + 2)
#define                                 C1NCH2_bit          BANKMASK(CM1NCH), 2
// CM1PCH<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x1F5F8);	// @ (0x3EBF * 8 + 0)
#define                                 C1PCH0_bit          BANKMASK(CM1PCH), 0
// CM1PCH<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x1F5F9);	// @ (0x3EBF * 8 + 1)
#define                                 C1PCH1_bit          BANKMASK(CM1PCH), 1
// CM1PCH<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x1F5FA);	// @ (0x3EBF * 8 + 2)
#define                                 C1PCH2_bit          BANKMASK(CM1PCH), 2
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x1F5E4);	// @ (0x3EBC * 8 + 4)
#define                                 C1POL_bit           BANKMASK(CM1CON0), 4
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x1F5E0);	// @ (0x3EBC * 8 + 0)
#define                                 C1SYNC_bit          BANKMASK(CM1CON0), 0
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x1FAF0);	// @ (0x3F5E * 8 + 0)
#define                                 C1TSEL0_bit         BANKMASK(CCPTMRS0), 0
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x1FAF1);	// @ (0x3F5E * 8 + 1)
#define                                 C1TSEL1_bit         BANKMASK(CCPTMRS0), 1
// CM2CON0<C2EN>
extern volatile __bit                   C2EN                __at(0x1F5C7);	// @ (0x3EB8 * 8 + 7)
#define                                 C2EN_bit            BANKMASK(CM2CON0), 7
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x1F5C1);	// @ (0x3EB8 * 8 + 1)
#define                                 C2HYS_bit           BANKMASK(CM2CON0), 1
// PIE5<C2IE>
extern volatile __bit                   C2IE                __at(0x1CCA9);	// @ (0x3995 * 8 + 1)
#define                                 C2IE_bit            BANKMASK(PIE5), 1
// PIR5<C2IF>
extern volatile __bit                   C2IF                __at(0x1CD29);	// @ (0x39A5 * 8 + 1)
#define                                 C2IF_bit            BANKMASK(PIR5), 1
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x1F5C8);	// @ (0x3EB9 * 8 + 0)
#define                                 C2INTN_bit          BANKMASK(CM2CON1), 0
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x1F5C9);	// @ (0x3EB9 * 8 + 1)
#define                                 C2INTP_bit          BANKMASK(CM2CON1), 1
// IPR5<C2IP>
extern volatile __bit                   C2IP                __at(0x1CC29);	// @ (0x3985 * 8 + 1)
#define                                 C2IP_bit            BANKMASK(IPR5), 1
// CM2NCH<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x1F5D0);	// @ (0x3EBA * 8 + 0)
#define                                 C2NCH0_bit          BANKMASK(CM2NCH), 0
// CM2NCH<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x1F5D1);	// @ (0x3EBA * 8 + 1)
#define                                 C2NCH1_bit          BANKMASK(CM2NCH), 1
// CM2NCH<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x1F5D2);	// @ (0x3EBA * 8 + 2)
#define                                 C2NCH2_bit          BANKMASK(CM2NCH), 2
// CM2PCH<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x1F5D8);	// @ (0x3EBB * 8 + 0)
#define                                 C2PCH0_bit          BANKMASK(CM2PCH), 0
// CM2PCH<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x1F5D9);	// @ (0x3EBB * 8 + 1)
#define                                 C2PCH1_bit          BANKMASK(CM2PCH), 1
// CM2PCH<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x1F5DA);	// @ (0x3EBB * 8 + 2)
#define                                 C2PCH2_bit          BANKMASK(CM2PCH), 2
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x1F5C4);	// @ (0x3EB8 * 8 + 4)
#define                                 C2POL_bit           BANKMASK(CM2CON0), 4
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x1F5C0);	// @ (0x3EB8 * 8 + 0)
#define                                 C2SYNC_bit          BANKMASK(CM2CON0), 0
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x1FAF2);	// @ (0x3F5E * 8 + 2)
#define                                 C2TSEL0_bit         BANKMASK(CCPTMRS0), 2
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x1FAF3);	// @ (0x3F5E * 8 + 3)
#define                                 C2TSEL1_bit         BANKMASK(CCPTMRS0), 3
// CCPTMRS0<C3TSEL0>
extern volatile __bit                   C3TSEL0             __at(0x1FAF4);	// @ (0x3F5E * 8 + 4)
#define                                 C3TSEL0_bit         BANKMASK(CCPTMRS0), 4
// CCPTMRS0<C3TSEL1>
extern volatile __bit                   C3TSEL1             __at(0x1FAF5);	// @ (0x3F5E * 8 + 5)
#define                                 C3TSEL1_bit         BANKMASK(CCPTMRS0), 5
// CCPTMRS0<C4TSEL0>
extern volatile __bit                   C4TSEL0             __at(0x1FAF6);	// @ (0x3F5E * 8 + 6)
#define                                 C4TSEL0_bit         BANKMASK(CCPTMRS0), 6
// CCPTMRS0<C4TSEL1>
extern volatile __bit                   C4TSEL1             __at(0x1FAF7);	// @ (0x3F5E * 8 + 7)
#define                                 C4TSEL1_bit         BANKMASK(CCPTMRS0), 7
// ADCON3<CALC0>
extern volatile __bit                   CALC0               __at(0x1F7DC);	// @ (0x3EFB * 8 + 4)
#define                                 CALC0_bit           BANKMASK(ADCON3), 4
// ADCON3<CALC1>
extern volatile __bit                   CALC1               __at(0x1F7DD);	// @ (0x3EFB * 8 + 5)
#define                                 CALC1_bit           BANKMASK(ADCON3), 5
// ADCON3<CALC2>
extern volatile __bit                   CALC2               __at(0x1F7DE);	// @ (0x3EFB * 8 + 6)
#define                                 CALC2_bit           BANKMASK(ADCON3), 6
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x1FEC0);	// @ (0x3FD8 * 8 + 0)
#define                                 CARRY_bit           BANKMASK(STATUS), 0
// IPR5<CCH05>
extern volatile __bit                   CCH05               __at(0x1CC28);	// @ (0x3985 * 8 + 0)
#define                                 CCH05_bit           BANKMASK(IPR5), 0
// IPR5<CCH15>
extern volatile __bit                   CCH15               __at(0x1CC29);	// @ (0x3985 * 8 + 1)
#define                                 CCH15_bit           BANKMASK(IPR5), 1
// IPR4<CCIP3IP>
extern volatile __bit                   CCIP3IP             __at(0x1CC20);	// @ (0x3984 * 8 + 0)
#define                                 CCIP3IP_bit         BANKMASK(IPR4), 0
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x1FBF8);	// @ (0x3F7F * 8 + 0)
#define                                 CCP1CTS0_bit        BANKMASK(CCP1CAP), 0
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x1FBF9);	// @ (0x3F7F * 8 + 1)
#define                                 CCP1CTS1_bit        BANKMASK(CCP1CAP), 1
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x1FBFA);	// @ (0x3F7F * 8 + 2)
#define                                 CCP1CTS2_bit        BANKMASK(CCP1CAP), 2
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x1FBF7);	// @ (0x3F7E * 8 + 7)
#define                                 CCP1EN_bit          BANKMASK(CCP1CON), 7
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1FBF4);	// @ (0x3F7E * 8 + 4)
#define                                 CCP1FMT_bit         BANKMASK(CCP1CON), 4
// PIE4<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x1CCA3);	// @ (0x3994 * 8 + 3)
#define                                 CCP1IE_bit          BANKMASK(PIE4), 3
// PIR4<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x1CD23);	// @ (0x39A4 * 8 + 3)
#define                                 CCP1IF_bit          BANKMASK(PIR4), 3
// IPR4<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x1CC23);	// @ (0x3984 * 8 + 3)
#define                                 CCP1IP_bit          BANKMASK(IPR4), 3
// PMD3<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x1CE18);	// @ (0x39C3 * 8 + 0)
#define                                 CCP1MD_bit          BANKMASK(PMD3), 0
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1FBF0);	// @ (0x3F7E * 8 + 0)
#define                                 CCP1MODE0_bit       BANKMASK(CCP1CON), 0
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1FBF1);	// @ (0x3F7E * 8 + 1)
#define                                 CCP1MODE1_bit       BANKMASK(CCP1CON), 1
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1FBF2);	// @ (0x3F7E * 8 + 2)
#define                                 CCP1MODE2_bit       BANKMASK(CCP1CON), 2
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1FBF3);	// @ (0x3F7E * 8 + 3)
