LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
#define                                 CCP1MODE3_bit       BANKMASK(CCP1CON), 3
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1FBF5);	// @ (0x3F7E * 8 + 5)
#define                                 CCP1OUT_bit         BANKMASK(CCP1CON), 5
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x1FE61);	// @ (0x3FCC * 8 + 1)
#define                                 CCP2_bit            BANKMASK(PORTC), 1
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x1FBD8);	// @ (0x3F7B * 8 + 0)
#define                                 CCP2CTS0_bit        BANKMASK(CCP2CAP), 0
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x1FBD9);	// @ (0x3F7B * 8 + 1)
#define                                 CCP2CTS1_bit        BANKMASK(CCP2CAP), 1
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x1FBDA);	// @ (0x3F7B * 8 + 2)
#define                                 CCP2CTS2_bit        BANKMASK(CCP2CAP), 2
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x1FBD7);	// @ (0x3F7A * 8 + 7)
#define                                 CCP2EN_bit          BANKMASK(CCP2CON), 7
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x1FBD4);	// @ (0x3F7A * 8 + 4)
#define                                 CCP2FMT_bit         BANKMASK(CCP2CON), 4
// PIE7<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x1CCB9);	// @ (0x3997 * 8 + 1)
#define                                 CCP2IE_bit          BANKMASK(PIE7), 1
// PIR7<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x1CD39);	// @ (0x39A7 * 8 + 1)
#define                                 CCP2IF_bit          BANKMASK(PIR7), 1
// IPR7<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x1CC39);	// @ (0x3987 * 8 + 1)
#define                                 CCP2IP_bit          BANKMASK(IPR7), 1
// PMD3<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x1CE19);	// @ (0x39C3 * 8 + 1)
#define                                 CCP2MD_bit          BANKMASK(PMD3), 1
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1FBD0);	// @ (0x3F7A * 8 + 0)
#define                                 CCP2MODE0_bit       BANKMASK(CCP2CON), 0
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1FBD1);	// @ (0x3F7A * 8 + 1)
#define                                 CCP2MODE1_bit       BANKMASK(CCP2CON), 1
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1FBD2);	// @ (0x3F7A * 8 + 2)
#define                                 CCP2MODE2_bit       BANKMASK(CCP2CON), 2
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1FBD3);	// @ (0x3F7A * 8 + 3)
#define                                 CCP2MODE3_bit       BANKMASK(CCP2CON), 3
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1FBD5);	// @ (0x3F7A * 8 + 5)
#define                                 CCP2OUT_bit         BANKMASK(CCP2CON), 5
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x1FE5B);	// @ (0x3FCB * 8 + 3)
#define                                 CCP2_PA2_bit        BANKMASK(PORTB), 3
// CCP3CAP<CCP3CTS0>
extern volatile __bit                   CCP3CTS0            __at(0x1FBB8);	// @ (0x3F77 * 8 + 0)
#define                                 CCP3CTS0_bit        BANKMASK(CCP3CAP), 0
// CCP3CAP<CCP3CTS1>
extern volatile __bit                   CCP3CTS1            __at(0x1FBB9);	// @ (0x3F77 * 8 + 1)
#define                                 CCP3CTS1_bit        BANKMASK(CCP3CAP), 1
// CCP3CAP<CCP3CTS2>
extern volatile __bit                   CCP3CTS2            __at(0x1FBBA);	// @ (0x3F77 * 8 + 2)
#define                                 CCP3CTS2_bit        BANKMASK(CCP3CAP), 2
// CCP3CON<CCP3EN>
extern volatile __bit                   CCP3EN              __at(0x1FBB7);	// @ (0x3F76 * 8 + 7)
#define                                 CCP3EN_bit          BANKMASK(CCP3CON), 7
// CCP3CON<CCP3FMT>
extern volatile __bit                   CCP3FMT             __at(0x1FBB4);	// @ (0x3F76 * 8 + 4)
#define                                 CCP3FMT_bit         BANKMASK(CCP3CON), 4
// PIE9<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x1CCC9);	// @ (0x3999 * 8 + 1)
#define                                 CCP3IE_bit          BANKMASK(PIE9), 1
// PIR9<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x1CD49);	// @ (0x39A9 * 8 + 1)
#define                                 CCP3IF_bit          BANKMASK(PIR9), 1
// IPR9<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x1CC49);	// @ (0x3989 * 8 + 1)
#define                                 CCP3IP_bit          BANKMASK(IPR9), 1
// PMD3<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x1CE1A);	// @ (0x39C3 * 8 + 2)
#define                                 CCP3MD_bit          BANKMASK(PMD3), 2
// CCP3CON<CCP3MODE0>
extern volatile __bit                   CCP3MODE0           __at(0x1FBB0);	// @ (0x3F76 * 8 + 0)
#define                                 CCP3MODE0_bit       BANKMASK(CCP3CON), 0
// CCP3CON<CCP3MODE1>
extern volatile __bit                   CCP3MODE1           __at(0x1FBB1);	// @ (0x3F76 * 8 + 1)
#define                                 CCP3MODE1_bit       BANKMASK(CCP3CON), 1
// CCP3CON<CCP3MODE2>
extern volatile __bit                   CCP3MODE2           __at(0x1FBB2);	// @ (0x3F76 * 8 + 2)
#define                                 CCP3MODE2_bit       BANKMASK(CCP3CON), 2
// CCP3CON<CCP3MODE3>
extern volatile __bit                   CCP3MODE3           __at(0x1FBB3);	// @ (0x3F76 * 8 + 3)
#define                                 CCP3MODE3_bit       BANKMASK(CCP3CON), 3
// CCP3CON<CCP3OUT>
extern volatile __bit                   CCP3OUT             __at(0x1FBB5);	// @ (0x3F76 * 8 + 5)
#define                                 CCP3OUT_bit         BANKMASK(CCP3CON), 5
// CCP4CAP<CCP4CTS0>
extern volatile __bit                   CCP4CTS0            __at(0x1FB98);	// @ (0x3F73 * 8 + 0)
#define                                 CCP4CTS0_bit        BANKMASK(CCP4CAP), 0
// CCP4CAP<CCP4CTS1>
extern volatile __bit                   CCP4CTS1            __at(0x1FB99);	// @ (0x3F73 * 8 + 1)
#define                                 CCP4CTS1_bit        BANKMASK(CCP4CAP), 1
// CCP4CAP<CCP4CTS2>
extern volatile __bit                   CCP4CTS2            __at(0x1FB9A);	// @ (0x3F73 * 8 + 2)
#define                                 CCP4CTS2_bit        BANKMASK(CCP4CAP), 2
// CCP4CON<CCP4EN>
extern volatile __bit                   CCP4EN              __at(0x1FB97);	// @ (0x3F72 * 8 + 7)
#define                                 CCP4EN_bit          BANKMASK(CCP4CON), 7
// CCP4CON<CCP4FMT>
extern volatile __bit                   CCP4FMT             __at(0x1FB94);	// @ (0x3F72 * 8 + 4)
#define                                 CCP4FMT_bit         BANKMASK(CCP4CON), 4
// PIE10<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x1CCD0);	// @ (0x399A * 8 + 0)
#define                                 CCP4IE_bit          BANKMASK(PIE10), 0
// PIR10<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x1CD50);	// @ (0x39AA * 8 + 0)
#define                                 CCP4IF_bit          BANKMASK(PIR10), 0
// IPR10<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x1CC50);	// @ (0x398A * 8 + 0)
#define                                 CCP4IP_bit          BANKMASK(IPR10), 0
// PMD3<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x1CE1B);	// @ (0x39C3 * 8 + 3)
#define                                 CCP4MD_bit          BANKMASK(PMD3), 3
// CCP4CON<CCP4MODE0>
extern volatile __bit                   CCP4MODE0           __at(0x1FB90);	// @ (0x3F72 * 8 + 0)
#define                                 CCP4MODE0_bit       BANKMASK(CCP4CON), 0
// CCP4CON<CCP4MODE1>
extern volatile __bit                   CCP4MODE1           __at(0x1FB91);	// @ (0x3F72 * 8 + 1)
#define                                 CCP4MODE1_bit       BANKMASK(CCP4CON), 1
// CCP4CON<CCP4MODE2>
extern volatile __bit                   CCP4MODE2           __at(0x1FB92);	// @ (0x3F72 * 8 + 2)
#define                                 CCP4MODE2_bit       BANKMASK(CCP4CON), 2
// CCP4CON<CCP4MODE3>
extern volatile __bit                   CCP4MODE3           __at(0x1FB93);	// @ (0x3F72 * 8 + 3)
#define                                 CCP4MODE3_bit       BANKMASK(CCP4CON), 3
// CCP4CON<CCP4OUT>
extern volatile __bit                   CCP4OUT             __at(0x1FB95);	// @ (0x3F72 * 8 + 5)
#define                                 CCP4OUT_bit         BANKMASK(CCP4CON), 5
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x1FE73);	// @ (0x3FCE * 8 + 3)
#define                                 CCP9E_bit           BANKMASK(PORTE), 3
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x1F60A);	// @ (0x3EC1 * 8 + 2)
#define                                 CDAFVR0_bit         BANKMASK(FVRCON), 2
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x1F60B);	// @ (0x3EC1 * 8 + 3)
#define                                 CDAFVR1_bit         BANKMASK(FVRCON), 3
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x1CED0);	// @ (0x39DA * 8 + 0)
#define                                 CDIV0_bit           BANKMASK(OSCCON2), 0
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x1CED1);	// @ (0x39DA * 8 + 1)
#define                                 CDIV1_bit           BANKMASK(OSCCON2), 1
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x1CED2);	// @ (0x39DA * 8 + 2)
#define                                 CDIV2_bit           BANKMASK(OSCCON2), 2
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x1CED3);	// @ (0x39DA * 8 + 3)
#define                                 CDIV3_bit           BANKMASK(OSCCON2), 3
// MD1CARH<CH0>
extern volatile __bit                   CH0                 __at(0x1E7F0);	// @ (0x3CFE * 8 + 0)
#define                                 CH0_bit             BANKMASK(MD1CARH), 0
// MD1CARH<CH1>
extern volatile __bit                   CH1                 __at(0x1E7F1);	// @ (0x3CFE * 8 + 1)
#define                                 CH1_bit             BANKMASK(MD1CARH), 1
// MD1CARH<CH2>
extern volatile __bit                   CH2                 __at(0x1E7F2);	// @ (0x3CFE * 8 + 2)
#define                                 CH2_bit             BANKMASK(MD1CARH), 2
// MD1CARH<CH3>
extern volatile __bit                   CH3                 __at(0x1E7F3);	// @ (0x3CFE * 8 + 3)
#define                                 CH3_bit             BANKMASK(MD1CARH), 3
// MD1CARH<CH4>
extern volatile __bit                   CH4                 __at(0x1E7F4);	// @ (0x3CFE * 8 + 4)
#define                                 CH4_bit             BANKMASK(MD1CARH), 4
// MD1CON1<CHPOL>
extern volatile __bit                   CHPOL               __at(0x1E7DD);	// @ (0x3CFB * 8 + 5)
#define                                 CHPOL_bit           BANKMASK(MD1CON1), 5
// MD1CON1<CHSYNC>
extern volatile __bit                   CHSYNC              __at(0x1E7DC);	// @ (0x3CFB * 8 + 4)
#define                                 CHSYNC_bit          BANKMASK(MD1CON1), 4
// SPI1CON1<CKE>
extern volatile __bit                   CKE                 __at(0x1E8AE);	// @ (0x3D15 * 8 + 6)
#define                                 CKE_bit             BANKMASK(SPI1CON1), 6
// SPI1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x1E8AD);	// @ (0x3D15 * 8 + 5)
#define                                 CKP_bit             BANKMASK(SPI1CON1), 5
// T0CON1<CKPS3>
extern volatile __bit                   CKPS3               __at(0x1FDCB);	// @ (0x3FB9 * 8 + 3)
#define                                 CKPS3_bit           BANKMASK(T0CON1), 3
// NCO1CLK<CKS0>
extern volatile __bit                   CKS0                __at(0x1F9F8);	// @ (0x3F3F * 8 + 0)
#define                                 CKS0_bit            BANKMASK(NCO1CLK), 0
// NCO1CLK<CKS1>
extern volatile __bit                   CKS1                __at(0x1F9F9);	// @ (0x3F3F * 8 + 1)
#define                                 CKS1_bit            BANKMASK(NCO1CLK), 1
// NCO1CLK<CKS2>
extern volatile __bit                   CKS2                __at(0x1F9FA);	// @ (0x3F3F * 8 + 2)
#define                                 CKS2_bit            BANKMASK(NCO1CLK), 2
// NCO1CLK<CKS3>
extern volatile __bit                   CKS3                __at(0x1F9FB);	// @ (0x3F3F * 8 + 3)
#define                                 CKS3_bit            BANKMASK(NCO1CLK), 3
// MD1CARL<CL0>
extern volatile __bit                   CL0                 __at(0x1E7E8);	// @ (0x3CFD * 8 + 0)
#define                                 CL0_bit             BANKMASK(MD1CARL), 0
// MD1CARL<CL1>
extern volatile __bit                   CL1                 __at(0x1E7E9);	// @ (0x3CFD * 8 + 1)
#define                                 CL1_bit             BANKMASK(MD1CARL), 1
// MD1CARL<CL2>
extern volatile __bit                   CL2                 __at(0x1E7EA);	// @ (0x3CFD * 8 + 2)
#define                                 CL2_bit             BANKMASK(MD1CARL), 2
// MD1CARL<CL3>
extern volatile __bit                   CL3                 __at(0x1E7EB);	// @ (0x3CFD * 8 + 3)
#define                                 CL3_bit             BANKMASK(MD1CARL), 3
// MD1CARL<CL4>
extern volatile __bit                   CL4                 __at(0x1E7EC);	// @ (0x3CFD * 8 + 4)
#define                                 CL4_bit             BANKMASK(MD1CARL), 4
// PIE4<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x1CCA7);	// @ (0x3994 * 8 + 7)
#define                                 CLC1IE_bit          BANKMASK(PIE4), 7
// PIR4<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x1CD27);	// @ (0x39A4 * 8 + 7)
#define                                 CLC1IF_bit          BANKMASK(PIR4), 7
// IPR4<CLC1IP>
extern volatile __bit                   CLC1IP              __at(0x1CC27);	// @ (0x3984 * 8 + 7)
#define                                 CLC1IP_bit          BANKMASK(IPR4), 7
// PMD6<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x1CE31);	// @ (0x39C6 * 8 + 1)
#define                                 CLC1MD_bit          BANKMASK(PMD6), 1
// CLCDATA0<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0x1E3F0);	// @ (0x3C7E * 8 + 0)
#define                                 CLC1OUT_bit         BANKMASK(CLCDATA0), 0
// PIE7<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x1CCBC);	// @ (0x3997 * 8 + 4)
#define                                 CLC2IE_bit          BANKMASK(PIE7), 4
// PIR7<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x1CD3C);	// @ (0x39A7 * 8 + 4)
#define                                 CLC2IF_bit          BANKMASK(PIR7), 4
// IPR7<CLC2IP>
extern volatile __bit                   CLC2IP              __at(0x1CC3C);	// @ (0x3987 * 8 + 4)
#define                                 CLC2IP_bit          BANKMASK(IPR7), 4
// PMD6<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x1CE32);	// @ (0x39C6 * 8 + 2)
#define                                 CLC2MD_bit          BANKMASK(PMD6), 2
// CLCDATA0<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0x1E3F1);	// @ (0x3C7E * 8 + 1)
#define                                 CLC2OUT_bit         BANKMASK(CLCDATA0), 1
// PIE9<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x1CCCB);	// @ (0x3999 * 8 + 3)
#define                                 CLC3IE_bit          BANKMASK(PIE9), 3
// PIR9<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x1CD4B);	// @ (0x39A9 * 8 + 3)
#define                                 CLC3IF_bit          BANKMASK(PIR9), 3
// IPR9<CLC3IP>
extern volatile __bit                   CLC3IP              __at(0x1CC4B);	// @ (0x3989 * 8 + 3)
#define                                 CLC3IP_bit          BANKMASK(IPR9), 3
// PMD6<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x1CE33);	// @ (0x39C6 * 8 + 3)
#define                                 CLC3MD_bit          BANKMASK(PMD6), 3
// CLCDATA0<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0x1E3F2);	// @ (0x3C7E * 8 + 2)
#define                                 CLC3OUT_bit         BANKMASK(CLCDATA0), 2
// PIE10<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x1CCD1);	// @ (0x399A * 8 + 1)
#define                                 CLC4IE_bit          BANKMASK(PIE10), 1
// PIR10<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x1CD51);	// @ (0x39AA * 8 + 1)
#define                                 CLC4IF_bit          BANKMASK(PIR10), 1
// IPR10<CLC4IP>
extern volatile __bit                   CLC4IP              __at(0x1CC51);	// @ (0x398A * 8 + 1)
#define                                 CLC4IP_bit          BANKMASK(IPR10), 1
// PMD6<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x1CE34);	// @ (0x39C6 * 8 + 4)
#define                                 CLC4MD_bit          BANKMASK(PMD6), 4
// CLCDATA0<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x1E3F3);	// @ (0x3C7E * 8 + 3)
#define                                 CLC4OUT_bit         BANKMASK(CLCDATA0), 3
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x1E730);	// @ (0x3CE6 * 8 + 0)
#define                                 CLKRCLK0_bit        BANKMASK(CLKRCLK), 0
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x1E731);	// @ (0x3CE6 * 8 + 1)
#define                                 CLKRCLK1_bit        BANKMASK(CLKRCLK), 1
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x1E732);	// @ (0x3CE6 * 8 + 2)
#define                                 CLKRCLK2_bit        BANKMASK(CLKRCLK), 2
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x1E733);	// @ (0x3CE6 * 8 + 3)
#define                                 CLKRCLK3_bit        BANKMASK(CLKRCLK), 3
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x1E72B);	// @ (0x3CE5 * 8 + 3)
#define                                 CLKRDC0_bit         BANKMASK(CLKRCON), 3
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x1E72C);	// @ (0x3CE5 * 8 + 4)
#define                                 CLKRDC1_bit         BANKMASK(CLKRCON), 4
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x1E728);	// @ (0x3CE5 * 8 + 0)
#define                                 CLKRDIV0_bit        BANKMASK(CLKRCON), 0
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x1E729);	// @ (0x3CE5 * 8 + 1)
#define                                 CLKRDIV1_bit        BANKMASK(CLKRCON), 1
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x1E72A);	// @ (0x3CE5 * 8 + 2)
#define                                 CLKRDIV2_bit        BANKMASK(CLKRCON), 2
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x1E72F);	// @ (0x3CE5 * 8 + 7)
#define                                 CLKREN_bit          BANKMASK(CLKRCON), 7
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x1CE01);	// @ (0x39C0 * 8 + 1)
#define                                 CLKRMD_bit          BANKMASK(PMD0), 1
// SPI1CLK<CLKSEL0>
extern volatile __bit                   CLKSEL0             __at(0x1E8E0);	// @ (0x3D1C * 8 + 0)
#define                                 CLKSEL0_bit         BANKMASK(SPI1CLK), 0
// SPI1CLK<CLKSEL1>
extern volatile __bit                   CLKSEL1             __at(0x1E8E1);	// @ (0x3D1C * 8 + 1)
#define                                 CLKSEL1_bit         BANKMASK(SPI1CLK), 1
// SPI1CLK<CLKSEL2>
extern volatile __bit                   CLKSEL2             __at(0x1E8E2);	// @ (0x3D1C * 8 + 2)
#define                                 CLKSEL2_bit         BANKMASK(SPI1CLK), 2
// MD1CON1<CLPOL>
extern volatile __bit                   CLPOL               __at(0x1E7D9);	// @ (0x3CFB * 8 + 1)
#define                                 CLPOL_bit           BANKMASK(MD1CON1), 1
// MD1CON1<CLSYNC>
extern volatile __bit                   CLSYNC              __at(0x1E7D8);	// @ (0x3CFB * 8 + 0)
#define                                 CLSYNC_bit          BANKMASK(MD1CON1), 0
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x1CC96);	// @ (0x3992 * 8 + 6)
#define                                 CMIE_bit            BANKMASK(PIE2), 6
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x1CD16);	// @ (0x39A2 * 8 + 6)
#define                                 CMIF_bit            BANKMASK(PIR2), 6
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x1CC16);	// @ (0x3982 * 8 + 6)
#define                                 CMIP_bit            BANKMASK(IPR2), 6
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x1CE11);	// @ (0x39C2 * 8 + 1)
#define                                 CMP1MD_bit          BANKMASK(PMD2), 1
// PMD2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x1CE12);	// @ (0x39C2 * 8 + 2)
#define                                 CMP2MD_bit          BANKMASK(PMD2), 2
// I2C1PIE<CNT1IE>
extern volatile __bit                   CNT1IE              __at(0x1EBD7);	// @ (0x3D7A * 8 + 7)
#define                                 CNT1IE_bit          BANKMASK(I2C1PIE), 7
// I2C1PIR<CNT1IF>
extern volatile __bit                   CNT1IF              __at(0x1EBCF);	// @ (0x3D79 * 8 + 7)
#define                                 CNT1IF_bit          BANKMASK(I2C1PIR), 7
// I2C2PIE<CNT2IE>
extern volatile __bit                   CNT2IE              __at(0x1EB27);	// @ (0x3D64 * 8 + 7)
#define                                 CNT2IE_bit          BANKMASK(I2C2PIE), 7
// I2C2PIR<CNT2IF>
extern volatile __bit                   CNT2IF              __at(0x1EB1F);	// @ (0x3D63 * 8 + 7)
#define                                 CNT2IF_bit          BANKMASK(I2C2PIR), 7
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0x1F7C6);	// @ (0x3EF8 * 8 + 6)
#define                                 CONT_bit            BANKMASK(ADCON0), 6
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x1CED4);	// @ (0x39DA * 8 + 4)
#define                                 COSC0_bit           BANKMASK(OSCCON2), 4
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x1CED5);	// @ (0x39DA * 8 + 5)
#define                                 COSC1_bit           BANKMASK(OSCCON2), 5
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x1CED6);	// @ (0x39DA * 8 + 6)
#define                                 COSC2_bit           BANKMASK(OSCCON2), 6
// SMT1CON0<CPOL>
extern volatile __bit                   CPOL                __at(0x1F8F2);	// @ (0x3F1E * 8 + 2)
#define                                 CPOL_bit            BANKMASK(SMT1CON0), 2
// ADCP<CPON>
extern volatile __bit                   CPON                __at(0x1F6BF);	// @ (0x3ED7 * 8 + 7)
#define                                 CPON_bit            BANKMASK(ADCP), 7
// SMT1CPRL<CPR0>
