LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
#define                                 CWG2DBR1_bit        BANKMASK(CWG2DBR), 1
// CWG2DBR<CWG2DBR2>
extern volatile __bit                   CWG2DBR2            __at(0x1FA5A);	// @ (0x3F4B * 8 + 2)
#define                                 CWG2DBR2_bit        BANKMASK(CWG2DBR), 2
// CWG2DBR<CWG2DBR3>
extern volatile __bit                   CWG2DBR3            __at(0x1FA5B);	// @ (0x3F4B * 8 + 3)
#define                                 CWG2DBR3_bit        BANKMASK(CWG2DBR), 3
// CWG2DBR<CWG2DBR4>
extern volatile __bit                   CWG2DBR4            __at(0x1FA5C);	// @ (0x3F4B * 8 + 4)
#define                                 CWG2DBR4_bit        BANKMASK(CWG2DBR), 4
// CWG2DBR<CWG2DBR5>
extern volatile __bit                   CWG2DBR5            __at(0x1FA5D);	// @ (0x3F4B * 8 + 5)
#define                                 CWG2DBR5_bit        BANKMASK(CWG2DBR), 5
// CWG2CON0<CWG2EN>
extern volatile __bit                   CWG2EN              __at(0x1FA6F);	// @ (0x3F4D * 8 + 7)
#define                                 CWG2EN_bit          BANKMASK(CWG2CON0), 7
// PIE7<CWG2IE>
extern volatile __bit                   CWG2IE              __at(0x1CCBB);	// @ (0x3997 * 8 + 3)
#define                                 CWG2IE_bit          BANKMASK(PIE7), 3
// PIR7<CWG2IF>
extern volatile __bit                   CWG2IF              __at(0x1CD3B);	// @ (0x39A7 * 8 + 3)
#define                                 CWG2IF_bit          BANKMASK(PIR7), 3
// CWG2CON1<CWG2IN>
extern volatile __bit                   CWG2IN              __at(0x1FA75);	// @ (0x3F4E * 8 + 5)
#define                                 CWG2IN_bit          BANKMASK(CWG2CON1), 5
// IPR7<CWG2IP>
extern volatile __bit                   CWG2IP              __at(0x1CC3B);	// @ (0x3987 * 8 + 3)
#define                                 CWG2IP_bit          BANKMASK(IPR7), 3
// CWG2ISM<CWG2ISM0>
extern volatile __bit                   CWG2ISM0            __at(0x1FA50);	// @ (0x3F4A * 8 + 0)
#define                                 CWG2ISM0_bit        BANKMASK(CWG2ISM), 0
// CWG2ISM<CWG2ISM1>
extern volatile __bit                   CWG2ISM1            __at(0x1FA51);	// @ (0x3F4A * 8 + 1)
#define                                 CWG2ISM1_bit        BANKMASK(CWG2ISM), 1
// CWG2ISM<CWG2ISM2>
extern volatile __bit                   CWG2ISM2            __at(0x1FA52);	// @ (0x3F4A * 8 + 2)
#define                                 CWG2ISM2_bit        BANKMASK(CWG2ISM), 2
// CWG2ISM<CWG2ISM3>
extern volatile __bit                   CWG2ISM3            __at(0x1FA53);	// @ (0x3F4A * 8 + 3)
#define                                 CWG2ISM3_bit        BANKMASK(CWG2ISM), 3
// CWG2CON0<CWG2LD>
extern volatile __bit                   CWG2LD              __at(0x1FA6E);	// @ (0x3F4D * 8 + 6)
#define                                 CWG2LD_bit          BANKMASK(CWG2CON0), 6
// CWG2AS0<CWG2LSAC0>
extern volatile __bit                   CWG2LSAC0           __at(0x1FA7A);	// @ (0x3F4F * 8 + 2)
#define                                 CWG2LSAC0_bit       BANKMASK(CWG2AS0), 2
// CWG2AS0<CWG2LSAC1>
extern volatile __bit                   CWG2LSAC1           __at(0x1FA7B);	// @ (0x3F4F * 8 + 3)
#define                                 CWG2LSAC1_bit       BANKMASK(CWG2AS0), 3
// CWG2AS0<CWG2LSBD0>
extern volatile __bit                   CWG2LSBD0           __at(0x1FA7C);	// @ (0x3F4F * 8 + 4)
#define                                 CWG2LSBD0_bit       BANKMASK(CWG2AS0), 4
// CWG2AS0<CWG2LSBD1>
extern volatile __bit                   CWG2LSBD1           __at(0x1FA7D);	// @ (0x3F4F * 8 + 5)
#define                                 CWG2LSBD1_bit       BANKMASK(CWG2AS0), 5
// PMD4<CWG2MD>
extern volatile __bit                   CWG2MD              __at(0x1CE26);	// @ (0x39C4 * 8 + 6)
#define                                 CWG2MD_bit          BANKMASK(PMD4), 6
// CWG2CON0<CWG2MODE0>
extern volatile __bit                   CWG2MODE0           __at(0x1FA68);	// @ (0x3F4D * 8 + 0)
#define                                 CWG2MODE0_bit       BANKMASK(CWG2CON0), 0
// CWG2CON0<CWG2MODE1>
extern volatile __bit                   CWG2MODE1           __at(0x1FA69);	// @ (0x3F4D * 8 + 1)
#define                                 CWG2MODE1_bit       BANKMASK(CWG2CON0), 1
// CWG2CON0<CWG2MODE2>
extern volatile __bit                   CWG2MODE2           __at(0x1FA6A);	// @ (0x3F4D * 8 + 2)
#define                                 CWG2MODE2_bit       BANKMASK(CWG2CON0), 2
// CWG2STR<CWG2OVRA>
extern volatile __bit                   CWG2OVRA            __at(0x1FA8C);	// @ (0x3F51 * 8 + 4)
#define                                 CWG2OVRA_bit        BANKMASK(CWG2STR), 4
// CWG2STR<CWG2OVRB>
extern volatile __bit                   CWG2OVRB            __at(0x1FA8D);	// @ (0x3F51 * 8 + 5)
#define                                 CWG2OVRB_bit        BANKMASK(CWG2STR), 5
// CWG2STR<CWG2OVRC>
extern volatile __bit                   CWG2OVRC            __at(0x1FA8E);	// @ (0x3F51 * 8 + 6)
#define                                 CWG2OVRC_bit        BANKMASK(CWG2STR), 6
// CWG2STR<CWG2OVRD>
extern volatile __bit                   CWG2OVRD            __at(0x1FA8F);	// @ (0x3F51 * 8 + 7)
#define                                 CWG2OVRD_bit        BANKMASK(CWG2STR), 7
// CWG2CON1<CWG2POLA>
extern volatile __bit                   CWG2POLA            __at(0x1FA70);	// @ (0x3F4E * 8 + 0)
#define                                 CWG2POLA_bit        BANKMASK(CWG2CON1), 0
// CWG2CON1<CWG2POLB>
extern volatile __bit                   CWG2POLB            __at(0x1FA71);	// @ (0x3F4E * 8 + 1)
#define                                 CWG2POLB_bit        BANKMASK(CWG2CON1), 1
// CWG2CON1<CWG2POLC>
extern volatile __bit                   CWG2POLC            __at(0x1FA72);	// @ (0x3F4E * 8 + 2)
#define                                 CWG2POLC_bit        BANKMASK(CWG2CON1), 2
// CWG2CON1<CWG2POLD>
extern volatile __bit                   CWG2POLD            __at(0x1FA73);	// @ (0x3F4E * 8 + 3)
#define                                 CWG2POLD_bit        BANKMASK(CWG2CON1), 3
// CWG2AS0<CWG2REN>
extern volatile __bit                   CWG2REN             __at(0x1FA7E);	// @ (0x3F4F * 8 + 6)
#define                                 CWG2REN_bit         BANKMASK(CWG2AS0), 6
// CWG2AS0<CWG2SHUTDOWN>
extern volatile __bit                   CWG2SHUTDOWN        __at(0x1FA7F);	// @ (0x3F4F * 8 + 7)
#define                                 CWG2SHUTDOWN_bit    BANKMASK(CWG2AS0), 7
// CWG2STR<CWG2STRA>
extern volatile __bit                   CWG2STRA            __at(0x1FA88);	// @ (0x3F51 * 8 + 0)
#define                                 CWG2STRA_bit        BANKMASK(CWG2STR), 0
// CWG2STR<CWG2STRB>
extern volatile __bit                   CWG2STRB            __at(0x1FA89);	// @ (0x3F51 * 8 + 1)
#define                                 CWG2STRB_bit        BANKMASK(CWG2STR), 1
// CWG2STR<CWG2STRC>
extern volatile __bit                   CWG2STRC            __at(0x1FA8A);	// @ (0x3F51 * 8 + 2)
#define                                 CWG2STRC_bit        BANKMASK(CWG2STR), 2
// CWG2STR<CWG2STRD>
extern volatile __bit                   CWG2STRD            __at(0x1FA8B);	// @ (0x3F51 * 8 + 3)
#define                                 CWG2STRD_bit        BANKMASK(CWG2STR), 3
// CWG3CLK<CWG3CS>
extern volatile __bit                   CWG3CS              __at(0x1FA00);	// @ (0x3F40 * 8 + 0)
#define                                 CWG3CS_bit          BANKMASK(CWG3CLK), 0
// CWG3DBF<CWG3DBF0>
extern volatile __bit                   CWG3DBF0            __at(0x1FA18);	// @ (0x3F43 * 8 + 0)
#define                                 CWG3DBF0_bit        BANKMASK(CWG3DBF), 0
// CWG3DBF<CWG3DBF1>
extern volatile __bit                   CWG3DBF1            __at(0x1FA19);	// @ (0x3F43 * 8 + 1)
#define                                 CWG3DBF1_bit        BANKMASK(CWG3DBF), 1
// CWG3DBF<CWG3DBF2>
extern volatile __bit                   CWG3DBF2            __at(0x1FA1A);	// @ (0x3F43 * 8 + 2)
#define                                 CWG3DBF2_bit        BANKMASK(CWG3DBF), 2
// CWG3DBF<CWG3DBF3>
extern volatile __bit                   CWG3DBF3            __at(0x1FA1B);	// @ (0x3F43 * 8 + 3)
#define                                 CWG3DBF3_bit        BANKMASK(CWG3DBF), 3
// CWG3DBF<CWG3DBF4>
extern volatile __bit                   CWG3DBF4            __at(0x1FA1C);	// @ (0x3F43 * 8 + 4)
#define                                 CWG3DBF4_bit        BANKMASK(CWG3DBF), 4
// CWG3DBF<CWG3DBF5>
extern volatile __bit                   CWG3DBF5            __at(0x1FA1D);	// @ (0x3F43 * 8 + 5)
#define                                 CWG3DBF5_bit        BANKMASK(CWG3DBF), 5
// CWG3DBR<CWG3DBR0>
extern volatile __bit                   CWG3DBR0            __at(0x1FA10);	// @ (0x3F42 * 8 + 0)
#define                                 CWG3DBR0_bit        BANKMASK(CWG3DBR), 0
// CWG3DBR<CWG3DBR1>
extern volatile __bit                   CWG3DBR1            __at(0x1FA11);	// @ (0x3F42 * 8 + 1)
#define                                 CWG3DBR1_bit        BANKMASK(CWG3DBR), 1
// CWG3DBR<CWG3DBR2>
extern volatile __bit                   CWG3DBR2            __at(0x1FA12);	// @ (0x3F42 * 8 + 2)
#define                                 CWG3DBR2_bit        BANKMASK(CWG3DBR), 2
// CWG3DBR<CWG3DBR3>
extern volatile __bit                   CWG3DBR3            __at(0x1FA13);	// @ (0x3F42 * 8 + 3)
#define                                 CWG3DBR3_bit        BANKMASK(CWG3DBR), 3
// CWG3DBR<CWG3DBR4>
extern volatile __bit                   CWG3DBR4            __at(0x1FA14);	// @ (0x3F42 * 8 + 4)
#define                                 CWG3DBR4_bit        BANKMASK(CWG3DBR), 4
// CWG3DBR<CWG3DBR5>
extern volatile __bit                   CWG3DBR5            __at(0x1FA15);	// @ (0x3F42 * 8 + 5)
#define                                 CWG3DBR5_bit        BANKMASK(CWG3DBR), 5
// CWG3CON0<CWG3EN>
extern volatile __bit                   CWG3EN              __at(0x1FA27);	// @ (0x3F44 * 8 + 7)
#define                                 CWG3EN_bit          BANKMASK(CWG3CON0), 7
// PIE9<CWG3IE>
extern volatile __bit                   CWG3IE              __at(0x1CCCA);	// @ (0x3999 * 8 + 2)
#define                                 CWG3IE_bit          BANKMASK(PIE9), 2
// PIR9<CWG3IF>
extern volatile __bit                   CWG3IF              __at(0x1CD4A);	// @ (0x39A9 * 8 + 2)
#define                                 CWG3IF_bit          BANKMASK(PIR9), 2
// CWG3CON1<CWG3IN>
extern volatile __bit                   CWG3IN              __at(0x1FA2D);	// @ (0x3F45 * 8 + 5)
#define                                 CWG3IN_bit          BANKMASK(CWG3CON1), 5
// IPR9<CWG3IP>
extern volatile __bit                   CWG3IP              __at(0x1CC4A);	// @ (0x3989 * 8 + 2)
#define                                 CWG3IP_bit          BANKMASK(IPR9), 2
// CWG3ISM<CWG3ISM0>
extern volatile __bit                   CWG3ISM0            __at(0x1FA08);	// @ (0x3F41 * 8 + 0)
#define                                 CWG3ISM0_bit        BANKMASK(CWG3ISM), 0
// CWG3ISM<CWG3ISM1>
extern volatile __bit                   CWG3ISM1            __at(0x1FA09);	// @ (0x3F41 * 8 + 1)
#define                                 CWG3ISM1_bit        BANKMASK(CWG3ISM), 1
// CWG3ISM<CWG3ISM2>
extern volatile __bit                   CWG3ISM2            __at(0x1FA0A);	// @ (0x3F41 * 8 + 2)
#define                                 CWG3ISM2_bit        BANKMASK(CWG3ISM), 2
// CWG3ISM<CWG3ISM3>
extern volatile __bit                   CWG3ISM3            __at(0x1FA0B);	// @ (0x3F41 * 8 + 3)
#define                                 CWG3ISM3_bit        BANKMASK(CWG3ISM), 3
// CWG3CON0<CWG3LD>
extern volatile __bit                   CWG3LD              __at(0x1FA26);	// @ (0x3F44 * 8 + 6)
#define                                 CWG3LD_bit          BANKMASK(CWG3CON0), 6
// CWG3AS0<CWG3LSAC0>
extern volatile __bit                   CWG3LSAC0           __at(0x1FA32);	// @ (0x3F46 * 8 + 2)
#define                                 CWG3LSAC0_bit       BANKMASK(CWG3AS0), 2
// CWG3AS0<CWG3LSAC1>
extern volatile __bit                   CWG3LSAC1           __at(0x1FA33);	// @ (0x3F46 * 8 + 3)
#define                                 CWG3LSAC1_bit       BANKMASK(CWG3AS0), 3
// CWG3AS0<CWG3LSBD0>
extern volatile __bit                   CWG3LSBD0           __at(0x1FA34);	// @ (0x3F46 * 8 + 4)
#define                                 CWG3LSBD0_bit       BANKMASK(CWG3AS0), 4
// CWG3AS0<CWG3LSBD1>
extern volatile __bit                   CWG3LSBD1           __at(0x1FA35);	// @ (0x3F46 * 8 + 5)
#define                                 CWG3LSBD1_bit       BANKMASK(CWG3AS0), 5
// PMD4<CWG3MD>
extern volatile __bit                   CWG3MD              __at(0x1CE27);	// @ (0x39C4 * 8 + 7)
#define                                 CWG3MD_bit          BANKMASK(PMD4), 7
// CWG3CON0<CWG3MODE0>
extern volatile __bit                   CWG3MODE0           __at(0x1FA20);	// @ (0x3F44 * 8 + 0)
#define                                 CWG3MODE0_bit       BANKMASK(CWG3CON0), 0
// CWG3CON0<CWG3MODE1>
extern volatile __bit                   CWG3MODE1           __at(0x1FA21);	// @ (0x3F44 * 8 + 1)
#define                                 CWG3MODE1_bit       BANKMASK(CWG3CON0), 1
// CWG3CON0<CWG3MODE2>
extern volatile __bit                   CWG3MODE2           __at(0x1FA22);	// @ (0x3F44 * 8 + 2)
#define                                 CWG3MODE2_bit       BANKMASK(CWG3CON0), 2
// CWG3STR<CWG3OVRA>
extern volatile __bit                   CWG3OVRA            __at(0x1FA44);	// @ (0x3F48 * 8 + 4)
#define                                 CWG3OVRA_bit        BANKMASK(CWG3STR), 4
// CWG3STR<CWG3OVRB>
extern volatile __bit                   CWG3OVRB            __at(0x1FA45);	// @ (0x3F48 * 8 + 5)
#define                                 CWG3OVRB_bit        BANKMASK(CWG3STR), 5
// CWG3STR<CWG3OVRC>
extern volatile __bit                   CWG3OVRC            __at(0x1FA46);	// @ (0x3F48 * 8 + 6)
#define                                 CWG3OVRC_bit        BANKMASK(CWG3STR), 6
// CWG3STR<CWG3OVRD>
extern volatile __bit                   CWG3OVRD            __at(0x1FA47);	// @ (0x3F48 * 8 + 7)
#define                                 CWG3OVRD_bit        BANKMASK(CWG3STR), 7
// CWG3CON1<CWG3POLA>
extern volatile __bit                   CWG3POLA            __at(0x1FA28);	// @ (0x3F45 * 8 + 0)
#define                                 CWG3POLA_bit        BANKMASK(CWG3CON1), 0
// CWG3CON1<CWG3POLB>
extern volatile __bit                   CWG3POLB            __at(0x1FA29);	// @ (0x3F45 * 8 + 1)
#define                                 CWG3POLB_bit        BANKMASK(CWG3CON1), 1
// CWG3CON1<CWG3POLC>
extern volatile __bit                   CWG3POLC            __at(0x1FA2A);	// @ (0x3F45 * 8 + 2)
#define                                 CWG3POLC_bit        BANKMASK(CWG3CON1), 2
// CWG3CON1<CWG3POLD>
extern volatile __bit                   CWG3POLD            __at(0x1FA2B);	// @ (0x3F45 * 8 + 3)
#define                                 CWG3POLD_bit        BANKMASK(CWG3CON1), 3
// CWG3AS0<CWG3REN>
extern volatile __bit                   CWG3REN             __at(0x1FA36);	// @ (0x3F46 * 8 + 6)
#define                                 CWG3REN_bit         BANKMASK(CWG3AS0), 6
// CWG3AS0<CWG3SHUTDOWN>
extern volatile __bit                   CWG3SHUTDOWN        __at(0x1FA37);	// @ (0x3F46 * 8 + 7)
#define                                 CWG3SHUTDOWN_bit    BANKMASK(CWG3AS0), 7
// CWG3STR<CWG3STRA>
extern volatile __bit                   CWG3STRA            __at(0x1FA40);	// @ (0x3F48 * 8 + 0)
#define                                 CWG3STRA_bit        BANKMASK(CWG3STR), 0
// CWG3STR<CWG3STRB>
extern volatile __bit                   CWG3STRB            __at(0x1FA41);	// @ (0x3F48 * 8 + 1)
#define                                 CWG3STRB_bit        BANKMASK(CWG3STR), 1
// CWG3STR<CWG3STRC>
extern volatile __bit                   CWG3STRC            __at(0x1FA42);	// @ (0x3F48 * 8 + 2)
#define                                 CWG3STRC_bit        BANKMASK(CWG3STR), 2
// CWG3STR<CWG3STRD>
extern volatile __bit                   CWG3STRD            __at(0x1FA43);	// @ (0x3F48 * 8 + 3)
#define                                 CWG3STRD_bit        BANKMASK(CWG3STR), 3
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x1F4F7);	// @ (0x3E9E * 8 + 7)
#define                                 DAC1EN_bit          BANKMASK(DAC1CON0), 7
// DAC1CON0<DAC1NSS>
extern volatile __bit                   DAC1NSS             __at(0x1F4F0);	// @ (0x3E9E * 8 + 0)
#define                                 DAC1NSS_bit         BANKMASK(DAC1CON0), 0
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x1F4F5);	// @ (0x3E9E * 8 + 5)
#define                                 DAC1OE1_bit         BANKMASK(DAC1CON0), 5
// DAC1CON0<DAC1OE2>
extern volatile __bit                   DAC1OE2             __at(0x1F4F4);	// @ (0x3E9E * 8 + 4)
#define                                 DAC1OE2_bit         BANKMASK(DAC1CON0), 4
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x1F4F2);	// @ (0x3E9E * 8 + 2)
#define                                 DAC1PSS0_bit        BANKMASK(DAC1CON0), 2
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x1F4F3);	// @ (0x3E9E * 8 + 3)
#define                                 DAC1PSS1_bit        BANKMASK(DAC1CON0), 3
// DAC1CON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x1F4E0);	// @ (0x3E9C * 8 + 0)
#define                                 DAC1R0_bit          BANKMASK(DAC1CON1), 0
// DAC1CON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x1F4E1);	// @ (0x3E9C * 8 + 1)
#define                                 DAC1R1_bit          BANKMASK(DAC1CON1), 1
// DAC1CON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x1F4E2);	// @ (0x3E9C * 8 + 2)
#define                                 DAC1R2_bit          BANKMASK(DAC1CON1), 2
// DAC1CON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x1F4E3);	// @ (0x3E9C * 8 + 3)
#define                                 DAC1R3_bit          BANKMASK(DAC1CON1), 3
// DAC1CON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x1F4E4);	// @ (0x3E9C * 8 + 4)
#define                                 DAC1R4_bit          BANKMASK(DAC1CON1), 4
// PMD2<DACMD>
extern volatile __bit                   DACMD               __at(0x1CE16);	// @ (0x39C2 * 8 + 6)
#define                                 DACMD_bit           BANKMASK(PMD2), 6
// NVMDAT<DAT0>
extern volatile __bit                   DAT0                __at(0x1CF18);	// @ (0x39E3 * 8 + 0)
#define                                 DAT0_bit            BANKMASK(NVMDAT), 0
// NVMDAT<DAT1>
extern volatile __bit                   DAT1                __at(0x1CF19);	// @ (0x39E3 * 8 + 1)
#define                                 DAT1_bit            BANKMASK(NVMDAT), 1
// NVMDAT<DAT2>
extern volatile __bit                   DAT2                __at(0x1CF1A);	// @ (0x39E3 * 8 + 2)
#define                                 DAT2_bit            BANKMASK(NVMDAT), 2
// NVMDAT<DAT3>
extern volatile __bit                   DAT3                __at(0x1CF1B);	// @ (0x39E3 * 8 + 3)
#define                                 DAT3_bit            BANKMASK(NVMDAT), 3
// NVMDAT<DAT4>
extern volatile __bit                   DAT4                __at(0x1CF1C);	// @ (0x39E3 * 8 + 4)
#define                                 DAT4_bit            BANKMASK(NVMDAT), 4
// NVMDAT<DAT5>
extern volatile __bit                   DAT5                __at(0x1CF1D);	// @ (0x39E3 * 8 + 5)
#define                                 DAT5_bit            BANKMASK(NVMDAT), 5
// NVMDAT<DAT6>
extern volatile __bit                   DAT6                __at(0x1CF1E);	// @ (0x39E3 * 8 + 6)
#define                                 DAT6_bit            BANKMASK(NVMDAT), 6
// NVMDAT<DAT7>
extern volatile __bit                   DAT7                __at(0x1CF1F);	// @ (0x39E3 * 8 + 7)
#define                                 DAT7_bit            BANKMASK(NVMDAT), 7
// CRCDATL<DATA0>
extern volatile __bit                   DATA0               __at(0x1CB00);	// @ (0x3960 * 8 + 0)
#define                                 DATA0_bit           BANKMASK(CRCDATL), 0
// CRCDATL<DATA1>
extern volatile __bit                   DATA1               __at(0x1CB01);	// @ (0x3960 * 8 + 1)
#define                                 DATA1_bit           BANKMASK(CRCDATL), 1
// CRCDATH<DATA10>
extern volatile __bit                   DATA10              __at(0x1CB0A);	// @ (0x3961 * 8 + 2)
#define                                 DATA10_bit          BANKMASK(CRCDATH), 2
// CRCDATH<DATA11>
extern volatile __bit                   DATA11              __at(0x1CB0B);	// @ (0x3961 * 8 + 3)
#define                                 DATA11_bit          BANKMASK(CRCDATH), 3
// CRCDATH<DATA12>
extern volatile __bit                   DATA12              __at(0x1CB0C);	// @ (0x3961 * 8 + 4)
#define                                 DATA12_bit          BANKMASK(CRCDATH), 4
// CRCDATH<DATA13>
extern volatile __bit                   DATA13              __at(0x1CB0D);	// @ (0x3961 * 8 + 5)
#define                                 DATA13_bit          BANKMASK(CRCDATH), 5
// CRCDATH<DATA14>
extern volatile __bit                   DATA14              __at(0x1CB0E);	// @ (0x3961 * 8 + 6)
#define                                 DATA14_bit          BANKMASK(CRCDATH), 6
// CRCDATH<DATA15>
extern volatile __bit                   DATA15              __at(0x1CB0F);	// @ (0x3961 * 8 + 7)
#define                                 DATA15_bit          BANKMASK(CRCDATH), 7
// CRCDATL<DATA2>
extern volatile __bit                   DATA2               __at(0x1CB02);	// @ (0x3960 * 8 + 2)
#define                                 DATA2_bit           BANKMASK(CRCDATL), 2
// CRCDATL<DATA3>
extern volatile __bit                   DATA3               __at(0x1CB03);	// @ (0x3960 * 8 + 3)
#define                                 DATA3_bit           BANKMASK(CRCDATL), 3
// CRCDATL<DATA4>
extern volatile __bit                   DATA4               __at(0x1CB04);	// @ (0x3960 * 8 + 4)
#define                                 DATA4_bit           BANKMASK(CRCDATL), 4
// CRCDATL<DATA5>
extern volatile __bit                   DATA5               __at(0x1CB05);	// @ (0x3960 * 8 + 5)
#define                                 DATA5_bit           BANKMASK(CRCDATL), 5
// CRCDATL<DATA6>
extern volatile __bit                   DATA6               __at(0x1CB06);	// @ (0x3960 * 8 + 6)
#define                                 DATA6_bit           BANKMASK(CRCDATL), 6
// CRCDATL<DATA7>
extern volatile __bit                   DATA7               __at(0x1CB07);	// @ (0x3960 * 8 + 7)
#define                                 DATA7_bit           BANKMASK(CRCDATL), 7
// CRCDATH<DATA8>
extern volatile __bit                   DATA8               __at(0x1CB08);	// @ (0x3961 * 8 + 0)
#define                                 DATA8_bit           BANKMASK(CRCDATH), 0
// CRCDATH<DATA9>
extern volatile __bit                   DATA9               __at(0x1CB09);	// @ (0x3961 * 8 + 1)
#define                                 DATA9_bit           BANKMASK(CRCDATH), 1
// CRCCON1<DLEN0>
extern volatile __bit                   DLEN0               __at(0x1CB4C);	// @ (0x3969 * 8 + 4)
#define                                 DLEN0_bit           BANKMASK(CRCCON1), 4
// CRCCON1<DLEN1>
extern volatile __bit                   DLEN1               __at(0x1CB4D);	// @ (0x3969 * 8 + 5)
#define                                 DLEN1_bit           BANKMASK(CRCCON1), 5
// CRCCON1<DLEN2>
extern volatile __bit                   DLEN2               __at(0x1CB4E);	// @ (0x3969 * 8 + 6)
#define                                 DLEN2_bit           BANKMASK(CRCCON1), 6
// CRCCON1<DLEN3>
extern volatile __bit                   DLEN3               __at(0x1CB4F);	// @ (0x3969 * 8 + 7)
