LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
#define                                 DLEN3_bit           BANKMASK(CRCCON1), 7
// PIE2<DMA1AIE>
extern volatile __bit                   DMA1AIE             __at(0x1CC93);	// @ (0x3992 * 8 + 3)
#define                                 DMA1AIE_bit         BANKMASK(PIE2), 3
// PIR2<DMA1AIF>
extern volatile __bit                   DMA1AIF             __at(0x1CD13);	// @ (0x39A2 * 8 + 3)
#define                                 DMA1AIF_bit         BANKMASK(PIR2), 3
// IPR2<DMA1AIP>
extern volatile __bit                   DMA1AIP             __at(0x1CC13);	// @ (0x3982 * 8 + 3)
#define                                 DMA1AIP_bit         BANKMASK(IPR2), 3
// DMA1AIRQ<DMA1AIRQ0>
extern volatile __bit                   DMA1AIRQ0           __at(0x1DFF0);	// @ (0x3BFE * 8 + 0)
#define                                 DMA1AIRQ0_bit       BANKMASK(DMA1AIRQ), 0
// DMA1AIRQ<DMA1AIRQ1>
extern volatile __bit                   DMA1AIRQ1           __at(0x1DFF1);	// @ (0x3BFE * 8 + 1)
#define                                 DMA1AIRQ1_bit       BANKMASK(DMA1AIRQ), 1
// DMA1AIRQ<DMA1AIRQ2>
extern volatile __bit                   DMA1AIRQ2           __at(0x1DFF2);	// @ (0x3BFE * 8 + 2)
#define                                 DMA1AIRQ2_bit       BANKMASK(DMA1AIRQ), 2
// DMA1AIRQ<DMA1AIRQ3>
extern volatile __bit                   DMA1AIRQ3           __at(0x1DFF3);	// @ (0x3BFE * 8 + 3)
#define                                 DMA1AIRQ3_bit       BANKMASK(DMA1AIRQ), 3
// DMA1AIRQ<DMA1AIRQ4>
extern volatile __bit                   DMA1AIRQ4           __at(0x1DFF4);	// @ (0x3BFE * 8 + 4)
#define                                 DMA1AIRQ4_bit       BANKMASK(DMA1AIRQ), 4
// DMA1AIRQ<DMA1AIRQ5>
extern volatile __bit                   DMA1AIRQ5           __at(0x1DFF5);	// @ (0x3BFE * 8 + 5)
#define                                 DMA1AIRQ5_bit       BANKMASK(DMA1AIRQ), 5
// DMA1AIRQ<DMA1AIRQ6>
extern volatile __bit                   DMA1AIRQ6           __at(0x1DFF6);	// @ (0x3BFE * 8 + 6)
#define                                 DMA1AIRQ6_bit       BANKMASK(DMA1AIRQ), 6
// DMA1CON0<DMA1AIRQEN>
extern volatile __bit                   DMA1AIRQEN          __at(0x1DFE2);	// @ (0x3BFC * 8 + 2)
#define                                 DMA1AIRQEN_bit      BANKMASK(DMA1CON0), 2
// DMA1BUF<DMA1BUF0>
extern volatile __bit                   DMA1BUF0            __at(0x1DF48);	// @ (0x3BE9 * 8 + 0)
#define                                 DMA1BUF0_bit        BANKMASK(DMA1BUF), 0
// DMA1BUF<DMA1BUF1>
extern volatile __bit                   DMA1BUF1            __at(0x1DF49);	// @ (0x3BE9 * 8 + 1)
#define                                 DMA1BUF1_bit        BANKMASK(DMA1BUF), 1
// DMA1BUF<DMA1BUF2>
extern volatile __bit                   DMA1BUF2            __at(0x1DF4A);	// @ (0x3BE9 * 8 + 2)
#define                                 DMA1BUF2_bit        BANKMASK(DMA1BUF), 2
// DMA1BUF<DMA1BUF3>
extern volatile __bit                   DMA1BUF3            __at(0x1DF4B);	// @ (0x3BE9 * 8 + 3)
#define                                 DMA1BUF3_bit        BANKMASK(DMA1BUF), 3
// DMA1BUF<DMA1BUF4>
extern volatile __bit                   DMA1BUF4            __at(0x1DF4C);	// @ (0x3BE9 * 8 + 4)
#define                                 DMA1BUF4_bit        BANKMASK(DMA1BUF), 4
// DMA1BUF<DMA1BUF5>
extern volatile __bit                   DMA1BUF5            __at(0x1DF4D);	// @ (0x3BE9 * 8 + 5)
#define                                 DMA1BUF5_bit        BANKMASK(DMA1BUF), 5
// DMA1BUF<DMA1BUF6>
extern volatile __bit                   DMA1BUF6            __at(0x1DF4E);	// @ (0x3BE9 * 8 + 6)
#define                                 DMA1BUF6_bit        BANKMASK(DMA1BUF), 6
// DMA1BUF<DMA1BUF7>
extern volatile __bit                   DMA1BUF7            __at(0x1DF4F);	// @ (0x3BE9 * 8 + 7)
#define                                 DMA1BUF7_bit        BANKMASK(DMA1BUF), 7
// DMA1DCNTL<DMA1DCNT0>
extern volatile __bit                   DMA1DCNT0           __at(0x1DF50);	// @ (0x3BEA * 8 + 0)
#define                                 DMA1DCNT0_bit       BANKMASK(DMA1DCNTL), 0
// DMA1DCNTL<DMA1DCNT1>
extern volatile __bit                   DMA1DCNT1           __at(0x1DF51);	// @ (0x3BEA * 8 + 1)
#define                                 DMA1DCNT1_bit       BANKMASK(DMA1DCNTL), 1
// DMA1DCNTH<DMA1DCNT10>
extern volatile __bit                   DMA1DCNT10          __at(0x1DF5A);	// @ (0x3BEB * 8 + 2)
#define                                 DMA1DCNT10_bit      BANKMASK(DMA1DCNTH), 2
// DMA1DCNTH<DMA1DCNT11>
extern volatile __bit                   DMA1DCNT11          __at(0x1DF5B);	// @ (0x3BEB * 8 + 3)
#define                                 DMA1DCNT11_bit      BANKMASK(DMA1DCNTH), 3
// DMA1DCNTL<DMA1DCNT2>
extern volatile __bit                   DMA1DCNT2           __at(0x1DF52);	// @ (0x3BEA * 8 + 2)
#define                                 DMA1DCNT2_bit       BANKMASK(DMA1DCNTL), 2
// DMA1DCNTL<DMA1DCNT3>
extern volatile __bit                   DMA1DCNT3           __at(0x1DF53);	// @ (0x3BEA * 8 + 3)
#define                                 DMA1DCNT3_bit       BANKMASK(DMA1DCNTL), 3
// DMA1DCNTL<DMA1DCNT4>
extern volatile __bit                   DMA1DCNT4           __at(0x1DF54);	// @ (0x3BEA * 8 + 4)
#define                                 DMA1DCNT4_bit       BANKMASK(DMA1DCNTL), 4
// DMA1DCNTL<DMA1DCNT5>
extern volatile __bit                   DMA1DCNT5           __at(0x1DF55);	// @ (0x3BEA * 8 + 5)
#define                                 DMA1DCNT5_bit       BANKMASK(DMA1DCNTL), 5
// DMA1DCNTL<DMA1DCNT6>
extern volatile __bit                   DMA1DCNT6           __at(0x1DF56);	// @ (0x3BEA * 8 + 6)
#define                                 DMA1DCNT6_bit       BANKMASK(DMA1DCNTL), 6
// DMA1DCNTL<DMA1DCNT7>
extern volatile __bit                   DMA1DCNT7           __at(0x1DF57);	// @ (0x3BEA * 8 + 7)
#define                                 DMA1DCNT7_bit       BANKMASK(DMA1DCNTL), 7
// DMA1DCNTH<DMA1DCNT8>
extern volatile __bit                   DMA1DCNT8           __at(0x1DF58);	// @ (0x3BEB * 8 + 0)
#define                                 DMA1DCNT8_bit       BANKMASK(DMA1DCNTH), 0
// DMA1DCNTH<DMA1DCNT9>
extern volatile __bit                   DMA1DCNT9           __at(0x1DF59);	// @ (0x3BEB * 8 + 1)
#define                                 DMA1DCNT9_bit       BANKMASK(DMA1DCNTH), 1
// PIE2<DMA1DCNTIE>
extern volatile __bit                   DMA1DCNTIE          __at(0x1CC91);	// @ (0x3992 * 8 + 1)
#define                                 DMA1DCNTIE_bit      BANKMASK(PIE2), 1
// PIR2<DMA1DCNTIF>
extern volatile __bit                   DMA1DCNTIF          __at(0x1CD11);	// @ (0x39A2 * 8 + 1)
#define                                 DMA1DCNTIF_bit      BANKMASK(PIR2), 1
// IPR2<DMA1DCNTIP>
extern volatile __bit                   DMA1DCNTIP          __at(0x1CC11);	// @ (0x3982 * 8 + 1)
#define                                 DMA1DCNTIP_bit      BANKMASK(IPR2), 1
// DMA1CON0<DMA1DGO>
extern volatile __bit                   DMA1DGO             __at(0x1DFE5);	// @ (0x3BFC * 8 + 5)
#define                                 DMA1DGO_bit         BANKMASK(DMA1CON0), 5
// DMA1DPTRL<DMA1DPTR0>
extern volatile __bit                   DMA1DPTR0           __at(0x1DF60);	// @ (0x3BEC * 8 + 0)
#define                                 DMA1DPTR0_bit       BANKMASK(DMA1DPTRL), 0
// DMA1DPTRL<DMA1DPTR1>
extern volatile __bit                   DMA1DPTR1           __at(0x1DF61);	// @ (0x3BEC * 8 + 1)
#define                                 DMA1DPTR1_bit       BANKMASK(DMA1DPTRL), 1
// DMA1DPTRH<DMA1DPTR10>
extern volatile __bit                   DMA1DPTR10          __at(0x1DF6A);	// @ (0x3BED * 8 + 2)
#define                                 DMA1DPTR10_bit      BANKMASK(DMA1DPTRH), 2
// DMA1DPTRH<DMA1DPTR11>
extern volatile __bit                   DMA1DPTR11          __at(0x1DF6B);	// @ (0x3BED * 8 + 3)
#define                                 DMA1DPTR11_bit      BANKMASK(DMA1DPTRH), 3
// DMA1DPTRH<DMA1DPTR12>
extern volatile __bit                   DMA1DPTR12          __at(0x1DF6C);	// @ (0x3BED * 8 + 4)
#define                                 DMA1DPTR12_bit      BANKMASK(DMA1DPTRH), 4
// DMA1DPTRH<DMA1DPTR13>
extern volatile __bit                   DMA1DPTR13          __at(0x1DF6D);	// @ (0x3BED * 8 + 5)
#define                                 DMA1DPTR13_bit      BANKMASK(DMA1DPTRH), 5
// DMA1DPTRH<DMA1DPTR14>
extern volatile __bit                   DMA1DPTR14          __at(0x1DF6E);	// @ (0x3BED * 8 + 6)
#define                                 DMA1DPTR14_bit      BANKMASK(DMA1DPTRH), 6
// DMA1DPTRH<DMA1DPTR15>
extern volatile __bit                   DMA1DPTR15          __at(0x1DF6F);	// @ (0x3BED * 8 + 7)
#define                                 DMA1DPTR15_bit      BANKMASK(DMA1DPTRH), 7
// DMA1DPTRL<DMA1DPTR2>
extern volatile __bit                   DMA1DPTR2           __at(0x1DF62);	// @ (0x3BEC * 8 + 2)
#define                                 DMA1DPTR2_bit       BANKMASK(DMA1DPTRL), 2
// DMA1DPTRL<DMA1DPTR3>
extern volatile __bit                   DMA1DPTR3           __at(0x1DF63);	// @ (0x3BEC * 8 + 3)
#define                                 DMA1DPTR3_bit       BANKMASK(DMA1DPTRL), 3
// DMA1DPTRL<DMA1DPTR4>
extern volatile __bit                   DMA1DPTR4           __at(0x1DF64);	// @ (0x3BEC * 8 + 4)
#define                                 DMA1DPTR4_bit       BANKMASK(DMA1DPTRL), 4
// DMA1DPTRL<DMA1DPTR5>
extern volatile __bit                   DMA1DPTR5           __at(0x1DF65);	// @ (0x3BEC * 8 + 5)
#define                                 DMA1DPTR5_bit       BANKMASK(DMA1DPTRL), 5
// DMA1DPTRL<DMA1DPTR6>
extern volatile __bit                   DMA1DPTR6           __at(0x1DF66);	// @ (0x3BEC * 8 + 6)
#define                                 DMA1DPTR6_bit       BANKMASK(DMA1DPTRL), 6
// DMA1DPTRL<DMA1DPTR7>
extern volatile __bit                   DMA1DPTR7           __at(0x1DF67);	// @ (0x3BEC * 8 + 7)
#define                                 DMA1DPTR7_bit       BANKMASK(DMA1DPTRL), 7
// DMA1DPTRH<DMA1DPTR8>
extern volatile __bit                   DMA1DPTR8           __at(0x1DF68);	// @ (0x3BED * 8 + 0)
#define                                 DMA1DPTR8_bit       BANKMASK(DMA1DPTRH), 0
// DMA1DPTRH<DMA1DPTR9>
extern volatile __bit                   DMA1DPTR9           __at(0x1DF69);	// @ (0x3BED * 8 + 1)
#define                                 DMA1DPTR9_bit       BANKMASK(DMA1DPTRH), 1
// DMA1DSAL<DMA1DSA0>
extern volatile __bit                   DMA1DSA0            __at(0x1DF80);	// @ (0x3BF0 * 8 + 0)
#define                                 DMA1DSA0_bit        BANKMASK(DMA1DSAL), 0
// DMA1DSAL<DMA1DSA1>
extern volatile __bit                   DMA1DSA1            __at(0x1DF81);	// @ (0x3BF0 * 8 + 1)
#define                                 DMA1DSA1_bit        BANKMASK(DMA1DSAL), 1
// DMA1DSAH<DMA1DSA10>
extern volatile __bit                   DMA1DSA10           __at(0x1DF8A);	// @ (0x3BF1 * 8 + 2)
#define                                 DMA1DSA10_bit       BANKMASK(DMA1DSAH), 2
// DMA1DSAH<DMA1DSA11>
extern volatile __bit                   DMA1DSA11           __at(0x1DF8B);	// @ (0x3BF1 * 8 + 3)
#define                                 DMA1DSA11_bit       BANKMASK(DMA1DSAH), 3
// DMA1DSAH<DMA1DSA12>
extern volatile __bit                   DMA1DSA12           __at(0x1DF8C);	// @ (0x3BF1 * 8 + 4)
#define                                 DMA1DSA12_bit       BANKMASK(DMA1DSAH), 4
// DMA1DSAH<DMA1DSA13>
extern volatile __bit                   DMA1DSA13           __at(0x1DF8D);	// @ (0x3BF1 * 8 + 5)
#define                                 DMA1DSA13_bit       BANKMASK(DMA1DSAH), 5
// DMA1DSAH<DMA1DSA14>
extern volatile __bit                   DMA1DSA14           __at(0x1DF8E);	// @ (0x3BF1 * 8 + 6)
#define                                 DMA1DSA14_bit       BANKMASK(DMA1DSAH), 6
// DMA1DSAH<DMA1DSA15>
extern volatile __bit                   DMA1DSA15           __at(0x1DF8F);	// @ (0x3BF1 * 8 + 7)
#define                                 DMA1DSA15_bit       BANKMASK(DMA1DSAH), 7
// DMA1DSAL<DMA1DSA2>
extern volatile __bit                   DMA1DSA2            __at(0x1DF82);	// @ (0x3BF0 * 8 + 2)
#define                                 DMA1DSA2_bit        BANKMASK(DMA1DSAL), 2
// DMA1DSAL<DMA1DSA3>
extern volatile __bit                   DMA1DSA3            __at(0x1DF83);	// @ (0x3BF0 * 8 + 3)
#define                                 DMA1DSA3_bit        BANKMASK(DMA1DSAL), 3
// DMA1DSAL<DMA1DSA4>
extern volatile __bit                   DMA1DSA4            __at(0x1DF84);	// @ (0x3BF0 * 8 + 4)
#define                                 DMA1DSA4_bit        BANKMASK(DMA1DSAL), 4
// DMA1DSAL<DMA1DSA5>
extern volatile __bit                   DMA1DSA5            __at(0x1DF85);	// @ (0x3BF0 * 8 + 5)
#define                                 DMA1DSA5_bit        BANKMASK(DMA1DSAL), 5
// DMA1DSAL<DMA1DSA6>
extern volatile __bit                   DMA1DSA6            __at(0x1DF86);	// @ (0x3BF0 * 8 + 6)
#define                                 DMA1DSA6_bit        BANKMASK(DMA1DSAL), 6
// DMA1DSAL<DMA1DSA7>
extern volatile __bit                   DMA1DSA7            __at(0x1DF87);	// @ (0x3BF0 * 8 + 7)
#define                                 DMA1DSA7_bit        BANKMASK(DMA1DSAL), 7
// DMA1DSAH<DMA1DSA8>
extern volatile __bit                   DMA1DSA8            __at(0x1DF88);	// @ (0x3BF1 * 8 + 0)
#define                                 DMA1DSA8_bit        BANKMASK(DMA1DSAH), 0
// DMA1DSAH<DMA1DSA9>
extern volatile __bit                   DMA1DSA9            __at(0x1DF89);	// @ (0x3BF1 * 8 + 1)
#define                                 DMA1DSA9_bit        BANKMASK(DMA1DSAH), 1
// DMA1DSZL<DMA1DSZ0>
extern volatile __bit                   DMA1DSZ0            __at(0x1DF70);	// @ (0x3BEE * 8 + 0)
#define                                 DMA1DSZ0_bit        BANKMASK(DMA1DSZL), 0
// DMA1DSZL<DMA1DSZ1>
extern volatile __bit                   DMA1DSZ1            __at(0x1DF71);	// @ (0x3BEE * 8 + 1)
#define                                 DMA1DSZ1_bit        BANKMASK(DMA1DSZL), 1
// DMA1DSZH<DMA1DSZ10>
extern volatile __bit                   DMA1DSZ10           __at(0x1DF7A);	// @ (0x3BEF * 8 + 2)
#define                                 DMA1DSZ10_bit       BANKMASK(DMA1DSZH), 2
// DMA1DSZH<DMA1DSZ11>
extern volatile __bit                   DMA1DSZ11           __at(0x1DF7B);	// @ (0x3BEF * 8 + 3)
#define                                 DMA1DSZ11_bit       BANKMASK(DMA1DSZH), 3
// DMA1DSZL<DMA1DSZ2>
extern volatile __bit                   DMA1DSZ2            __at(0x1DF72);	// @ (0x3BEE * 8 + 2)
#define                                 DMA1DSZ2_bit        BANKMASK(DMA1DSZL), 2
// DMA1DSZL<DMA1DSZ3>
extern volatile __bit                   DMA1DSZ3            __at(0x1DF73);	// @ (0x3BEE * 8 + 3)
#define                                 DMA1DSZ3_bit        BANKMASK(DMA1DSZL), 3
// DMA1DSZL<DMA1DSZ4>
extern volatile __bit                   DMA1DSZ4            __at(0x1DF74);	// @ (0x3BEE * 8 + 4)
#define                                 DMA1DSZ4_bit        BANKMASK(DMA1DSZL), 4
// DMA1DSZL<DMA1DSZ5>
extern volatile __bit                   DMA1DSZ5            __at(0x1DF75);	// @ (0x3BEE * 8 + 5)
#define                                 DMA1DSZ5_bit        BANKMASK(DMA1DSZL), 5
// DMA1DSZL<DMA1DSZ6>
extern volatile __bit                   DMA1DSZ6            __at(0x1DF76);	// @ (0x3BEE * 8 + 6)
#define                                 DMA1DSZ6_bit        BANKMASK(DMA1DSZL), 6
// DMA1DSZL<DMA1DSZ7>
extern volatile __bit                   DMA1DSZ7            __at(0x1DF77);	// @ (0x3BEE * 8 + 7)
#define                                 DMA1DSZ7_bit        BANKMASK(DMA1DSZL), 7
// DMA1DSZH<DMA1DSZ8>
extern volatile __bit                   DMA1DSZ8            __at(0x1DF78);	// @ (0x3BEF * 8 + 0)
#define                                 DMA1DSZ8_bit        BANKMASK(DMA1DSZH), 0
// DMA1DSZH<DMA1DSZ9>
extern volatile __bit                   DMA1DSZ9            __at(0x1DF79);	// @ (0x3BEF * 8 + 1)
#define                                 DMA1DSZ9_bit        BANKMASK(DMA1DSZH), 1
// DMA1CON0<DMA1EN>
extern volatile __bit                   DMA1EN              __at(0x1DFE7);	// @ (0x3BFC * 8 + 7)
#define                                 DMA1EN_bit          BANKMASK(DMA1CON0), 7
// PMD7<DMA1MD>
extern volatile __bit                   DMA1MD              __at(0x1CE38);	// @ (0x39C7 * 8 + 0)
#define                                 DMA1MD_bit          BANKMASK(PMD7), 0
// PIE2<DMA1ORIE>
extern volatile __bit                   DMA1ORIE            __at(0x1CC92);	// @ (0x3992 * 8 + 2)
#define                                 DMA1ORIE_bit        BANKMASK(PIE2), 2
// PIR2<DMA1ORIF>
extern volatile __bit                   DMA1ORIF            __at(0x1CD12);	// @ (0x39A2 * 8 + 2)
#define                                 DMA1ORIF_bit        BANKMASK(PIR2), 2
// IPR2<DMA1ORIP>
extern volatile __bit                   DMA1ORIP            __at(0x1CC12);	// @ (0x3982 * 8 + 2)
#define                                 DMA1ORIP_bit        BANKMASK(IPR2), 2
// DMA1PR<DMA1PR0>
extern volatile __bit                   DMA1PR0             __at(0x1CF98);	// @ (0x39F3 * 8 + 0)
#define                                 DMA1PR0_bit         BANKMASK(DMA1PR), 0
// DMA1PR<DMA1PR1>
extern volatile __bit                   DMA1PR1             __at(0x1CF99);	// @ (0x39F3 * 8 + 1)
#define                                 DMA1PR1_bit         BANKMASK(DMA1PR), 1
// DMA1PR<DMA1PR2>
extern volatile __bit                   DMA1PR2             __at(0x1CF9A);	// @ (0x39F3 * 8 + 2)
#define                                 DMA1PR2_bit         BANKMASK(DMA1PR), 2
// DMA1SCNTL<DMA1SCNT0>
extern volatile __bit                   DMA1SCNT0           __at(0x1DF90);	// @ (0x3BF2 * 8 + 0)
#define                                 DMA1SCNT0_bit       BANKMASK(DMA1SCNTL), 0
// DMA1SCNTL<DMA1SCNT1>
extern volatile __bit                   DMA1SCNT1           __at(0x1DF91);	// @ (0x3BF2 * 8 + 1)
#define                                 DMA1SCNT1_bit       BANKMASK(DMA1SCNTL), 1
// DMA1SCNTH<DMA1SCNT10>
extern volatile __bit                   DMA1SCNT10          __at(0x1DF9A);	// @ (0x3BF3 * 8 + 2)
#define                                 DMA1SCNT10_bit      BANKMASK(DMA1SCNTH), 2
// DMA1SCNTH<DMA1SCNT11>
extern volatile __bit                   DMA1SCNT11          __at(0x1DF9B);	// @ (0x3BF3 * 8 + 3)
#define                                 DMA1SCNT11_bit      BANKMASK(DMA1SCNTH), 3
// DMA1SCNTL<DMA1SCNT2>
extern volatile __bit                   DMA1SCNT2           __at(0x1DF92);	// @ (0x3BF2 * 8 + 2)
#define                                 DMA1SCNT2_bit       BANKMASK(DMA1SCNTL), 2
// DMA1SCNTL<DMA1SCNT3>
extern volatile __bit                   DMA1SCNT3           __at(0x1DF93);	// @ (0x3BF2 * 8 + 3)
#define                                 DMA1SCNT3_bit       BANKMASK(DMA1SCNTL), 3
// DMA1SCNTL<DMA1SCNT4>
extern volatile __bit                   DMA1SCNT4           __at(0x1DF94);	// @ (0x3BF2 * 8 + 4)
#define                                 DMA1SCNT4_bit       BANKMASK(DMA1SCNTL), 4
// DMA1SCNTL<DMA1SCNT5>
extern volatile __bit                   DMA1SCNT5           __at(0x1DF95);	// @ (0x3BF2 * 8 + 5)
#define                                 DMA1SCNT5_bit       BANKMASK(DMA1SCNTL), 5
// DMA1SCNTL<DMA1SCNT6>
extern volatile __bit                   DMA1SCNT6           __at(0x1DF96);	// @ (0x3BF2 * 8 + 6)
#define                                 DMA1SCNT6_bit       BANKMASK(DMA1SCNTL), 6
// DMA1SCNTL<DMA1SCNT7>
extern volatile __bit                   DMA1SCNT7           __at(0x1DF97);	// @ (0x3BF2 * 8 + 7)
#define                                 DMA1SCNT7_bit       BANKMASK(DMA1SCNTL), 7
// DMA1SCNTH<DMA1SCNT8>
extern volatile __bit                   DMA1SCNT8           __at(0x1DF98);	// @ (0x3BF3 * 8 + 0)
#define                                 DMA1SCNT8_bit       BANKMASK(DMA1SCNTH), 0
// DMA1SCNTH<DMA1SCNT9>
extern volatile __bit                   DMA1SCNT9           __at(0x1DF99);	// @ (0x3BF3 * 8 + 1)
#define                                 DMA1SCNT9_bit       BANKMASK(DMA1SCNTH), 1
// PIE2<DMA1SCNTIE>
extern volatile __bit                   DMA1SCNTIE          __at(0x1CC90);	// @ (0x3992 * 8 + 0)
#define                                 DMA1SCNTIE_bit      BANKMASK(PIE2), 0
// PIR2<DMA1SCNTIF>
extern volatile __bit                   DMA1SCNTIF          __at(0x1CD10);	// @ (0x39A2 * 8 + 0)
#define                                 DMA1SCNTIF_bit      BANKMASK(PIR2), 0
// IPR2<DMA1SCNTIP>
extern volatile __bit                   DMA1SCNTIP          __at(0x1CC10);	// @ (0x3982 * 8 + 0)
#define                                 DMA1SCNTIP_bit      BANKMASK(IPR2), 0
// DMA1SIRQ<DMA1SIRQ0>
extern volatile __bit                   DMA1SIRQ0           __at(0x1DFF8);	// @ (0x3BFF * 8 + 0)
#define                                 DMA1SIRQ0_bit       BANKMASK(DMA1SIRQ), 0
// DMA1SIRQ<DMA1SIRQ1>
extern volatile __bit                   DMA1SIRQ1           __at(0x1DFF9);	// @ (0x3BFF * 8 + 1)
#define                                 DMA1SIRQ1_bit       BANKMASK(DMA1SIRQ), 1
// DMA1SIRQ<DMA1SIRQ2>
extern volatile __bit                   DMA1SIRQ2           __at(0x1DFFA);	// @ (0x3BFF * 8 + 2)
#define                                 DMA1SIRQ2_bit       BANKMASK(DMA1SIRQ), 2
// DMA1SIRQ<DMA1SIRQ3>
extern volatile __bit                   DMA1SIRQ3           __at(0x1DFFB);	// @ (0x3BFF * 8 + 3)
#define                                 DMA1SIRQ3_bit       BANKMASK(DMA1SIRQ), 3
// DMA1SIRQ<DMA1SIRQ4>
extern volatile __bit                   DMA1SIRQ4           __at(0x1DFFC);	// @ (0x3BFF * 8 + 4)
#define                                 DMA1SIRQ4_bit       BANKMASK(DMA1SIRQ), 4
// DMA1SIRQ<DMA1SIRQ5>
extern volatile __bit                   DMA1SIRQ5           __at(0x1DFFD);	// @ (0x3BFF * 8 + 5)
#define                                 DMA1SIRQ5_bit       BANKMASK(DMA1SIRQ), 5
// DMA1SIRQ<DMA1SIRQ6>
extern volatile __bit                   DMA1SIRQ6           __at(0x1DFFE);	// @ (0x3BFF * 8 + 6)
#define                                 DMA1SIRQ6_bit       BANKMASK(DMA1SIRQ), 6
// DMA1CON0<DMA1SIRQEN>
extern volatile __bit                   DMA1SIRQEN          __at(0x1DFE6);	// @ (0x3BFC * 8 + 6)
#define                                 DMA1SIRQEN_bit      BANKMASK(DMA1CON0), 6
// DMA1SPTRL<DMA1SPTR0>
extern volatile __bit                   DMA1SPTR0           __at(0x1DFA0);	// @ (0x3BF4 * 8 + 0)
#define                                 DMA1SPTR0_bit       BANKMASK(DMA1SPTRL), 0
// DMA1SPTRL<DMA1SPTR1>
extern volatile __bit                   DMA1SPTR1           __at(0x1DFA1);	// @ (0x3BF4 * 8 + 1)
#define                                 DMA1SPTR1_bit       BANKMASK(DMA1SPTRL), 1
// DMA1SPTRH<DMA1SPTR10>
extern volatile __bit                   DMA1SPTR10          __at(0x1DFAA);	// @ (0x3BF5 * 8 + 2)
#define                                 DMA1SPTR10_bit      BANKMASK(DMA1SPTRH), 2
// DMA1SPTRH<DMA1SPTR11>
extern volatile __bit                   DMA1SPTR11          __at(0x1DFAB);	// @ (0x3BF5 * 8 + 3)
#define                                 DMA1SPTR11_bit      BANKMASK(DMA1SPTRH), 3
// DMA1SPTRH<DMA1SPTR12>
extern volatile __bit                   DMA1SPTR12          __at(0x1DFAC);	// @ (0x3BF5 * 8 + 4)
#define                                 DMA1SPTR12_bit      BANKMASK(DMA1SPTRH), 4
// DMA1SPTRH<DMA1SPTR13>
extern volatile __bit                   DMA1SPTR13          __at(0x1DFAD);	// @ (0x3BF5 * 8 + 5)
#define                                 DMA1SPTR13_bit      BANKMASK(DMA1SPTRH), 5
// DMA1SPTRH<DMA1SPTR14>
extern volatile __bit                   DMA1SPTR14          __at(0x1DFAE);	// @ (0x3BF5 * 8 + 6)
#define                                 DMA1SPTR14_bit      BANKMASK(DMA1SPTRH), 6
// DMA1SPTRH<DMA1SPTR15>
extern volatile __bit                   DMA1SPTR15          __at(0x1DFAF);	// @ (0x3BF5 * 8 + 7)
#define                                 DMA1SPTR15_bit      BANKMASK(DMA1SPTRH), 7
// DMA1SPTRU<DMA1SPTR16>
extern volatile __bit                   DMA1SPTR16          __at(0x1DFB0);	// @ (0x3BF6 * 8 + 0)
