LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   DMA2DSZ11           __at(0x1DE7B);	// @ (0x3BCF * 8 + 3)
#define                                 DMA2DSZ11_bit       BANKMASK(DMA2DSZH), 3
// DMA2DSZL<DMA2DSZ2>
extern volatile __bit                   DMA2DSZ2            __at(0x1DE72);	// @ (0x3BCE * 8 + 2)
#define                                 DMA2DSZ2_bit        BANKMASK(DMA2DSZL), 2
// DMA2DSZL<DMA2DSZ3>
extern volatile __bit                   DMA2DSZ3            __at(0x1DE73);	// @ (0x3BCE * 8 + 3)
#define                                 DMA2DSZ3_bit        BANKMASK(DMA2DSZL), 3
// DMA2DSZL<DMA2DSZ4>
extern volatile __bit                   DMA2DSZ4            __at(0x1DE74);	// @ (0x3BCE * 8 + 4)
#define                                 DMA2DSZ4_bit        BANKMASK(DMA2DSZL), 4
// DMA2DSZL<DMA2DSZ5>
extern volatile __bit                   DMA2DSZ5            __at(0x1DE75);	// @ (0x3BCE * 8 + 5)
#define                                 DMA2DSZ5_bit        BANKMASK(DMA2DSZL), 5
// DMA2DSZL<DMA2DSZ6>
extern volatile __bit                   DMA2DSZ6            __at(0x1DE76);	// @ (0x3BCE * 8 + 6)
#define                                 DMA2DSZ6_bit        BANKMASK(DMA2DSZL), 6
// DMA2DSZL<DMA2DSZ7>
extern volatile __bit                   DMA2DSZ7            __at(0x1DE77);	// @ (0x3BCE * 8 + 7)
#define                                 DMA2DSZ7_bit        BANKMASK(DMA2DSZL), 7
// DMA2DSZH<DMA2DSZ8>
extern volatile __bit                   DMA2DSZ8            __at(0x1DE78);	// @ (0x3BCF * 8 + 0)
#define                                 DMA2DSZ8_bit        BANKMASK(DMA2DSZH), 0
// DMA2DSZH<DMA2DSZ9>
extern volatile __bit                   DMA2DSZ9            __at(0x1DE79);	// @ (0x3BCF * 8 + 1)
#define                                 DMA2DSZ9_bit        BANKMASK(DMA2DSZH), 1
// DMA2CON0<DMA2EN>
extern volatile __bit                   DMA2EN              __at(0x1DEE7);	// @ (0x3BDC * 8 + 7)
#define                                 DMA2EN_bit          BANKMASK(DMA2CON0), 7
// PMD7<DMA2MD>
extern volatile __bit                   DMA2MD              __at(0x1CE39);	// @ (0x39C7 * 8 + 1)
#define                                 DMA2MD_bit          BANKMASK(PMD7), 1
// PIE5<DMA2ORIE>
extern volatile __bit                   DMA2ORIE            __at(0x1CCAC);	// @ (0x3995 * 8 + 4)
#define                                 DMA2ORIE_bit        BANKMASK(PIE5), 4
// PIR5<DMA2ORIF>
extern volatile __bit                   DMA2ORIF            __at(0x1CD2C);	// @ (0x39A5 * 8 + 4)
#define                                 DMA2ORIF_bit        BANKMASK(PIR5), 4
// IPR5<DMA2ORIP>
extern volatile __bit                   DMA2ORIP            __at(0x1CC2C);	// @ (0x3985 * 8 + 4)
#define                                 DMA2ORIP_bit        BANKMASK(IPR5), 4
// DMA2PR<DMA2PR0>
extern volatile __bit                   DMA2PR0             __at(0x1CFA0);	// @ (0x39F4 * 8 + 0)
#define                                 DMA2PR0_bit         BANKMASK(DMA2PR), 0
// DMA2PR<DMA2PR1>
extern volatile __bit                   DMA2PR1             __at(0x1CFA1);	// @ (0x39F4 * 8 + 1)
#define                                 DMA2PR1_bit         BANKMASK(DMA2PR), 1
// DMA2PR<DMA2PR2>
extern volatile __bit                   DMA2PR2             __at(0x1CFA2);	// @ (0x39F4 * 8 + 2)
#define                                 DMA2PR2_bit         BANKMASK(DMA2PR), 2
// DMA2SCNTL<DMA2SCNT0>
extern volatile __bit                   DMA2SCNT0           __at(0x1DE90);	// @ (0x3BD2 * 8 + 0)
#define                                 DMA2SCNT0_bit       BANKMASK(DMA2SCNTL), 0
// DMA2SCNTL<DMA2SCNT1>
extern volatile __bit                   DMA2SCNT1           __at(0x1DE91);	// @ (0x3BD2 * 8 + 1)
#define                                 DMA2SCNT1_bit       BANKMASK(DMA2SCNTL), 1
// DMA2SCNTH<DMA2SCNT10>
extern volatile __bit                   DMA2SCNT10          __at(0x1DE9A);	// @ (0x3BD3 * 8 + 2)
#define                                 DMA2SCNT10_bit      BANKMASK(DMA2SCNTH), 2
// DMA2SCNTH<DMA2SCNT11>
extern volatile __bit                   DMA2SCNT11          __at(0x1DE9B);	// @ (0x3BD3 * 8 + 3)
#define                                 DMA2SCNT11_bit      BANKMASK(DMA2SCNTH), 3
// DMA2SCNTL<DMA2SCNT2>
extern volatile __bit                   DMA2SCNT2           __at(0x1DE92);	// @ (0x3BD2 * 8 + 2)
#define                                 DMA2SCNT2_bit       BANKMASK(DMA2SCNTL), 2
// DMA2SCNTL<DMA2SCNT3>
extern volatile __bit                   DMA2SCNT3           __at(0x1DE93);	// @ (0x3BD2 * 8 + 3)
#define                                 DMA2SCNT3_bit       BANKMASK(DMA2SCNTL), 3
// DMA2SCNTL<DMA2SCNT4>
extern volatile __bit                   DMA2SCNT4           __at(0x1DE94);	// @ (0x3BD2 * 8 + 4)
#define                                 DMA2SCNT4_bit       BANKMASK(DMA2SCNTL), 4
// DMA2SCNTL<DMA2SCNT5>
extern volatile __bit                   DMA2SCNT5           __at(0x1DE95);	// @ (0x3BD2 * 8 + 5)
#define                                 DMA2SCNT5_bit       BANKMASK(DMA2SCNTL), 5
// DMA2SCNTL<DMA2SCNT6>
extern volatile __bit                   DMA2SCNT6           __at(0x1DE96);	// @ (0x3BD2 * 8 + 6)
#define                                 DMA2SCNT6_bit       BANKMASK(DMA2SCNTL), 6
// DMA2SCNTL<DMA2SCNT7>
extern volatile __bit                   DMA2SCNT7           __at(0x1DE97);	// @ (0x3BD2 * 8 + 7)
#define                                 DMA2SCNT7_bit       BANKMASK(DMA2SCNTL), 7
// DMA2SCNTH<DMA2SCNT8>
extern volatile __bit                   DMA2SCNT8           __at(0x1DE98);	// @ (0x3BD3 * 8 + 0)
#define                                 DMA2SCNT8_bit       BANKMASK(DMA2SCNTH), 0
// DMA2SCNTH<DMA2SCNT9>
extern volatile __bit                   DMA2SCNT9           __at(0x1DE99);	// @ (0x3BD3 * 8 + 1)
#define                                 DMA2SCNT9_bit       BANKMASK(DMA2SCNTH), 1
// PIE5<DMA2SCNTIE>
extern volatile __bit                   DMA2SCNTIE          __at(0x1CCAA);	// @ (0x3995 * 8 + 2)
#define                                 DMA2SCNTIE_bit      BANKMASK(PIE5), 2
// PIR5<DMA2SCNTIF>
extern volatile __bit                   DMA2SCNTIF          __at(0x1CD2A);	// @ (0x39A5 * 8 + 2)
#define                                 DMA2SCNTIF_bit      BANKMASK(PIR5), 2
// IPR5<DMA2SCNTIP>
extern volatile __bit                   DMA2SCNTIP          __at(0x1CC2A);	// @ (0x3985 * 8 + 2)
#define                                 DMA2SCNTIP_bit      BANKMASK(IPR5), 2
// DMA2SIRQ<DMA2SIRQ0>
extern volatile __bit                   DMA2SIRQ0           __at(0x1DEF8);	// @ (0x3BDF * 8 + 0)
#define                                 DMA2SIRQ0_bit       BANKMASK(DMA2SIRQ), 0
// DMA2SIRQ<DMA2SIRQ1>
extern volatile __bit                   DMA2SIRQ1           __at(0x1DEF9);	// @ (0x3BDF * 8 + 1)
#define                                 DMA2SIRQ1_bit       BANKMASK(DMA2SIRQ), 1
// DMA2SIRQ<DMA2SIRQ2>
extern volatile __bit                   DMA2SIRQ2           __at(0x1DEFA);	// @ (0x3BDF * 8 + 2)
#define                                 DMA2SIRQ2_bit       BANKMASK(DMA2SIRQ), 2
// DMA2SIRQ<DMA2SIRQ3>
extern volatile __bit                   DMA2SIRQ3           __at(0x1DEFB);	// @ (0x3BDF * 8 + 3)
#define                                 DMA2SIRQ3_bit       BANKMASK(DMA2SIRQ), 3
// DMA2SIRQ<DMA2SIRQ4>
extern volatile __bit                   DMA2SIRQ4           __at(0x1DEFC);	// @ (0x3BDF * 8 + 4)
#define                                 DMA2SIRQ4_bit       BANKMASK(DMA2SIRQ), 4
// DMA2SIRQ<DMA2SIRQ5>
extern volatile __bit                   DMA2SIRQ5           __at(0x1DEFD);	// @ (0x3BDF * 8 + 5)
#define                                 DMA2SIRQ5_bit       BANKMASK(DMA2SIRQ), 5
// DMA2SIRQ<DMA2SIRQ6>
extern volatile __bit                   DMA2SIRQ6           __at(0x1DEFE);	// @ (0x3BDF * 8 + 6)
#define                                 DMA2SIRQ6_bit       BANKMASK(DMA2SIRQ), 6
// DMA2CON0<DMA2SIRQEN>
extern volatile __bit                   DMA2SIRQEN          __at(0x1DEE6);	// @ (0x3BDC * 8 + 6)
#define                                 DMA2SIRQEN_bit      BANKMASK(DMA2CON0), 6
// DMA2SPTRL<DMA2SPTR0>
extern volatile __bit                   DMA2SPTR0           __at(0x1DEA0);	// @ (0x3BD4 * 8 + 0)
#define                                 DMA2SPTR0_bit       BANKMASK(DMA2SPTRL), 0
// DMA2SPTRL<DMA2SPTR1>
extern volatile __bit                   DMA2SPTR1           __at(0x1DEA1);	// @ (0x3BD4 * 8 + 1)
#define                                 DMA2SPTR1_bit       BANKMASK(DMA2SPTRL), 1
// DMA2SPTRH<DMA2SPTR10>
extern volatile __bit                   DMA2SPTR10          __at(0x1DEAA);	// @ (0x3BD5 * 8 + 2)
#define                                 DMA2SPTR10_bit      BANKMASK(DMA2SPTRH), 2
// DMA2SPTRH<DMA2SPTR11>
extern volatile __bit                   DMA2SPTR11          __at(0x1DEAB);	// @ (0x3BD5 * 8 + 3)
#define                                 DMA2SPTR11_bit      BANKMASK(DMA2SPTRH), 3
// DMA2SPTRH<DMA2SPTR12>
extern volatile __bit                   DMA2SPTR12          __at(0x1DEAC);	// @ (0x3BD5 * 8 + 4)
#define                                 DMA2SPTR12_bit      BANKMASK(DMA2SPTRH), 4
// DMA2SPTRH<DMA2SPTR13>
extern volatile __bit                   DMA2SPTR13          __at(0x1DEAD);	// @ (0x3BD5 * 8 + 5)
#define                                 DMA2SPTR13_bit      BANKMASK(DMA2SPTRH), 5
// DMA2SPTRH<DMA2SPTR14>
extern volatile __bit                   DMA2SPTR14          __at(0x1DEAE);	// @ (0x3BD5 * 8 + 6)
#define                                 DMA2SPTR14_bit      BANKMASK(DMA2SPTRH), 6
// DMA2SPTRH<DMA2SPTR15>
extern volatile __bit                   DMA2SPTR15          __at(0x1DEAF);	// @ (0x3BD5 * 8 + 7)
#define                                 DMA2SPTR15_bit      BANKMASK(DMA2SPTRH), 7
// DMA2SPTRU<DMA2SPTR16>
extern volatile __bit                   DMA2SPTR16          __at(0x1DEB0);	// @ (0x3BD6 * 8 + 0)
#define                                 DMA2SPTR16_bit      BANKMASK(DMA2SPTRU), 0
// DMA2SPTRU<DMA2SPTR17>
extern volatile __bit                   DMA2SPTR17          __at(0x1DEB1);	// @ (0x3BD6 * 8 + 1)
#define                                 DMA2SPTR17_bit      BANKMASK(DMA2SPTRU), 1
// DMA2SPTRU<DMA2SPTR18>
extern volatile __bit                   DMA2SPTR18          __at(0x1DEB2);	// @ (0x3BD6 * 8 + 2)
#define                                 DMA2SPTR18_bit      BANKMASK(DMA2SPTRU), 2
// DMA2SPTRU<DMA2SPTR19>
extern volatile __bit                   DMA2SPTR19          __at(0x1DEB3);	// @ (0x3BD6 * 8 + 3)
#define                                 DMA2SPTR19_bit      BANKMASK(DMA2SPTRU), 3
// DMA2SPTRL<DMA2SPTR2>
extern volatile __bit                   DMA2SPTR2           __at(0x1DEA2);	// @ (0x3BD4 * 8 + 2)
#define                                 DMA2SPTR2_bit       BANKMASK(DMA2SPTRL), 2
// DMA2SPTRU<DMA2SPTR20>
extern volatile __bit                   DMA2SPTR20          __at(0x1DEB4);	// @ (0x3BD6 * 8 + 4)
#define                                 DMA2SPTR20_bit      BANKMASK(DMA2SPTRU), 4
// DMA2SPTRU<DMA2SPTR21>
extern volatile __bit                   DMA2SPTR21          __at(0x1DEB5);	// @ (0x3BD6 * 8 + 5)
#define                                 DMA2SPTR21_bit      BANKMASK(DMA2SPTRU), 5
// DMA2SPTRL<DMA2SPTR3>
extern volatile __bit                   DMA2SPTR3           __at(0x1DEA3);	// @ (0x3BD4 * 8 + 3)
#define                                 DMA2SPTR3_bit       BANKMASK(DMA2SPTRL), 3
// DMA2SPTRL<DMA2SPTR4>
extern volatile __bit                   DMA2SPTR4           __at(0x1DEA4);	// @ (0x3BD4 * 8 + 4)
#define                                 DMA2SPTR4_bit       BANKMASK(DMA2SPTRL), 4
// DMA2SPTRL<DMA2SPTR5>
extern volatile __bit                   DMA2SPTR5           __at(0x1DEA5);	// @ (0x3BD4 * 8 + 5)
#define                                 DMA2SPTR5_bit       BANKMASK(DMA2SPTRL), 5
// DMA2SPTRL<DMA2SPTR6>
extern volatile __bit                   DMA2SPTR6           __at(0x1DEA6);	// @ (0x3BD4 * 8 + 6)
#define                                 DMA2SPTR6_bit       BANKMASK(DMA2SPTRL), 6
// DMA2SPTRL<DMA2SPTR7>
extern volatile __bit                   DMA2SPTR7           __at(0x1DEA7);	// @ (0x3BD4 * 8 + 7)
#define                                 DMA2SPTR7_bit       BANKMASK(DMA2SPTRL), 7
// DMA2SPTRH<DMA2SPTR8>
extern volatile __bit                   DMA2SPTR8           __at(0x1DEA8);	// @ (0x3BD5 * 8 + 0)
#define                                 DMA2SPTR8_bit       BANKMASK(DMA2SPTRH), 0
// DMA2SPTRH<DMA2SPTR9>
extern volatile __bit                   DMA2SPTR9           __at(0x1DEA9);	// @ (0x3BD5 * 8 + 1)
#define                                 DMA2SPTR9_bit       BANKMASK(DMA2SPTRH), 1
// DMA2SSAL<DMA2SSA0>
extern volatile __bit                   DMA2SSA0            __at(0x1DEC8);	// @ (0x3BD9 * 8 + 0)
#define                                 DMA2SSA0_bit        BANKMASK(DMA2SSAL), 0
// DMA2SSAL<DMA2SSA1>
extern volatile __bit                   DMA2SSA1            __at(0x1DEC9);	// @ (0x3BD9 * 8 + 1)
#define                                 DMA2SSA1_bit        BANKMASK(DMA2SSAL), 1
// DMA2SSAH<DMA2SSA10>
extern volatile __bit                   DMA2SSA10           __at(0x1DED2);	// @ (0x3BDA * 8 + 2)
#define                                 DMA2SSA10_bit       BANKMASK(DMA2SSAH), 2
// DMA2SSAH<DMA2SSA11>
extern volatile __bit                   DMA2SSA11           __at(0x1DED3);	// @ (0x3BDA * 8 + 3)
#define                                 DMA2SSA11_bit       BANKMASK(DMA2SSAH), 3
// DMA2SSAH<DMA2SSA12>
extern volatile __bit                   DMA2SSA12           __at(0x1DED4);	// @ (0x3BDA * 8 + 4)
#define                                 DMA2SSA12_bit       BANKMASK(DMA2SSAH), 4
// DMA2SSAH<DMA2SSA13>
extern volatile __bit                   DMA2SSA13           __at(0x1DED5);	// @ (0x3BDA * 8 + 5)
#define                                 DMA2SSA13_bit       BANKMASK(DMA2SSAH), 5
// DMA2SSAH<DMA2SSA14>
extern volatile __bit                   DMA2SSA14           __at(0x1DED6);	// @ (0x3BDA * 8 + 6)
#define                                 DMA2SSA14_bit       BANKMASK(DMA2SSAH), 6
// DMA2SSAH<DMA2SSA15>
extern volatile __bit                   DMA2SSA15           __at(0x1DED7);	// @ (0x3BDA * 8 + 7)
#define                                 DMA2SSA15_bit       BANKMASK(DMA2SSAH), 7
// DMA2SSAU<DMA2SSA16>
extern volatile __bit                   DMA2SSA16           __at(0x1DED8);	// @ (0x3BDB * 8 + 0)
#define                                 DMA2SSA16_bit       BANKMASK(DMA2SSAU), 0
// DMA2SSAU<DMA2SSA17>
extern volatile __bit                   DMA2SSA17           __at(0x1DED9);	// @ (0x3BDB * 8 + 1)
#define                                 DMA2SSA17_bit       BANKMASK(DMA2SSAU), 1
// DMA2SSAU<DMA2SSA18>
extern volatile __bit                   DMA2SSA18           __at(0x1DEDA);	// @ (0x3BDB * 8 + 2)
#define                                 DMA2SSA18_bit       BANKMASK(DMA2SSAU), 2
// DMA2SSAU<DMA2SSA19>
extern volatile __bit                   DMA2SSA19           __at(0x1DEDB);	// @ (0x3BDB * 8 + 3)
#define                                 DMA2SSA19_bit       BANKMASK(DMA2SSAU), 3
// DMA2SSAL<DMA2SSA2>
extern volatile __bit                   DMA2SSA2            __at(0x1DECA);	// @ (0x3BD9 * 8 + 2)
#define                                 DMA2SSA2_bit        BANKMASK(DMA2SSAL), 2
// DMA2SSAU<DMA2SSA20>
extern volatile __bit                   DMA2SSA20           __at(0x1DEDC);	// @ (0x3BDB * 8 + 4)
#define                                 DMA2SSA20_bit       BANKMASK(DMA2SSAU), 4
// DMA2SSAU<DMA2SSA21>
extern volatile __bit                   DMA2SSA21           __at(0x1DEDD);	// @ (0x3BDB * 8 + 5)
#define                                 DMA2SSA21_bit       BANKMASK(DMA2SSAU), 5
// DMA2SSAL<DMA2SSA3>
extern volatile __bit                   DMA2SSA3            __at(0x1DECB);	// @ (0x3BD9 * 8 + 3)
#define                                 DMA2SSA3_bit        BANKMASK(DMA2SSAL), 3
// DMA2SSAL<DMA2SSA4>
extern volatile __bit                   DMA2SSA4            __at(0x1DECC);	// @ (0x3BD9 * 8 + 4)
#define                                 DMA2SSA4_bit        BANKMASK(DMA2SSAL), 4
// DMA2SSAL<DMA2SSA5>
extern volatile __bit                   DMA2SSA5            __at(0x1DECD);	// @ (0x3BD9 * 8 + 5)
#define                                 DMA2SSA5_bit        BANKMASK(DMA2SSAL), 5
// DMA2SSAL<DMA2SSA6>
extern volatile __bit                   DMA2SSA6            __at(0x1DECE);	// @ (0x3BD9 * 8 + 6)
#define                                 DMA2SSA6_bit        BANKMASK(DMA2SSAL), 6
// DMA2SSAL<DMA2SSA7>
extern volatile __bit                   DMA2SSA7            __at(0x1DECF);	// @ (0x3BD9 * 8 + 7)
#define                                 DMA2SSA7_bit        BANKMASK(DMA2SSAL), 7
// DMA2SSAH<DMA2SSA8>
extern volatile __bit                   DMA2SSA8            __at(0x1DED0);	// @ (0x3BDA * 8 + 0)
#define                                 DMA2SSA8_bit        BANKMASK(DMA2SSAH), 0
// DMA2SSAH<DMA2SSA9>
extern volatile __bit                   DMA2SSA9            __at(0x1DED1);	// @ (0x3BDA * 8 + 1)
#define                                 DMA2SSA9_bit        BANKMASK(DMA2SSAH), 1
// DMA2SSZL<DMA2SSZ0>
extern volatile __bit                   DMA2SSZ0            __at(0x1DEB8);	// @ (0x3BD7 * 8 + 0)
#define                                 DMA2SSZ0_bit        BANKMASK(DMA2SSZL), 0
// DMA2SSZL<DMA2SSZ1>
extern volatile __bit                   DMA2SSZ1            __at(0x1DEB9);	// @ (0x3BD7 * 8 + 1)
#define                                 DMA2SSZ1_bit        BANKMASK(DMA2SSZL), 1
// DMA2SSZH<DMA2SSZ10>
extern volatile __bit                   DMA2SSZ10           __at(0x1DEC2);	// @ (0x3BD8 * 8 + 2)
#define                                 DMA2SSZ10_bit       BANKMASK(DMA2SSZH), 2
// DMA2SSZH<DMA2SSZ11>
extern volatile __bit                   DMA2SSZ11           __at(0x1DEC3);	// @ (0x3BD8 * 8 + 3)
#define                                 DMA2SSZ11_bit       BANKMASK(DMA2SSZH), 3
// DMA2SSZL<DMA2SSZ2>
extern volatile __bit                   DMA2SSZ2            __at(0x1DEBA);	// @ (0x3BD7 * 8 + 2)
#define                                 DMA2SSZ2_bit        BANKMASK(DMA2SSZL), 2
// DMA2SSZL<DMA2SSZ3>
extern volatile __bit                   DMA2SSZ3            __at(0x1DEBB);	// @ (0x3BD7 * 8 + 3)
#define                                 DMA2SSZ3_bit        BANKMASK(DMA2SSZL), 3
// DMA2SSZL<DMA2SSZ4>
extern volatile __bit                   DMA2SSZ4            __at(0x1DEBC);	// @ (0x3BD7 * 8 + 4)
#define                                 DMA2SSZ4_bit        BANKMASK(DMA2SSZL), 4
// DMA2SSZL<DMA2SSZ5>
extern volatile __bit                   DMA2SSZ5            __at(0x1DEBD);	// @ (0x3BD7 * 8 + 5)
#define                                 DMA2SSZ5_bit        BANKMASK(DMA2SSZL), 5
// DMA2SSZL<DMA2SSZ6>
extern volatile __bit                   DMA2SSZ6            __at(0x1DEBE);	// @ (0x3BD7 * 8 + 6)
#define                                 DMA2SSZ6_bit        BANKMASK(DMA2SSZL), 6
// DMA2SSZL<DMA2SSZ7>
extern volatile __bit                   DMA2SSZ7            __at(0x1DEBF);	// @ (0x3BD7 * 8 + 7)
#define                                 DMA2SSZ7_bit        BANKMASK(DMA2SSZL), 7
// DMA2SSZH<DMA2SSZ8>
extern volatile __bit                   DMA2SSZ8            __at(0x1DEC0);	// @ (0x3BD8 * 8 + 0)
#define                                 DMA2SSZ8_bit        BANKMASK(DMA2SSZH), 0
// DMA2SSZH<DMA2SSZ9>
extern volatile __bit                   DMA2SSZ9            __at(0x1DEC1);	// @ (0x3BD8 * 8 + 1)
#define                                 DMA2SSZ9_bit        BANKMASK(DMA2SSZH), 1
// DMA2CON0<DMA2XIP>
extern volatile __bit                   DMA2XIP             __at(0x1DEE0);	// @ (0x3BDC * 8 + 0)
#define                                 DMA2XIP_bit         BANKMASK(DMA2CON0), 0
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x1CEC4);	// @ (0x39D8 * 8 + 4)
#define                                 DOE_bit             BANKMASK(CPUDOZE), 4
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x1F7C0);	// @ (0x3EF8 * 8 + 0)
#define                                 DONE_bit            BANKMASK(ADCON0), 0
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x1CEC0);	// @ (0x39D8 * 8 + 0)
#define                                 DOZE0_bit           BANKMASK(CPUDOZE), 0
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x1CEC1);	// @ (0x39D8 * 8 + 1)
#define                                 DOZE1_bit           BANKMASK(CPUDOZE), 1
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x1CEC2);	// @ (0x39D8 * 8 + 2)
#define                                 DOZE2_bit           BANKMASK(CPUDOZE), 2
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x1CEC6);	// @ (0x39D8 * 8 + 6)
#define                                 DOZEN_bit           BANKMASK(CPUDOZE), 6
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0x1F7C8);	// @ (0x3EF9 * 8 + 0)
#define                                 DSEN_bit            BANKMASK(ADCON1), 0
// PMD6<DSMMD>
extern volatile __bit                   DSMMD               __at(0x1CE30);	// @ (0x39C6 * 8 + 0)
#define                                 DSMMD_bit           BANKMASK(PMD6), 0
// PMD1<EMBMD>
extern volatile __bit                   EMBMD               __at(0x1CE08);	// @ (0x39C1 * 8 + 0)
#define                                 EMBMD_bit           BANKMASK(PMD1), 0
// SPI1INTE<EOSIE>
extern volatile __bit                   EOSIE               __at(0x1E8DC);	// @ (0x3D1B * 8 + 4)
#define                                 EOSIE_bit           BANKMASK(SPI1INTE), 4
// SPI1INTF<EOSIF>
extern volatile __bit                   EOSIF               __at(0x1E8D4);	// @ (0x3D1A * 8 + 4)
#define                                 EOSIF_bit           BANKMASK(SPI1INTF), 4
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0x1F710);	// @ (0x3EE2 * 8 + 0)
#define                                 ERR0_bit            BANKMASK(ADERRL), 0
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0x1F711);	// @ (0x3EE2 * 8 + 1)
#define                                 ERR1_bit            BANKMASK(ADERRL), 1
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0x1F71A);	// @ (0x3EE3 * 8 + 2)
#define                                 ERR10_bit           BANKMASK(ADERRH), 2
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0x1F71B);	// @ (0x3EE3 * 8 + 3)
#define                                 ERR11_bit           BANKMASK(ADERRH), 3
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0x1F71C);	// @ (0x3EE3 * 8 + 4)
#define                                 ERR12_bit           BANKMASK(ADERRH), 4
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0x1F71D);	// @ (0x3EE3 * 8 + 5)
#define                                 ERR13_bit           BANKMASK(ADERRH), 5
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0x1F71E);	// @ (0x3EE3 * 8 + 6)
#define                                 ERR14_bit           BANKMASK(ADERRH), 6
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0x1F71F);	// @ (0x3EE3 * 8 + 7)
#define                                 ERR15_bit           BANKMASK(ADERRH), 7
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0x1F712);	// @ (0x3EE2 * 8 + 2)
#define                                 ERR2_bit            BANKMASK(ADERRL), 2
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0x1F713);	// @ (0x3EE2 * 8 + 3)
#define                                 ERR3_bit            BANKMASK(ADERRL), 3
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0x1F714);	// @ (0x3EE2 * 8 + 4)
#define                                 ERR4_bit            BANKMASK(ADERRL), 4
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0x1F715);	// @ (0x3EE2 * 8 + 5)
