LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   INC13               __at(0x1F9E5);	// @ (0x3F3C * 8 + 5)
#define                                 INC13_bit           BANKMASK(NCO1INCH), 5
// NCO1INCH<INC14>
extern volatile __bit                   INC14               __at(0x1F9E6);	// @ (0x3F3C * 8 + 6)
#define                                 INC14_bit           BANKMASK(NCO1INCH), 6
// NCO1INCH<INC15>
extern volatile __bit                   INC15               __at(0x1F9E7);	// @ (0x3F3C * 8 + 7)
#define                                 INC15_bit           BANKMASK(NCO1INCH), 7
// NCO1INCU<INC16>
extern volatile __bit                   INC16               __at(0x1F9E8);	// @ (0x3F3D * 8 + 0)
#define                                 INC16_bit           BANKMASK(NCO1INCU), 0
// NCO1INCU<INC17>
extern volatile __bit                   INC17               __at(0x1F9E9);	// @ (0x3F3D * 8 + 1)
#define                                 INC17_bit           BANKMASK(NCO1INCU), 1
// NCO1INCU<INC18>
extern volatile __bit                   INC18               __at(0x1F9EA);	// @ (0x3F3D * 8 + 2)
#define                                 INC18_bit           BANKMASK(NCO1INCU), 2
// NCO1INCU<INC19>
extern volatile __bit                   INC19               __at(0x1F9EB);	// @ (0x3F3D * 8 + 3)
#define                                 INC19_bit           BANKMASK(NCO1INCU), 3
// NCO1INCL<INC2>
extern volatile __bit                   INC2                __at(0x1F9DA);	// @ (0x3F3B * 8 + 2)
#define                                 INC2_bit            BANKMASK(NCO1INCL), 2
// NCO1INCU<INC20>
extern volatile __bit                   INC20               __at(0x1F9EC);	// @ (0x3F3D * 8 + 4)
#define                                 INC20_bit           BANKMASK(NCO1INCU), 4
// NCO1INCU<INC21>
extern volatile __bit                   INC21               __at(0x1F9ED);	// @ (0x3F3D * 8 + 5)
#define                                 INC21_bit           BANKMASK(NCO1INCU), 5
// NCO1INCU<INC22>
extern volatile __bit                   INC22               __at(0x1F9EE);	// @ (0x3F3D * 8 + 6)
#define                                 INC22_bit           BANKMASK(NCO1INCU), 6
// NCO1INCU<INC23>
extern volatile __bit                   INC23               __at(0x1F9EF);	// @ (0x3F3D * 8 + 7)
#define                                 INC23_bit           BANKMASK(NCO1INCU), 7
// NCO1INCL<INC3>
extern volatile __bit                   INC3                __at(0x1F9DB);	// @ (0x3F3B * 8 + 3)
#define                                 INC3_bit            BANKMASK(NCO1INCL), 3
// NCO1INCL<INC4>
extern volatile __bit                   INC4                __at(0x1F9DC);	// @ (0x3F3B * 8 + 4)
#define                                 INC4_bit            BANKMASK(NCO1INCL), 4
// NCO1INCL<INC5>
extern volatile __bit                   INC5                __at(0x1F9DD);	// @ (0x3F3B * 8 + 5)
#define                                 INC5_bit            BANKMASK(NCO1INCL), 5
// NCO1INCL<INC6>
extern volatile __bit                   INC6                __at(0x1F9DE);	// @ (0x3F3B * 8 + 6)
#define                                 INC6_bit            BANKMASK(NCO1INCL), 6
// NCO1INCL<INC7>
extern volatile __bit                   INC7                __at(0x1F9DF);	// @ (0x3F3B * 8 + 7)
#define                                 INC7_bit            BANKMASK(NCO1INCL), 7
// NCO1INCH<INC8>
extern volatile __bit                   INC8                __at(0x1F9E0);	// @ (0x3F3C * 8 + 0)
#define                                 INC8_bit            BANKMASK(NCO1INCH), 0
// NCO1INCH<INC9>
extern volatile __bit                   INC9                __at(0x1F9E1);	// @ (0x3F3C * 8 + 1)
#define                                 INC9_bit            BANKMASK(NCO1INCH), 1
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x1D220);	// @ (0x3A44 * 8 + 0)
#define                                 INLVLA0_bit         BANKMASK(INLVLA), 0
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x1D221);	// @ (0x3A44 * 8 + 1)
#define                                 INLVLA1_bit         BANKMASK(INLVLA), 1
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x1D222);	// @ (0x3A44 * 8 + 2)
#define                                 INLVLA2_bit         BANKMASK(INLVLA), 2
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x1D223);	// @ (0x3A44 * 8 + 3)
#define                                 INLVLA3_bit         BANKMASK(INLVLA), 3
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x1D224);	// @ (0x3A44 * 8 + 4)
#define                                 INLVLA4_bit         BANKMASK(INLVLA), 4
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x1D225);	// @ (0x3A44 * 8 + 5)
#define                                 INLVLA5_bit         BANKMASK(INLVLA), 5
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x1D226);	// @ (0x3A44 * 8 + 6)
#define                                 INLVLA6_bit         BANKMASK(INLVLA), 6
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x1D227);	// @ (0x3A44 * 8 + 7)
#define                                 INLVLA7_bit         BANKMASK(INLVLA), 7
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x1D2A0);	// @ (0x3A54 * 8 + 0)
#define                                 INLVLB0_bit         BANKMASK(INLVLB), 0
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x1D2A1);	// @ (0x3A54 * 8 + 1)
#define                                 INLVLB1_bit         BANKMASK(INLVLB), 1
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x1D2A2);	// @ (0x3A54 * 8 + 2)
#define                                 INLVLB2_bit         BANKMASK(INLVLB), 2
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x1D2A3);	// @ (0x3A54 * 8 + 3)
#define                                 INLVLB3_bit         BANKMASK(INLVLB), 3
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x1D2A4);	// @ (0x3A54 * 8 + 4)
#define                                 INLVLB4_bit         BANKMASK(INLVLB), 4
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x1D2A5);	// @ (0x3A54 * 8 + 5)
#define                                 INLVLB5_bit         BANKMASK(INLVLB), 5
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x1D2A6);	// @ (0x3A54 * 8 + 6)
#define                                 INLVLB6_bit         BANKMASK(INLVLB), 6
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x1D2A7);	// @ (0x3A54 * 8 + 7)
#define                                 INLVLB7_bit         BANKMASK(INLVLB), 7
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x1D320);	// @ (0x3A64 * 8 + 0)
#define                                 INLVLC0_bit         BANKMASK(INLVLC), 0
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x1D321);	// @ (0x3A64 * 8 + 1)
#define                                 INLVLC1_bit         BANKMASK(INLVLC), 1
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x1D322);	// @ (0x3A64 * 8 + 2)
#define                                 INLVLC2_bit         BANKMASK(INLVLC), 2
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x1D323);	// @ (0x3A64 * 8 + 3)
#define                                 INLVLC3_bit         BANKMASK(INLVLC), 3
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x1D324);	// @ (0x3A64 * 8 + 4)
#define                                 INLVLC4_bit         BANKMASK(INLVLC), 4
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x1D325);	// @ (0x3A64 * 8 + 5)
#define                                 INLVLC5_bit         BANKMASK(INLVLC), 5
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x1D326);	// @ (0x3A64 * 8 + 6)
#define                                 INLVLC6_bit         BANKMASK(INLVLC), 6
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x1D327);	// @ (0x3A64 * 8 + 7)
#define                                 INLVLC7_bit         BANKMASK(INLVLC), 7
// INLVLD<INLVLD0>
extern volatile __bit                   INLVLD0             __at(0x1D3A0);	// @ (0x3A74 * 8 + 0)
#define                                 INLVLD0_bit         BANKMASK(INLVLD), 0
// INLVLD<INLVLD1>
extern volatile __bit                   INLVLD1             __at(0x1D3A1);	// @ (0x3A74 * 8 + 1)
#define                                 INLVLD1_bit         BANKMASK(INLVLD), 1
// INLVLD<INLVLD2>
extern volatile __bit                   INLVLD2             __at(0x1D3A2);	// @ (0x3A74 * 8 + 2)
#define                                 INLVLD2_bit         BANKMASK(INLVLD), 2
// INLVLD<INLVLD3>
extern volatile __bit                   INLVLD3             __at(0x1D3A3);	// @ (0x3A74 * 8 + 3)
#define                                 INLVLD3_bit         BANKMASK(INLVLD), 3
// INLVLD<INLVLD4>
extern volatile __bit                   INLVLD4             __at(0x1D3A4);	// @ (0x3A74 * 8 + 4)
#define                                 INLVLD4_bit         BANKMASK(INLVLD), 4
// INLVLD<INLVLD5>
extern volatile __bit                   INLVLD5             __at(0x1D3A5);	// @ (0x3A74 * 8 + 5)
#define                                 INLVLD5_bit         BANKMASK(INLVLD), 5
// INLVLD<INLVLD6>
extern volatile __bit                   INLVLD6             __at(0x1D3A6);	// @ (0x3A74 * 8 + 6)
#define                                 INLVLD6_bit         BANKMASK(INLVLD), 6
// INLVLD<INLVLD7>
extern volatile __bit                   INLVLD7             __at(0x1D3A7);	// @ (0x3A74 * 8 + 7)
#define                                 INLVLD7_bit         BANKMASK(INLVLD), 7
// INLVLE<INLVLE0>
extern volatile __bit                   INLVLE0             __at(0x1D420);	// @ (0x3A84 * 8 + 0)
#define                                 INLVLE0_bit         BANKMASK(INLVLE), 0
// INLVLE<INLVLE1>
extern volatile __bit                   INLVLE1             __at(0x1D421);	// @ (0x3A84 * 8 + 1)
#define                                 INLVLE1_bit         BANKMASK(INLVLE), 1
// INLVLE<INLVLE2>
extern volatile __bit                   INLVLE2             __at(0x1D422);	// @ (0x3A84 * 8 + 2)
#define                                 INLVLE2_bit         BANKMASK(INLVLE), 2
// INLVLE<INLVLE3>
extern volatile __bit                   INLVLE3             __at(0x1D423);	// @ (0x3A84 * 8 + 3)
#define                                 INLVLE3_bit         BANKMASK(INLVLE), 3
// INTCON0<INT0EDG>
extern volatile __bit                   INT0EDG             __at(0x1FE90);	// @ (0x3FD2 * 8 + 0)
#define                                 INT0EDG_bit         BANKMASK(INTCON0), 0
// PIE1<INT0IE>
extern volatile __bit                   INT0IE              __at(0x1CC88);	// @ (0x3991 * 8 + 0)
#define                                 INT0IE_bit          BANKMASK(PIE1), 0
// PIR1<INT0IF>
extern volatile __bit                   INT0IF              __at(0x1CD08);	// @ (0x39A1 * 8 + 0)
#define                                 INT0IF_bit          BANKMASK(PIR1), 0
// IPR1<INT0IP>
extern volatile __bit                   INT0IP              __at(0x1CC08);	// @ (0x3981 * 8 + 0)
#define                                 INT0IP_bit          BANKMASK(IPR1), 0
// INTCON0<INT1EDG>
extern volatile __bit                   INT1EDG             __at(0x1FE91);	// @ (0x3FD2 * 8 + 1)
#define                                 INT1EDG_bit         BANKMASK(INTCON0), 1
// PIE5<INT1IE>
extern volatile __bit                   INT1IE              __at(0x1CCA8);	// @ (0x3995 * 8 + 0)
#define                                 INT1IE_bit          BANKMASK(PIE5), 0
// PIR5<INT1IF>
extern volatile __bit                   INT1IF              __at(0x1CD28);	// @ (0x39A5 * 8 + 0)
#define                                 INT1IF_bit          BANKMASK(PIR5), 0
// IPR5<INT1IP>
extern volatile __bit                   INT1IP              __at(0x1CC28);	// @ (0x3985 * 8 + 0)
#define                                 INT1IP_bit          BANKMASK(IPR5), 0
// INTCON0<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x1FE92);	// @ (0x3FD2 * 8 + 2)
#define                                 INT2EDG_bit         BANKMASK(INTCON0), 2
// PIE7<INT2IE>
extern volatile __bit                   INT2IE              __at(0x1CCBD);	// @ (0x3997 * 8 + 5)
#define                                 INT2IE_bit          BANKMASK(PIE7), 5
// PIR7<INT2IF>
extern volatile __bit                   INT2IF              __at(0x1CD3D);	// @ (0x39A7 * 8 + 5)
#define                                 INT2IF_bit          BANKMASK(PIR7), 5
// IPR7<INT2IP>
extern volatile __bit                   INT2IP              __at(0x1CC3D);	// @ (0x3987 * 8 + 5)
#define                                 INT2IP_bit          BANKMASK(IPR7), 5
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x1F649);	// @ (0x3EC9 * 8 + 1)
#define                                 INTH_bit            BANKMASK(HLVDCON0), 1
// HLVDCON0<INTL>
extern volatile __bit                   INTL                __at(0x1F648);	// @ (0x3EC9 * 8 + 0)
#define                                 INTL_bit            BANKMASK(HLVDCON0), 0
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x1D238);	// @ (0x3A47 * 8 + 0)
#define                                 IOCAF0_bit          BANKMASK(IOCAF), 0
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x1D239);	// @ (0x3A47 * 8 + 1)
#define                                 IOCAF1_bit          BANKMASK(IOCAF), 1
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x1D23A);	// @ (0x3A47 * 8 + 2)
#define                                 IOCAF2_bit          BANKMASK(IOCAF), 2
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x1D23B);	// @ (0x3A47 * 8 + 3)
#define                                 IOCAF3_bit          BANKMASK(IOCAF), 3
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x1D23C);	// @ (0x3A47 * 8 + 4)
#define                                 IOCAF4_bit          BANKMASK(IOCAF), 4
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x1D23D);	// @ (0x3A47 * 8 + 5)
#define                                 IOCAF5_bit          BANKMASK(IOCAF), 5
// IOCAF<IOCAF6>
extern volatile __bit                   IOCAF6              __at(0x1D23E);	// @ (0x3A47 * 8 + 6)
#define                                 IOCAF6_bit          BANKMASK(IOCAF), 6
// IOCAF<IOCAF7>
extern volatile __bit                   IOCAF7              __at(0x1D23F);	// @ (0x3A47 * 8 + 7)
#define                                 IOCAF7_bit          BANKMASK(IOCAF), 7
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x1D230);	// @ (0x3A46 * 8 + 0)
#define                                 IOCAN0_bit          BANKMASK(IOCAN), 0
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x1D231);	// @ (0x3A46 * 8 + 1)
#define                                 IOCAN1_bit          BANKMASK(IOCAN), 1
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x1D232);	// @ (0x3A46 * 8 + 2)
#define                                 IOCAN2_bit          BANKMASK(IOCAN), 2
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x1D233);	// @ (0x3A46 * 8 + 3)
#define                                 IOCAN3_bit          BANKMASK(IOCAN), 3
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x1D234);	// @ (0x3A46 * 8 + 4)
#define                                 IOCAN4_bit          BANKMASK(IOCAN), 4
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x1D235);	// @ (0x3A46 * 8 + 5)
#define                                 IOCAN5_bit          BANKMASK(IOCAN), 5
// IOCAN<IOCAN6>
extern volatile __bit                   IOCAN6              __at(0x1D236);	// @ (0x3A46 * 8 + 6)
#define                                 IOCAN6_bit          BANKMASK(IOCAN), 6
// IOCAN<IOCAN7>
extern volatile __bit                   IOCAN7              __at(0x1D237);	// @ (0x3A46 * 8 + 7)
#define                                 IOCAN7_bit          BANKMASK(IOCAN), 7
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x1D228);	// @ (0x3A45 * 8 + 0)
#define                                 IOCAP0_bit          BANKMASK(IOCAP), 0
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x1D229);	// @ (0x3A45 * 8 + 1)
#define                                 IOCAP1_bit          BANKMASK(IOCAP), 1
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x1D22A);	// @ (0x3A45 * 8 + 2)
#define                                 IOCAP2_bit          BANKMASK(IOCAP), 2
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x1D22B);	// @ (0x3A45 * 8 + 3)
#define                                 IOCAP3_bit          BANKMASK(IOCAP), 3
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x1D22C);	// @ (0x3A45 * 8 + 4)
#define                                 IOCAP4_bit          BANKMASK(IOCAP), 4
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x1D22D);	// @ (0x3A45 * 8 + 5)
#define                                 IOCAP5_bit          BANKMASK(IOCAP), 5
// IOCAP<IOCAP6>
extern volatile __bit                   IOCAP6              __at(0x1D22E);	// @ (0x3A45 * 8 + 6)
#define                                 IOCAP6_bit          BANKMASK(IOCAP), 6
// IOCAP<IOCAP7>
extern volatile __bit                   IOCAP7              __at(0x1D22F);	// @ (0x3A45 * 8 + 7)
#define                                 IOCAP7_bit          BANKMASK(IOCAP), 7
// IOCBF<IOCBF0>
extern volatile __bit                   IOCBF0              __at(0x1D2B8);	// @ (0x3A57 * 8 + 0)
#define                                 IOCBF0_bit          BANKMASK(IOCBF), 0
// IOCBF<IOCBF1>
extern volatile __bit                   IOCBF1              __at(0x1D2B9);	// @ (0x3A57 * 8 + 1)
#define                                 IOCBF1_bit          BANKMASK(IOCBF), 1
// IOCBF<IOCBF2>
extern volatile __bit                   IOCBF2              __at(0x1D2BA);	// @ (0x3A57 * 8 + 2)
#define                                 IOCBF2_bit          BANKMASK(IOCBF), 2
// IOCBF<IOCBF3>
extern volatile __bit                   IOCBF3              __at(0x1D2BB);	// @ (0x3A57 * 8 + 3)
#define                                 IOCBF3_bit          BANKMASK(IOCBF), 3
// IOCBF<IOCBF4>
extern volatile __bit                   IOCBF4              __at(0x1D2BC);	// @ (0x3A57 * 8 + 4)
#define                                 IOCBF4_bit          BANKMASK(IOCBF), 4
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0x1D2BD);	// @ (0x3A57 * 8 + 5)
#define                                 IOCBF5_bit          BANKMASK(IOCBF), 5
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0x1D2BE);	// @ (0x3A57 * 8 + 6)
#define                                 IOCBF6_bit          BANKMASK(IOCBF), 6
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0x1D2BF);	// @ (0x3A57 * 8 + 7)
#define                                 IOCBF7_bit          BANKMASK(IOCBF), 7
// IOCBN<IOCBN0>
extern volatile __bit                   IOCBN0              __at(0x1D2B0);	// @ (0x3A56 * 8 + 0)
#define                                 IOCBN0_bit          BANKMASK(IOCBN), 0
// IOCBN<IOCBN1>
extern volatile __bit                   IOCBN1              __at(0x1D2B1);	// @ (0x3A56 * 8 + 1)
#define                                 IOCBN1_bit          BANKMASK(IOCBN), 1
// IOCBN<IOCBN2>
extern volatile __bit                   IOCBN2              __at(0x1D2B2);	// @ (0x3A56 * 8 + 2)
#define                                 IOCBN2_bit          BANKMASK(IOCBN), 2
// IOCBN<IOCBN3>
extern volatile __bit                   IOCBN3              __at(0x1D2B3);	// @ (0x3A56 * 8 + 3)
#define                                 IOCBN3_bit          BANKMASK(IOCBN), 3
// IOCBN<IOCBN4>
extern volatile __bit                   IOCBN4              __at(0x1D2B4);	// @ (0x3A56 * 8 + 4)
#define                                 IOCBN4_bit          BANKMASK(IOCBN), 4
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0x1D2B5);	// @ (0x3A56 * 8 + 5)
#define                                 IOCBN5_bit          BANKMASK(IOCBN), 5
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0x1D2B6);	// @ (0x3A56 * 8 + 6)
#define                                 IOCBN6_bit          BANKMASK(IOCBN), 6
// IOCBN<IOCBN7>
extern volatile __bit                   IOCBN7              __at(0x1D2B7);	// @ (0x3A56 * 8 + 7)
#define                                 IOCBN7_bit          BANKMASK(IOCBN), 7
// IOCBP<IOCBP0>
extern volatile __bit                   IOCBP0              __at(0x1D2A8);	// @ (0x3A55 * 8 + 0)
#define                                 IOCBP0_bit          BANKMASK(IOCBP), 0
// IOCBP<IOCBP1>
extern volatile __bit                   IOCBP1              __at(0x1D2A9);	// @ (0x3A55 * 8 + 1)
#define                                 IOCBP1_bit          BANKMASK(IOCBP), 1
// IOCBP<IOCBP2>
extern volatile __bit                   IOCBP2              __at(0x1D2AA);	// @ (0x3A55 * 8 + 2)
#define                                 IOCBP2_bit          BANKMASK(IOCBP), 2
// IOCBP<IOCBP3>
extern volatile __bit                   IOCBP3              __at(0x1D2AB);	// @ (0x3A55 * 8 + 3)
#define                                 IOCBP3_bit          BANKMASK(IOCBP), 3
// IOCBP<IOCBP4>
extern volatile __bit                   IOCBP4              __at(0x1D2AC);	// @ (0x3A55 * 8 + 4)
#define                                 IOCBP4_bit          BANKMASK(IOCBP), 4
// IOCBP<IOCBP5>
extern volatile __bit                   IOCBP5              __at(0x1D2AD);	// @ (0x3A55 * 8 + 5)
#define                                 IOCBP5_bit          BANKMASK(IOCBP), 5
// IOCBP<IOCBP6>
extern volatile __bit                   IOCBP6              __at(0x1D2AE);	// @ (0x3A55 * 8 + 6)
#define                                 IOCBP6_bit          BANKMASK(IOCBP), 6
// IOCBP<IOCBP7>
extern volatile __bit                   IOCBP7              __at(0x1D2AF);	// @ (0x3A55 * 8 + 7)
#define                                 IOCBP7_bit          BANKMASK(IOCBP), 7
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x1D338);	// @ (0x3A67 * 8 + 0)
#define                                 IOCCF0_bit          BANKMASK(IOCCF), 0
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x1D339);	// @ (0x3A67 * 8 + 1)
#define                                 IOCCF1_bit          BANKMASK(IOCCF), 1
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0x1D33A);	// @ (0x3A67 * 8 + 2)
#define                                 IOCCF2_bit          BANKMASK(IOCCF), 2
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x1D33B);	// @ (0x3A67 * 8 + 3)
#define                                 IOCCF3_bit          BANKMASK(IOCCF), 3
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x1D33C);	// @ (0x3A67 * 8 + 4)
#define                                 IOCCF4_bit          BANKMASK(IOCCF), 4
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x1D33D);	// @ (0x3A67 * 8 + 5)
#define                                 IOCCF5_bit          BANKMASK(IOCCF), 5
// IOCCF<IOCCF6>
