LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   LC2G4D1T            __at(0x1E399);	// @ (0x3C73 * 8 + 1)
#define                                 LC2G4D1T_bit        BANKMASK(CLC2GLS3), 1
// CLC2GLS3<LC2G4D2N>
extern volatile __bit                   LC2G4D2N            __at(0x1E39A);	// @ (0x3C73 * 8 + 2)
#define                                 LC2G4D2N_bit        BANKMASK(CLC2GLS3), 2
// CLC2GLS3<LC2G4D2T>
extern volatile __bit                   LC2G4D2T            __at(0x1E39B);	// @ (0x3C73 * 8 + 3)
#define                                 LC2G4D2T_bit        BANKMASK(CLC2GLS3), 3
// CLC2GLS3<LC2G4D3N>
extern volatile __bit                   LC2G4D3N            __at(0x1E39C);	// @ (0x3C73 * 8 + 4)
#define                                 LC2G4D3N_bit        BANKMASK(CLC2GLS3), 4
// CLC2GLS3<LC2G4D3T>
extern volatile __bit                   LC2G4D3T            __at(0x1E39D);	// @ (0x3C73 * 8 + 5)
#define                                 LC2G4D3T_bit        BANKMASK(CLC2GLS3), 5
// CLC2GLS3<LC2G4D4N>
extern volatile __bit                   LC2G4D4N            __at(0x1E39E);	// @ (0x3C73 * 8 + 6)
#define                                 LC2G4D4N_bit        BANKMASK(CLC2GLS3), 6
// CLC2GLS3<LC2G4D4T>
extern volatile __bit                   LC2G4D4T            __at(0x1E39F);	// @ (0x3C73 * 8 + 7)
#define                                 LC2G4D4T_bit        BANKMASK(CLC2GLS3), 7
// CLC2POL<LC2G4POL>
extern volatile __bit                   LC2G4POL            __at(0x1E35B);	// @ (0x3C6B * 8 + 3)
#define                                 LC2G4POL_bit        BANKMASK(CLC2POL), 3
// CLC2CON<LC2INTN>
extern volatile __bit                   LC2INTN             __at(0x1E353);	// @ (0x3C6A * 8 + 3)
#define                                 LC2INTN_bit         BANKMASK(CLC2CON), 3
// CLC2CON<LC2INTP>
extern volatile __bit                   LC2INTP             __at(0x1E354);	// @ (0x3C6A * 8 + 4)
#define                                 LC2INTP_bit         BANKMASK(CLC2CON), 4
// CLC2CON<LC2MODE0>
extern volatile __bit                   LC2MODE0            __at(0x1E350);	// @ (0x3C6A * 8 + 0)
#define                                 LC2MODE0_bit        BANKMASK(CLC2CON), 0
// CLC2CON<LC2MODE1>
extern volatile __bit                   LC2MODE1            __at(0x1E351);	// @ (0x3C6A * 8 + 1)
#define                                 LC2MODE1_bit        BANKMASK(CLC2CON), 1
// CLC2CON<LC2MODE2>
extern volatile __bit                   LC2MODE2            __at(0x1E352);	// @ (0x3C6A * 8 + 2)
#define                                 LC2MODE2_bit        BANKMASK(CLC2CON), 2
// CLC2CON<LC2OE>
extern volatile __bit                   LC2OE               __at(0x1E356);	// @ (0x3C6A * 8 + 6)
#define                                 LC2OE_bit           BANKMASK(CLC2CON), 6
// CLC2CON<LC2OUT>
extern volatile __bit                   LC2OUT              __at(0x1E355);	// @ (0x3C6A * 8 + 5)
#define                                 LC2OUT_bit          BANKMASK(CLC2CON), 5
// CLC2POL<LC2POL>
extern volatile __bit                   LC2POL              __at(0x1E35F);	// @ (0x3C6B * 8 + 7)
#define                                 LC2POL_bit          BANKMASK(CLC2POL), 7
// LATC<LC3>
extern volatile __bit                   LC3                 __at(0x1FDE3);	// @ (0x3FBC * 8 + 3)
#define                                 LC3_bit             BANKMASK(LATC), 3
// CLC3SEL0<LC3D1S0>
extern volatile __bit                   LC3D1S0             __at(0x1E310);	// @ (0x3C62 * 8 + 0)
#define                                 LC3D1S0_bit         BANKMASK(CLC3SEL0), 0
// CLC3SEL0<LC3D1S1>
extern volatile __bit                   LC3D1S1             __at(0x1E311);	// @ (0x3C62 * 8 + 1)
#define                                 LC3D1S1_bit         BANKMASK(CLC3SEL0), 1
// CLC3SEL0<LC3D1S2>
extern volatile __bit                   LC3D1S2             __at(0x1E312);	// @ (0x3C62 * 8 + 2)
#define                                 LC3D1S2_bit         BANKMASK(CLC3SEL0), 2
// CLC3SEL0<LC3D1S3>
extern volatile __bit                   LC3D1S3             __at(0x1E313);	// @ (0x3C62 * 8 + 3)
#define                                 LC3D1S3_bit         BANKMASK(CLC3SEL0), 3
// CLC3SEL0<LC3D1S4>
extern volatile __bit                   LC3D1S4             __at(0x1E314);	// @ (0x3C62 * 8 + 4)
#define                                 LC3D1S4_bit         BANKMASK(CLC3SEL0), 4
// CLC3SEL0<LC3D1S5>
extern volatile __bit                   LC3D1S5             __at(0x1E315);	// @ (0x3C62 * 8 + 5)
#define                                 LC3D1S5_bit         BANKMASK(CLC3SEL0), 5
// CLC3SEL0<LC3D1S6>
extern volatile __bit                   LC3D1S6             __at(0x1E316);	// @ (0x3C62 * 8 + 6)
#define                                 LC3D1S6_bit         BANKMASK(CLC3SEL0), 6
// CLC3SEL0<LC3D1S7>
extern volatile __bit                   LC3D1S7             __at(0x1E317);	// @ (0x3C62 * 8 + 7)
#define                                 LC3D1S7_bit         BANKMASK(CLC3SEL0), 7
// CLC3SEL1<LC3D2S0>
extern volatile __bit                   LC3D2S0             __at(0x1E318);	// @ (0x3C63 * 8 + 0)
#define                                 LC3D2S0_bit         BANKMASK(CLC3SEL1), 0
// CLC3SEL1<LC3D2S1>
extern volatile __bit                   LC3D2S1             __at(0x1E319);	// @ (0x3C63 * 8 + 1)
#define                                 LC3D2S1_bit         BANKMASK(CLC3SEL1), 1
// CLC3SEL1<LC3D2S2>
extern volatile __bit                   LC3D2S2             __at(0x1E31A);	// @ (0x3C63 * 8 + 2)
#define                                 LC3D2S2_bit         BANKMASK(CLC3SEL1), 2
// CLC3SEL1<LC3D2S3>
extern volatile __bit                   LC3D2S3             __at(0x1E31B);	// @ (0x3C63 * 8 + 3)
#define                                 LC3D2S3_bit         BANKMASK(CLC3SEL1), 3
// CLC3SEL1<LC3D2S4>
extern volatile __bit                   LC3D2S4             __at(0x1E31C);	// @ (0x3C63 * 8 + 4)
#define                                 LC3D2S4_bit         BANKMASK(CLC3SEL1), 4
// CLC3SEL1<LC3D2S5>
extern volatile __bit                   LC3D2S5             __at(0x1E31D);	// @ (0x3C63 * 8 + 5)
#define                                 LC3D2S5_bit         BANKMASK(CLC3SEL1), 5
// CLC3SEL1<LC3D2S6>
extern volatile __bit                   LC3D2S6             __at(0x1E31E);	// @ (0x3C63 * 8 + 6)
#define                                 LC3D2S6_bit         BANKMASK(CLC3SEL1), 6
// CLC3SEL1<LC3D2S7>
extern volatile __bit                   LC3D2S7             __at(0x1E31F);	// @ (0x3C63 * 8 + 7)
#define                                 LC3D2S7_bit         BANKMASK(CLC3SEL1), 7
// CLC3SEL2<LC3D3S0>
extern volatile __bit                   LC3D3S0             __at(0x1E320);	// @ (0x3C64 * 8 + 0)
#define                                 LC3D3S0_bit         BANKMASK(CLC3SEL2), 0
// CLC3SEL2<LC3D3S1>
extern volatile __bit                   LC3D3S1             __at(0x1E321);	// @ (0x3C64 * 8 + 1)
#define                                 LC3D3S1_bit         BANKMASK(CLC3SEL2), 1
// CLC3SEL2<LC3D3S2>
extern volatile __bit                   LC3D3S2             __at(0x1E322);	// @ (0x3C64 * 8 + 2)
#define                                 LC3D3S2_bit         BANKMASK(CLC3SEL2), 2
// CLC3SEL2<LC3D3S3>
extern volatile __bit                   LC3D3S3             __at(0x1E323);	// @ (0x3C64 * 8 + 3)
#define                                 LC3D3S3_bit         BANKMASK(CLC3SEL2), 3
// CLC3SEL2<LC3D3S4>
extern volatile __bit                   LC3D3S4             __at(0x1E324);	// @ (0x3C64 * 8 + 4)
#define                                 LC3D3S4_bit         BANKMASK(CLC3SEL2), 4
// CLC3SEL2<LC3D3S5>
extern volatile __bit                   LC3D3S5             __at(0x1E325);	// @ (0x3C64 * 8 + 5)
#define                                 LC3D3S5_bit         BANKMASK(CLC3SEL2), 5
// CLC3SEL2<LC3D3S6>
extern volatile __bit                   LC3D3S6             __at(0x1E326);	// @ (0x3C64 * 8 + 6)
#define                                 LC3D3S6_bit         BANKMASK(CLC3SEL2), 6
// CLC3SEL2<LC3D3S7>
extern volatile __bit                   LC3D3S7             __at(0x1E327);	// @ (0x3C64 * 8 + 7)
#define                                 LC3D3S7_bit         BANKMASK(CLC3SEL2), 7
// CLC3SEL3<LC3D4S0>
extern volatile __bit                   LC3D4S0             __at(0x1E328);	// @ (0x3C65 * 8 + 0)
#define                                 LC3D4S0_bit         BANKMASK(CLC3SEL3), 0
// CLC3SEL3<LC3D4S1>
extern volatile __bit                   LC3D4S1             __at(0x1E329);	// @ (0x3C65 * 8 + 1)
#define                                 LC3D4S1_bit         BANKMASK(CLC3SEL3), 1
// CLC3SEL3<LC3D4S2>
extern volatile __bit                   LC3D4S2             __at(0x1E32A);	// @ (0x3C65 * 8 + 2)
#define                                 LC3D4S2_bit         BANKMASK(CLC3SEL3), 2
// CLC3SEL3<LC3D4S3>
extern volatile __bit                   LC3D4S3             __at(0x1E32B);	// @ (0x3C65 * 8 + 3)
#define                                 LC3D4S3_bit         BANKMASK(CLC3SEL3), 3
// CLC3SEL3<LC3D4S4>
extern volatile __bit                   LC3D4S4             __at(0x1E32C);	// @ (0x3C65 * 8 + 4)
#define                                 LC3D4S4_bit         BANKMASK(CLC3SEL3), 4
// CLC3SEL3<LC3D4S5>
extern volatile __bit                   LC3D4S5             __at(0x1E32D);	// @ (0x3C65 * 8 + 5)
#define                                 LC3D4S5_bit         BANKMASK(CLC3SEL3), 5
// CLC3SEL3<LC3D4S6>
extern volatile __bit                   LC3D4S6             __at(0x1E32E);	// @ (0x3C65 * 8 + 6)
#define                                 LC3D4S6_bit         BANKMASK(CLC3SEL3), 6
// CLC3SEL3<LC3D4S7>
extern volatile __bit                   LC3D4S7             __at(0x1E32F);	// @ (0x3C65 * 8 + 7)
#define                                 LC3D4S7_bit         BANKMASK(CLC3SEL3), 7
// CLC3CON<LC3EN>
extern volatile __bit                   LC3EN               __at(0x1E307);	// @ (0x3C60 * 8 + 7)
#define                                 LC3EN_bit           BANKMASK(CLC3CON), 7
// CLC3GLS0<LC3G1D1N>
extern volatile __bit                   LC3G1D1N            __at(0x1E330);	// @ (0x3C66 * 8 + 0)
#define                                 LC3G1D1N_bit        BANKMASK(CLC3GLS0), 0
// CLC3GLS0<LC3G1D1T>
extern volatile __bit                   LC3G1D1T            __at(0x1E331);	// @ (0x3C66 * 8 + 1)
#define                                 LC3G1D1T_bit        BANKMASK(CLC3GLS0), 1
// CLC3GLS0<LC3G1D2N>
extern volatile __bit                   LC3G1D2N            __at(0x1E332);	// @ (0x3C66 * 8 + 2)
#define                                 LC3G1D2N_bit        BANKMASK(CLC3GLS0), 2
// CLC3GLS0<LC3G1D2T>
extern volatile __bit                   LC3G1D2T            __at(0x1E333);	// @ (0x3C66 * 8 + 3)
#define                                 LC3G1D2T_bit        BANKMASK(CLC3GLS0), 3
// CLC3GLS0<LC3G1D3N>
extern volatile __bit                   LC3G1D3N            __at(0x1E334);	// @ (0x3C66 * 8 + 4)
#define                                 LC3G1D3N_bit        BANKMASK(CLC3GLS0), 4
// CLC3GLS0<LC3G1D3T>
extern volatile __bit                   LC3G1D3T            __at(0x1E335);	// @ (0x3C66 * 8 + 5)
#define                                 LC3G1D3T_bit        BANKMASK(CLC3GLS0), 5
// CLC3GLS0<LC3G1D4N>
extern volatile __bit                   LC3G1D4N            __at(0x1E336);	// @ (0x3C66 * 8 + 6)
#define                                 LC3G1D4N_bit        BANKMASK(CLC3GLS0), 6
// CLC3GLS0<LC3G1D4T>
extern volatile __bit                   LC3G1D4T            __at(0x1E337);	// @ (0x3C66 * 8 + 7)
#define                                 LC3G1D4T_bit        BANKMASK(CLC3GLS0), 7
// CLC3POL<LC3G1POL>
extern volatile __bit                   LC3G1POL            __at(0x1E308);	// @ (0x3C61 * 8 + 0)
#define                                 LC3G1POL_bit        BANKMASK(CLC3POL), 0
// CLC3GLS1<LC3G2D1N>
extern volatile __bit                   LC3G2D1N            __at(0x1E338);	// @ (0x3C67 * 8 + 0)
#define                                 LC3G2D1N_bit        BANKMASK(CLC3GLS1), 0
// CLC3GLS1<LC3G2D1T>
extern volatile __bit                   LC3G2D1T            __at(0x1E339);	// @ (0x3C67 * 8 + 1)
#define                                 LC3G2D1T_bit        BANKMASK(CLC3GLS1), 1
// CLC3GLS1<LC3G2D2N>
extern volatile __bit                   LC3G2D2N            __at(0x1E33A);	// @ (0x3C67 * 8 + 2)
#define                                 LC3G2D2N_bit        BANKMASK(CLC3GLS1), 2
// CLC3GLS1<LC3G2D2T>
extern volatile __bit                   LC3G2D2T            __at(0x1E33B);	// @ (0x3C67 * 8 + 3)
#define                                 LC3G2D2T_bit        BANKMASK(CLC3GLS1), 3
// CLC3GLS1<LC3G2D3N>
extern volatile __bit                   LC3G2D3N            __at(0x1E33C);	// @ (0x3C67 * 8 + 4)
#define                                 LC3G2D3N_bit        BANKMASK(CLC3GLS1), 4
// CLC3GLS1<LC3G2D3T>
extern volatile __bit                   LC3G2D3T            __at(0x1E33D);	// @ (0x3C67 * 8 + 5)
#define                                 LC3G2D3T_bit        BANKMASK(CLC3GLS1), 5
// CLC3GLS1<LC3G2D4N>
extern volatile __bit                   LC3G2D4N            __at(0x1E33E);	// @ (0x3C67 * 8 + 6)
#define                                 LC3G2D4N_bit        BANKMASK(CLC3GLS1), 6
// CLC3GLS1<LC3G2D4T>
extern volatile __bit                   LC3G2D4T            __at(0x1E33F);	// @ (0x3C67 * 8 + 7)
#define                                 LC3G2D4T_bit        BANKMASK(CLC3GLS1), 7
// CLC3POL<LC3G2POL>
extern volatile __bit                   LC3G2POL            __at(0x1E309);	// @ (0x3C61 * 8 + 1)
#define                                 LC3G2POL_bit        BANKMASK(CLC3POL), 1
// CLC3GLS2<LC3G3D1N>
extern volatile __bit                   LC3G3D1N            __at(0x1E340);	// @ (0x3C68 * 8 + 0)
#define                                 LC3G3D1N_bit        BANKMASK(CLC3GLS2), 0
// CLC3GLS2<LC3G3D1T>
extern volatile __bit                   LC3G3D1T            __at(0x1E341);	// @ (0x3C68 * 8 + 1)
#define                                 LC3G3D1T_bit        BANKMASK(CLC3GLS2), 1
// CLC3GLS2<LC3G3D2N>
extern volatile __bit                   LC3G3D2N            __at(0x1E342);	// @ (0x3C68 * 8 + 2)
#define                                 LC3G3D2N_bit        BANKMASK(CLC3GLS2), 2
// CLC3GLS2<LC3G3D2T>
extern volatile __bit                   LC3G3D2T            __at(0x1E343);	// @ (0x3C68 * 8 + 3)
#define                                 LC3G3D2T_bit        BANKMASK(CLC3GLS2), 3
// CLC3GLS2<LC3G3D3N>
extern volatile __bit                   LC3G3D3N            __at(0x1E344);	// @ (0x3C68 * 8 + 4)
#define                                 LC3G3D3N_bit        BANKMASK(CLC3GLS2), 4
// CLC3GLS2<LC3G3D3T>
extern volatile __bit                   LC3G3D3T            __at(0x1E345);	// @ (0x3C68 * 8 + 5)
#define                                 LC3G3D3T_bit        BANKMASK(CLC3GLS2), 5
// CLC3GLS2<LC3G3D4N>
extern volatile __bit                   LC3G3D4N            __at(0x1E346);	// @ (0x3C68 * 8 + 6)
#define                                 LC3G3D4N_bit        BANKMASK(CLC3GLS2), 6
// CLC3GLS2<LC3G3D4T>
extern volatile __bit                   LC3G3D4T            __at(0x1E347);	// @ (0x3C68 * 8 + 7)
#define                                 LC3G3D4T_bit        BANKMASK(CLC3GLS2), 7
// CLC3POL<LC3G3POL>
extern volatile __bit                   LC3G3POL            __at(0x1E30A);	// @ (0x3C61 * 8 + 2)
#define                                 LC3G3POL_bit        BANKMASK(CLC3POL), 2
// CLC3GLS3<LC3G4D1N>
extern volatile __bit                   LC3G4D1N            __at(0x1E348);	// @ (0x3C69 * 8 + 0)
#define                                 LC3G4D1N_bit        BANKMASK(CLC3GLS3), 0
// CLC3GLS3<LC3G4D1T>
extern volatile __bit                   LC3G4D1T            __at(0x1E349);	// @ (0x3C69 * 8 + 1)
#define                                 LC3G4D1T_bit        BANKMASK(CLC3GLS3), 1
// CLC3GLS3<LC3G4D2N>
extern volatile __bit                   LC3G4D2N            __at(0x1E34A);	// @ (0x3C69 * 8 + 2)
#define                                 LC3G4D2N_bit        BANKMASK(CLC3GLS3), 2
// CLC3GLS3<LC3G4D2T>
extern volatile __bit                   LC3G4D2T            __at(0x1E34B);	// @ (0x3C69 * 8 + 3)
#define                                 LC3G4D2T_bit        BANKMASK(CLC3GLS3), 3
// CLC3GLS3<LC3G4D3N>
extern volatile __bit                   LC3G4D3N            __at(0x1E34C);	// @ (0x3C69 * 8 + 4)
#define                                 LC3G4D3N_bit        BANKMASK(CLC3GLS3), 4
// CLC3GLS3<LC3G4D3T>
extern volatile __bit                   LC3G4D3T            __at(0x1E34D);	// @ (0x3C69 * 8 + 5)
#define                                 LC3G4D3T_bit        BANKMASK(CLC3GLS3), 5
// CLC3GLS3<LC3G4D4N>
extern volatile __bit                   LC3G4D4N            __at(0x1E34E);	// @ (0x3C69 * 8 + 6)
#define                                 LC3G4D4N_bit        BANKMASK(CLC3GLS3), 6
// CLC3GLS3<LC3G4D4T>
extern volatile __bit                   LC3G4D4T            __at(0x1E34F);	// @ (0x3C69 * 8 + 7)
#define                                 LC3G4D4T_bit        BANKMASK(CLC3GLS3), 7
// CLC3POL<LC3G4POL>
extern volatile __bit                   LC3G4POL            __at(0x1E30B);	// @ (0x3C61 * 8 + 3)
#define                                 LC3G4POL_bit        BANKMASK(CLC3POL), 3
// CLC3CON<LC3INTN>
extern volatile __bit                   LC3INTN             __at(0x1E303);	// @ (0x3C60 * 8 + 3)
#define                                 LC3INTN_bit         BANKMASK(CLC3CON), 3
// CLC3CON<LC3INTP>
extern volatile __bit                   LC3INTP             __at(0x1E304);	// @ (0x3C60 * 8 + 4)
#define                                 LC3INTP_bit         BANKMASK(CLC3CON), 4
// CLC3CON<LC3MODE0>
extern volatile __bit                   LC3MODE0            __at(0x1E300);	// @ (0x3C60 * 8 + 0)
#define                                 LC3MODE0_bit        BANKMASK(CLC3CON), 0
// CLC3CON<LC3MODE1>
extern volatile __bit                   LC3MODE1            __at(0x1E301);	// @ (0x3C60 * 8 + 1)
#define                                 LC3MODE1_bit        BANKMASK(CLC3CON), 1
// CLC3CON<LC3MODE2>
extern volatile __bit                   LC3MODE2            __at(0x1E302);	// @ (0x3C60 * 8 + 2)
#define                                 LC3MODE2_bit        BANKMASK(CLC3CON), 2
// CLC3CON<LC3OE>
extern volatile __bit                   LC3OE               __at(0x1E306);	// @ (0x3C60 * 8 + 6)
#define                                 LC3OE_bit           BANKMASK(CLC3CON), 6
// CLC3CON<LC3OUT>
extern volatile __bit                   LC3OUT              __at(0x1E305);	// @ (0x3C60 * 8 + 5)
#define                                 LC3OUT_bit          BANKMASK(CLC3CON), 5
// CLC3POL<LC3POL>
extern volatile __bit                   LC3POL              __at(0x1E30F);	// @ (0x3C61 * 8 + 7)
#define                                 LC3POL_bit          BANKMASK(CLC3POL), 7
// LATC<LC4>
extern volatile __bit                   LC4                 __at(0x1FDE4);	// @ (0x3FBC * 8 + 4)
#define                                 LC4_bit             BANKMASK(LATC), 4
// CLC4SEL0<LC4D1S0>
extern volatile __bit                   LC4D1S0             __at(0x1E2C0);	// @ (0x3C58 * 8 + 0)
#define                                 LC4D1S0_bit         BANKMASK(CLC4SEL0), 0
// CLC4SEL0<LC4D1S1>
extern volatile __bit                   LC4D1S1             __at(0x1E2C1);	// @ (0x3C58 * 8 + 1)
#define                                 LC4D1S1_bit         BANKMASK(CLC4SEL0), 1
// CLC4SEL0<LC4D1S2>
extern volatile __bit                   LC4D1S2             __at(0x1E2C2);	// @ (0x3C58 * 8 + 2)
#define                                 LC4D1S2_bit         BANKMASK(CLC4SEL0), 2
// CLC4SEL0<LC4D1S3>
extern volatile __bit                   LC4D1S3             __at(0x1E2C3);	// @ (0x3C58 * 8 + 3)
#define                                 LC4D1S3_bit         BANKMASK(CLC4SEL0), 3
// CLC4SEL0<LC4D1S4>
extern volatile __bit                   LC4D1S4             __at(0x1E2C4);	// @ (0x3C58 * 8 + 4)
#define                                 LC4D1S4_bit         BANKMASK(CLC4SEL0), 4
// CLC4SEL0<LC4D1S5>
extern volatile __bit                   LC4D1S5             __at(0x1E2C5);	// @ (0x3C58 * 8 + 5)
#define                                 LC4D1S5_bit         BANKMASK(CLC4SEL0), 5
// CLC4SEL0<LC4D1S6>
extern volatile __bit                   LC4D1S6             __at(0x1E2C6);	// @ (0x3C58 * 8 + 6)
#define                                 LC4D1S6_bit         BANKMASK(CLC4SEL0), 6
// CLC4SEL0<LC4D1S7>
extern volatile __bit                   LC4D1S7             __at(0x1E2C7);	// @ (0x3C58 * 8 + 7)
#define                                 LC4D1S7_bit         BANKMASK(CLC4SEL0), 7
// CLC4SEL1<LC4D2S0>
extern volatile __bit                   LC4D2S0             __at(0x1E2C8);	// @ (0x3C59 * 8 + 0)
#define                                 LC4D2S0_bit         BANKMASK(CLC4SEL1), 0
// CLC4SEL1<LC4D2S1>
extern volatile __bit                   LC4D2S1             __at(0x1E2C9);	// @ (0x3C59 * 8 + 1)
#define                                 LC4D2S1_bit         BANKMASK(CLC4SEL1), 1
// CLC4SEL1<LC4D2S2>
extern volatile __bit                   LC4D2S2             __at(0x1E2CA);	// @ (0x3C59 * 8 + 2)
#define                                 LC4D2S2_bit         BANKMASK(CLC4SEL1), 2
// CLC4SEL1<LC4D2S3>
extern volatile __bit                   LC4D2S3             __at(0x1E2CB);	// @ (0x3C59 * 8 + 3)
#define                                 LC4D2S3_bit         BANKMASK(CLC4SEL1), 3
// CLC4SEL1<LC4D2S4>
extern volatile __bit                   LC4D2S4             __at(0x1E2CC);	// @ (0x3C59 * 8 + 4)
#define                                 LC4D2S4_bit         BANKMASK(CLC4SEL1), 4
// CLC4SEL1<LC4D2S5>
extern volatile __bit                   LC4D2S5             __at(0x1E2CD);	// @ (0x3C59 * 8 + 5)
#define                                 LC4D2S5_bit         BANKMASK(CLC4SEL1), 5
// CLC4SEL1<LC4D2S6>
extern volatile __bit                   LC4D2S6             __at(0x1E2CE);	// @ (0x3C59 * 8 + 6)
#define                                 LC4D2S6_bit         BANKMASK(CLC4SEL1), 6
// CLC4SEL1<LC4D2S7>
extern volatile __bit                   LC4D2S7             __at(0x1E2CF);	// @ (0x3C59 * 8 + 7)
#define                                 LC4D2S7_bit         BANKMASK(CLC4SEL1), 7
// CLC4SEL2<LC4D3S0>
extern volatile __bit                   LC4D3S0             __at(0x1E2D0);	// @ (0x3C5A * 8 + 0)
#define                                 LC4D3S0_bit         BANKMASK(CLC4SEL2), 0
// CLC4SEL2<LC4D3S1>
extern volatile __bit                   LC4D3S1             __at(0x1E2D1);	// @ (0x3C5A * 8 + 1)
#define                                 LC4D3S1_bit         BANKMASK(CLC4SEL2), 1
// CLC4SEL2<LC4D3S2>
extern volatile __bit                   LC4D3S2             __at(0x1E2D2);	// @ (0x3C5A * 8 + 2)
#define                                 LC4D3S2_bit         BANKMASK(CLC4SEL2), 2
// CLC4SEL2<LC4D3S3>
extern volatile __bit                   LC4D3S3             __at(0x1E2D3);	// @ (0x3C5A * 8 + 3)
#define                                 LC4D3S3_bit         BANKMASK(CLC4SEL2), 3
// CLC4SEL2<LC4D3S4>
extern volatile __bit                   LC4D3S4             __at(0x1E2D4);	// @ (0x3C5A * 8 + 4)
#define                                 LC4D3S4_bit         BANKMASK(CLC4SEL2), 4
// CLC4SEL2<LC4D3S5>
extern volatile __bit                   LC4D3S5             __at(0x1E2D5);	// @ (0x3C5A * 8 + 5)
#define                                 LC4D3S5_bit         BANKMASK(CLC4SEL2), 5
// CLC4SEL2<LC4D3S6>
extern volatile __bit                   LC4D3S6             __at(0x1E2D6);	// @ (0x3C5A * 8 + 6)
#define                                 LC4D3S6_bit         BANKMASK(CLC4SEL2), 6
// CLC4SEL2<LC4D3S7>
extern volatile __bit                   LC4D3S7             __at(0x1E2D7);	// @ (0x3C5A * 8 + 7)
#define                                 LC4D3S7_bit         BANKMASK(CLC4SEL2), 7
// CLC4SEL3<LC4D4S0>
extern volatile __bit                   LC4D4S0             __at(0x1E2D8);	// @ (0x3C5B * 8 + 0)
#define                                 LC4D4S0_bit         BANKMASK(CLC4SEL3), 0
// CLC4SEL3<LC4D4S1>
