LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   LC4D4S1             __at(0x1E2D9);	// @ (0x3C5B * 8 + 1)
#define                                 LC4D4S1_bit         BANKMASK(CLC4SEL3), 1
// CLC4SEL3<LC4D4S2>
extern volatile __bit                   LC4D4S2             __at(0x1E2DA);	// @ (0x3C5B * 8 + 2)
#define                                 LC4D4S2_bit         BANKMASK(CLC4SEL3), 2
// CLC4SEL3<LC4D4S3>
extern volatile __bit                   LC4D4S3             __at(0x1E2DB);	// @ (0x3C5B * 8 + 3)
#define                                 LC4D4S3_bit         BANKMASK(CLC4SEL3), 3
// CLC4SEL3<LC4D4S4>
extern volatile __bit                   LC4D4S4             __at(0x1E2DC);	// @ (0x3C5B * 8 + 4)
#define                                 LC4D4S4_bit         BANKMASK(CLC4SEL3), 4
// CLC4SEL3<LC4D4S5>
extern volatile __bit                   LC4D4S5             __at(0x1E2DD);	// @ (0x3C5B * 8 + 5)
#define                                 LC4D4S5_bit         BANKMASK(CLC4SEL3), 5
// CLC4SEL3<LC4D4S6>
extern volatile __bit                   LC4D4S6             __at(0x1E2DE);	// @ (0x3C5B * 8 + 6)
#define                                 LC4D4S6_bit         BANKMASK(CLC4SEL3), 6
// CLC4SEL3<LC4D4S7>
extern volatile __bit                   LC4D4S7             __at(0x1E2DF);	// @ (0x3C5B * 8 + 7)
#define                                 LC4D4S7_bit         BANKMASK(CLC4SEL3), 7
// CLC4CON<LC4EN>
extern volatile __bit                   LC4EN               __at(0x1E2B7);	// @ (0x3C56 * 8 + 7)
#define                                 LC4EN_bit           BANKMASK(CLC4CON), 7
// CLC4GLS0<LC4G1D1N>
extern volatile __bit                   LC4G1D1N            __at(0x1E2E0);	// @ (0x3C5C * 8 + 0)
#define                                 LC4G1D1N_bit        BANKMASK(CLC4GLS0), 0
// CLC4GLS0<LC4G1D1T>
extern volatile __bit                   LC4G1D1T            __at(0x1E2E1);	// @ (0x3C5C * 8 + 1)
#define                                 LC4G1D1T_bit        BANKMASK(CLC4GLS0), 1
// CLC4GLS0<LC4G1D2N>
extern volatile __bit                   LC4G1D2N            __at(0x1E2E2);	// @ (0x3C5C * 8 + 2)
#define                                 LC4G1D2N_bit        BANKMASK(CLC4GLS0), 2
// CLC4GLS0<LC4G1D2T>
extern volatile __bit                   LC4G1D2T            __at(0x1E2E3);	// @ (0x3C5C * 8 + 3)
#define                                 LC4G1D2T_bit        BANKMASK(CLC4GLS0), 3
// CLC4GLS0<LC4G1D3N>
extern volatile __bit                   LC4G1D3N            __at(0x1E2E4);	// @ (0x3C5C * 8 + 4)
#define                                 LC4G1D3N_bit        BANKMASK(CLC4GLS0), 4
// CLC4GLS0<LC4G1D3T>
extern volatile __bit                   LC4G1D3T            __at(0x1E2E5);	// @ (0x3C5C * 8 + 5)
#define                                 LC4G1D3T_bit        BANKMASK(CLC4GLS0), 5
// CLC4GLS0<LC4G1D4N>
extern volatile __bit                   LC4G1D4N            __at(0x1E2E6);	// @ (0x3C5C * 8 + 6)
#define                                 LC4G1D4N_bit        BANKMASK(CLC4GLS0), 6
// CLC4GLS0<LC4G1D4T>
extern volatile __bit                   LC4G1D4T            __at(0x1E2E7);	// @ (0x3C5C * 8 + 7)
#define                                 LC4G1D4T_bit        BANKMASK(CLC4GLS0), 7
// CLC4POL<LC4G1POL>
extern volatile __bit                   LC4G1POL            __at(0x1E2B8);	// @ (0x3C57 * 8 + 0)
#define                                 LC4G1POL_bit        BANKMASK(CLC4POL), 0
// CLC4GLS1<LC4G2D1N>
extern volatile __bit                   LC4G2D1N            __at(0x1E2E8);	// @ (0x3C5D * 8 + 0)
#define                                 LC4G2D1N_bit        BANKMASK(CLC4GLS1), 0
// CLC4GLS1<LC4G2D1T>
extern volatile __bit                   LC4G2D1T            __at(0x1E2E9);	// @ (0x3C5D * 8 + 1)
#define                                 LC4G2D1T_bit        BANKMASK(CLC4GLS1), 1
// CLC4GLS1<LC4G2D2N>
extern volatile __bit                   LC4G2D2N            __at(0x1E2EA);	// @ (0x3C5D * 8 + 2)
#define                                 LC4G2D2N_bit        BANKMASK(CLC4GLS1), 2
// CLC4GLS1<LC4G2D2T>
extern volatile __bit                   LC4G2D2T            __at(0x1E2EB);	// @ (0x3C5D * 8 + 3)
#define                                 LC4G2D2T_bit        BANKMASK(CLC4GLS1), 3
// CLC4GLS1<LC4G2D3N>
extern volatile __bit                   LC4G2D3N            __at(0x1E2EC);	// @ (0x3C5D * 8 + 4)
#define                                 LC4G2D3N_bit        BANKMASK(CLC4GLS1), 4
// CLC4GLS1<LC4G2D3T>
extern volatile __bit                   LC4G2D3T            __at(0x1E2ED);	// @ (0x3C5D * 8 + 5)
#define                                 LC4G2D3T_bit        BANKMASK(CLC4GLS1), 5
// CLC4GLS1<LC4G2D4N>
extern volatile __bit                   LC4G2D4N            __at(0x1E2EE);	// @ (0x3C5D * 8 + 6)
#define                                 LC4G2D4N_bit        BANKMASK(CLC4GLS1), 6
// CLC4GLS1<LC4G2D4T>
extern volatile __bit                   LC4G2D4T            __at(0x1E2EF);	// @ (0x3C5D * 8 + 7)
#define                                 LC4G2D4T_bit        BANKMASK(CLC4GLS1), 7
// CLC4POL<LC4G2POL>
extern volatile __bit                   LC4G2POL            __at(0x1E2B9);	// @ (0x3C57 * 8 + 1)
#define                                 LC4G2POL_bit        BANKMASK(CLC4POL), 1
// CLC4GLS2<LC4G3D1N>
extern volatile __bit                   LC4G3D1N            __at(0x1E2F0);	// @ (0x3C5E * 8 + 0)
#define                                 LC4G3D1N_bit        BANKMASK(CLC4GLS2), 0
// CLC4GLS2<LC4G3D1T>
extern volatile __bit                   LC4G3D1T            __at(0x1E2F1);	// @ (0x3C5E * 8 + 1)
#define                                 LC4G3D1T_bit        BANKMASK(CLC4GLS2), 1
// CLC4GLS2<LC4G3D2N>
extern volatile __bit                   LC4G3D2N            __at(0x1E2F2);	// @ (0x3C5E * 8 + 2)
#define                                 LC4G3D2N_bit        BANKMASK(CLC4GLS2), 2
// CLC4GLS2<LC4G3D2T>
extern volatile __bit                   LC4G3D2T            __at(0x1E2F3);	// @ (0x3C5E * 8 + 3)
#define                                 LC4G3D2T_bit        BANKMASK(CLC4GLS2), 3
// CLC4GLS2<LC4G3D3N>
extern volatile __bit                   LC4G3D3N            __at(0x1E2F4);	// @ (0x3C5E * 8 + 4)
#define                                 LC4G3D3N_bit        BANKMASK(CLC4GLS2), 4
// CLC4GLS2<LC4G3D3T>
extern volatile __bit                   LC4G3D3T            __at(0x1E2F5);	// @ (0x3C5E * 8 + 5)
#define                                 LC4G3D3T_bit        BANKMASK(CLC4GLS2), 5
// CLC4GLS2<LC4G3D4N>
extern volatile __bit                   LC4G3D4N            __at(0x1E2F6);	// @ (0x3C5E * 8 + 6)
#define                                 LC4G3D4N_bit        BANKMASK(CLC4GLS2), 6
// CLC4GLS2<LC4G3D4T>
extern volatile __bit                   LC4G3D4T            __at(0x1E2F7);	// @ (0x3C5E * 8 + 7)
#define                                 LC4G3D4T_bit        BANKMASK(CLC4GLS2), 7
// CLC4POL<LC4G3POL>
extern volatile __bit                   LC4G3POL            __at(0x1E2BA);	// @ (0x3C57 * 8 + 2)
#define                                 LC4G3POL_bit        BANKMASK(CLC4POL), 2
// CLC4GLS3<LC4G4D1N>
extern volatile __bit                   LC4G4D1N            __at(0x1E2F8);	// @ (0x3C5F * 8 + 0)
#define                                 LC4G4D1N_bit        BANKMASK(CLC4GLS3), 0
// CLC4GLS3<LC4G4D1T>
extern volatile __bit                   LC4G4D1T            __at(0x1E2F9);	// @ (0x3C5F * 8 + 1)
#define                                 LC4G4D1T_bit        BANKMASK(CLC4GLS3), 1
// CLC4GLS3<LC4G4D2N>
extern volatile __bit                   LC4G4D2N            __at(0x1E2FA);	// @ (0x3C5F * 8 + 2)
#define                                 LC4G4D2N_bit        BANKMASK(CLC4GLS3), 2
// CLC4GLS3<LC4G4D2T>
extern volatile __bit                   LC4G4D2T            __at(0x1E2FB);	// @ (0x3C5F * 8 + 3)
#define                                 LC4G4D2T_bit        BANKMASK(CLC4GLS3), 3
// CLC4GLS3<LC4G4D3N>
extern volatile __bit                   LC4G4D3N            __at(0x1E2FC);	// @ (0x3C5F * 8 + 4)
#define                                 LC4G4D3N_bit        BANKMASK(CLC4GLS3), 4
// CLC4GLS3<LC4G4D3T>
extern volatile __bit                   LC4G4D3T            __at(0x1E2FD);	// @ (0x3C5F * 8 + 5)
#define                                 LC4G4D3T_bit        BANKMASK(CLC4GLS3), 5
// CLC4GLS3<LC4G4D4N>
extern volatile __bit                   LC4G4D4N            __at(0x1E2FE);	// @ (0x3C5F * 8 + 6)
#define                                 LC4G4D4N_bit        BANKMASK(CLC4GLS3), 6
// CLC4GLS3<LC4G4D4T>
extern volatile __bit                   LC4G4D4T            __at(0x1E2FF);	// @ (0x3C5F * 8 + 7)
#define                                 LC4G4D4T_bit        BANKMASK(CLC4GLS3), 7
// CLC4POL<LC4G4POL>
extern volatile __bit                   LC4G4POL            __at(0x1E2BB);	// @ (0x3C57 * 8 + 3)
#define                                 LC4G4POL_bit        BANKMASK(CLC4POL), 3
// CLC4CON<LC4INTN>
extern volatile __bit                   LC4INTN             __at(0x1E2B3);	// @ (0x3C56 * 8 + 3)
#define                                 LC4INTN_bit         BANKMASK(CLC4CON), 3
// CLC4CON<LC4INTP>
extern volatile __bit                   LC4INTP             __at(0x1E2B4);	// @ (0x3C56 * 8 + 4)
#define                                 LC4INTP_bit         BANKMASK(CLC4CON), 4
// CLC4CON<LC4MODE0>
extern volatile __bit                   LC4MODE0            __at(0x1E2B0);	// @ (0x3C56 * 8 + 0)
#define                                 LC4MODE0_bit        BANKMASK(CLC4CON), 0
// CLC4CON<LC4MODE1>
extern volatile __bit                   LC4MODE1            __at(0x1E2B1);	// @ (0x3C56 * 8 + 1)
#define                                 LC4MODE1_bit        BANKMASK(CLC4CON), 1
// CLC4CON<LC4MODE2>
extern volatile __bit                   LC4MODE2            __at(0x1E2B2);	// @ (0x3C56 * 8 + 2)
#define                                 LC4MODE2_bit        BANKMASK(CLC4CON), 2
// CLC4CON<LC4OE>
extern volatile __bit                   LC4OE               __at(0x1E2B6);	// @ (0x3C56 * 8 + 6)
#define                                 LC4OE_bit           BANKMASK(CLC4CON), 6
// CLC4CON<LC4OUT>
extern volatile __bit                   LC4OUT              __at(0x1E2B5);	// @ (0x3C56 * 8 + 5)
#define                                 LC4OUT_bit          BANKMASK(CLC4CON), 5
// CLC4POL<LC4POL>
extern volatile __bit                   LC4POL              __at(0x1E2BF);	// @ (0x3C57 * 8 + 7)
#define                                 LC4POL_bit          BANKMASK(CLC4POL), 7
// LATC<LC5>
extern volatile __bit                   LC5                 __at(0x1FDE5);	// @ (0x3FBC * 8 + 5)
#define                                 LC5_bit             BANKMASK(LATC), 5
// LATC<LC6>
extern volatile __bit                   LC6                 __at(0x1FDE6);	// @ (0x3FBC * 8 + 6)
#define                                 LC6_bit             BANKMASK(LATC), 6
// LATC<LC7>
extern volatile __bit                   LC7                 __at(0x1FDE7);	// @ (0x3FBC * 8 + 7)
#define                                 LC7_bit             BANKMASK(LATC), 7
// LATD<LD0>
extern volatile __bit                   LD0                 __at(0x1FDE8);	// @ (0x3FBD * 8 + 0)
#define                                 LD0_bit             BANKMASK(LATD), 0
// LATD<LD1>
extern volatile __bit                   LD1                 __at(0x1FDE9);	// @ (0x3FBD * 8 + 1)
#define                                 LD1_bit             BANKMASK(LATD), 1
// LATD<LD2>
extern volatile __bit                   LD2                 __at(0x1FDEA);	// @ (0x3FBD * 8 + 2)
#define                                 LD2_bit             BANKMASK(LATD), 2
// LATD<LD3>
extern volatile __bit                   LD3                 __at(0x1FDEB);	// @ (0x3FBD * 8 + 3)
#define                                 LD3_bit             BANKMASK(LATD), 3
// LATD<LD4>
extern volatile __bit                   LD4                 __at(0x1FDEC);	// @ (0x3FBD * 8 + 4)
#define                                 LD4_bit             BANKMASK(LATD), 4
// LATD<LD5>
extern volatile __bit                   LD5                 __at(0x1FDED);	// @ (0x3FBD * 8 + 5)
#define                                 LD5_bit             BANKMASK(LATD), 5
// LATD<LD6>
extern volatile __bit                   LD6                 __at(0x1FDEE);	// @ (0x3FBD * 8 + 6)
#define                                 LD6_bit             BANKMASK(LATD), 6
// LATD<LD7>
extern volatile __bit                   LD7                 __at(0x1FDEF);	// @ (0x3FBD * 8 + 7)
#define                                 LD7_bit             BANKMASK(LATD), 7
// LATE<LE0>
extern volatile __bit                   LE0                 __at(0x1FDF0);	// @ (0x3FBE * 8 + 0)
#define                                 LE0_bit             BANKMASK(LATE), 0
// LATE<LE1>
extern volatile __bit                   LE1                 __at(0x1FDF1);	// @ (0x3FBE * 8 + 1)
#define                                 LE1_bit             BANKMASK(LATE), 1
// LATE<LE2>
extern volatile __bit                   LE2                 __at(0x1FDF2);	// @ (0x3FBE * 8 + 2)
#define                                 LE2_bit             BANKMASK(LATE), 2
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x1CEEC);	// @ (0x39DD * 8 + 4)
#define                                 LFOEN_bit           BANKMASK(OSCEN), 4
// OSCSTAT<LFOR>
extern volatile __bit                   LFOR                __at(0x1CEE4);	// @ (0x39DC * 8 + 4)
#define                                 LFOR_bit            BANKMASK(OSCSTAT), 4
// SPI1CON0<LSBF>
extern volatile __bit                   LSBF                __at(0x1E8A2);	// @ (0x3D14 * 8 + 2)
#define                                 LSBF_bit            BANKMASK(SPI1CON0), 2
// ADLTHL<LTH0>
extern volatile __bit                   LTH0                __at(0x1F6F0);	// @ (0x3EDE * 8 + 0)
#define                                 LTH0_bit            BANKMASK(ADLTHL), 0
// ADLTHL<LTH1>
extern volatile __bit                   LTH1                __at(0x1F6F1);	// @ (0x3EDE * 8 + 1)
#define                                 LTH1_bit            BANKMASK(ADLTHL), 1
// ADLTHH<LTH10>
extern volatile __bit                   LTH10               __at(0x1F6FA);	// @ (0x3EDF * 8 + 2)
#define                                 LTH10_bit           BANKMASK(ADLTHH), 2
// ADLTHH<LTH11>
extern volatile __bit                   LTH11               __at(0x1F6FB);	// @ (0x3EDF * 8 + 3)
#define                                 LTH11_bit           BANKMASK(ADLTHH), 3
// ADLTHH<LTH12>
extern volatile __bit                   LTH12               __at(0x1F6FC);	// @ (0x3EDF * 8 + 4)
#define                                 LTH12_bit           BANKMASK(ADLTHH), 4
// ADLTHH<LTH13>
extern volatile __bit                   LTH13               __at(0x1F6FD);	// @ (0x3EDF * 8 + 5)
#define                                 LTH13_bit           BANKMASK(ADLTHH), 5
// ADLTHH<LTH14>
extern volatile __bit                   LTH14               __at(0x1F6FE);	// @ (0x3EDF * 8 + 6)
#define                                 LTH14_bit           BANKMASK(ADLTHH), 6
// ADLTHH<LTH15>
extern volatile __bit                   LTH15               __at(0x1F6FF);	// @ (0x3EDF * 8 + 7)
#define                                 LTH15_bit           BANKMASK(ADLTHH), 7
// ADLTHL<LTH2>
extern volatile __bit                   LTH2                __at(0x1F6F2);	// @ (0x3EDE * 8 + 2)
#define                                 LTH2_bit            BANKMASK(ADLTHL), 2
// ADLTHL<LTH3>
extern volatile __bit                   LTH3                __at(0x1F6F3);	// @ (0x3EDE * 8 + 3)
#define                                 LTH3_bit            BANKMASK(ADLTHL), 3
// ADLTHL<LTH4>
extern volatile __bit                   LTH4                __at(0x1F6F4);	// @ (0x3EDE * 8 + 4)
#define                                 LTH4_bit            BANKMASK(ADLTHL), 4
// ADLTHL<LTH5>
extern volatile __bit                   LTH5                __at(0x1F6F5);	// @ (0x3EDE * 8 + 5)
#define                                 LTH5_bit            BANKMASK(ADLTHL), 5
// ADLTHL<LTH6>
extern volatile __bit                   LTH6                __at(0x1F6F6);	// @ (0x3EDE * 8 + 6)
#define                                 LTH6_bit            BANKMASK(ADLTHL), 6
// ADLTHL<LTH7>
extern volatile __bit                   LTH7                __at(0x1F6F7);	// @ (0x3EDE * 8 + 7)
#define                                 LTH7_bit            BANKMASK(ADLTHL), 7
// ADLTHH<LTH8>
extern volatile __bit                   LTH8                __at(0x1F6F8);	// @ (0x3EDF * 8 + 0)
#define                                 LTH8_bit            BANKMASK(ADLTHH), 0
// ADLTHH<LTH9>
extern volatile __bit                   LTH9                __at(0x1F6F9);	// @ (0x3EDF * 8 + 1)
#define                                 LTH9_bit            BANKMASK(ADLTHH), 1
// ADSTAT<LTHR>
extern volatile __bit                   LTHR                __at(0x1F7E5);	// @ (0x3EFC * 8 + 5)
#define                                 LTHR_bit            BANKMASK(ADSTAT), 5
// PORTA<LVDIN>
extern volatile __bit                   LVDIN               __at(0x1FE55);	// @ (0x3FCA * 8 + 5)
#define                                 LVDIN_bit           BANKMASK(PORTA), 5
// MAINPR<MAINPR0>
extern volatile __bit                   MAINPR0             __at(0x1CF90);	// @ (0x39F2 * 8 + 0)
#define                                 MAINPR0_bit         BANKMASK(MAINPR), 0
// MAINPR<MAINPR1>
extern volatile __bit                   MAINPR1             __at(0x1CF91);	// @ (0x39F2 * 8 + 1)
#define                                 MAINPR1_bit         BANKMASK(MAINPR), 1
// MAINPR<MAINPR2>
extern volatile __bit                   MAINPR2             __at(0x1CF92);	// @ (0x39F2 * 8 + 2)
#define                                 MAINPR2_bit         BANKMASK(MAINPR), 2
// ADSTAT<MATH>
extern volatile __bit                   MATH                __at(0x1F7E4);	// @ (0x3EFC * 8 + 4)
#define                                 MATH_bit            BANKMASK(ADSTAT), 4
// ADCON2<MD0>
extern volatile __bit                   MD0                 __at(0x1F7D0);	// @ (0x3EFA * 8 + 0)
#define                                 MD0_bit             BANKMASK(ADCON2), 0
// ADCON2<MD1>
extern volatile __bit                   MD1                 __at(0x1F7D1);	// @ (0x3EFA * 8 + 1)
#define                                 MD1_bit             BANKMASK(ADCON2), 1
// T0CON0<MD16>
extern volatile __bit                   MD16                __at(0x1FDC4);	// @ (0x3FB8 * 8 + 4)
#define                                 MD16_bit            BANKMASK(T0CON0), 4
// MD1CON0<MD1BIT>
extern volatile __bit                   MD1BIT              __at(0x1E7D0);	// @ (0x3CFA * 8 + 0)
#define                                 MD1BIT_bit          BANKMASK(MD1CON0), 0
// MD1CARH<MD1CH0>
extern volatile __bit                   MD1CH0              __at(0x1E7F0);	// @ (0x3CFE * 8 + 0)
#define                                 MD1CH0_bit          BANKMASK(MD1CARH), 0
// MD1CARH<MD1CH1>
extern volatile __bit                   MD1CH1              __at(0x1E7F1);	// @ (0x3CFE * 8 + 1)
#define                                 MD1CH1_bit          BANKMASK(MD1CARH), 1
// MD1CARH<MD1CH2>
extern volatile __bit                   MD1CH2              __at(0x1E7F2);	// @ (0x3CFE * 8 + 2)
#define                                 MD1CH2_bit          BANKMASK(MD1CARH), 2
// MD1CARH<MD1CH3>
extern volatile __bit                   MD1CH3              __at(0x1E7F3);	// @ (0x3CFE * 8 + 3)
#define                                 MD1CH3_bit          BANKMASK(MD1CARH), 3
// MD1CARH<MD1CH4>
extern volatile __bit                   MD1CH4              __at(0x1E7F4);	// @ (0x3CFE * 8 + 4)
#define                                 MD1CH4_bit          BANKMASK(MD1CARH), 4
// MD1CON1<MD1CHPOL>
extern volatile __bit                   MD1CHPOL            __at(0x1E7DD);	// @ (0x3CFB * 8 + 5)
#define                                 MD1CHPOL_bit        BANKMASK(MD1CON1), 5
// MD1CON1<MD1CHSYNC>
extern volatile __bit                   MD1CHSYNC           __at(0x1E7DC);	// @ (0x3CFB * 8 + 4)
#define                                 MD1CHSYNC_bit       BANKMASK(MD1CON1), 4
// MD1CARL<MD1CL0>
extern volatile __bit                   MD1CL0              __at(0x1E7E8);	// @ (0x3CFD * 8 + 0)
#define                                 MD1CL0_bit          BANKMASK(MD1CARL), 0
// MD1CARL<MD1CL1>
extern volatile __bit                   MD1CL1              __at(0x1E7E9);	// @ (0x3CFD * 8 + 1)
#define                                 MD1CL1_bit          BANKMASK(MD1CARL), 1
// MD1CARL<MD1CL2>
extern volatile __bit                   MD1CL2              __at(0x1E7EA);	// @ (0x3CFD * 8 + 2)
#define                                 MD1CL2_bit          BANKMASK(MD1CARL), 2
// MD1CARL<MD1CL3>
extern volatile __bit                   MD1CL3              __at(0x1E7EB);	// @ (0x3CFD * 8 + 3)
#define                                 MD1CL3_bit          BANKMASK(MD1CARL), 3
// MD1CARL<MD1CL4>
extern volatile __bit                   MD1CL4              __at(0x1E7EC);	// @ (0x3CFD * 8 + 4)
#define                                 MD1CL4_bit          BANKMASK(MD1CARL), 4
// MD1CON1<MD1CLPOL>
extern volatile __bit                   MD1CLPOL            __at(0x1E7D9);	// @ (0x3CFB * 8 + 1)
#define                                 MD1CLPOL_bit        BANKMASK(MD1CON1), 1
// MD1CON1<MD1CLSYNC>
extern volatile __bit                   MD1CLSYNC           __at(0x1E7D8);	// @ (0x3CFB * 8 + 0)
#define                                 MD1CLSYNC_bit       BANKMASK(MD1CON1), 0
// MD1CON0<MD1EN>
extern volatile __bit                   MD1EN               __at(0x1E7D7);	// @ (0x3CFA * 8 + 7)
#define                                 MD1EN_bit           BANKMASK(MD1CON0), 7
// MD1SRC<MD1MS0>
extern volatile __bit                   MD1MS0              __at(0x1E7E0);	// @ (0x3CFC * 8 + 0)
#define                                 MD1MS0_bit          BANKMASK(MD1SRC), 0
// MD1SRC<MD1MS1>
extern volatile __bit                   MD1MS1              __at(0x1E7E1);	// @ (0x3CFC * 8 + 1)
#define                                 MD1MS1_bit          BANKMASK(MD1SRC), 1
// MD1SRC<MD1MS2>
extern volatile __bit                   MD1MS2              __at(0x1E7E2);	// @ (0x3CFC * 8 + 2)
#define                                 MD1MS2_bit          BANKMASK(MD1SRC), 2
// MD1SRC<MD1MS3>
extern volatile __bit                   MD1MS3              __at(0x1E7E3);	// @ (0x3CFC * 8 + 3)
#define                                 MD1MS3_bit          BANKMASK(MD1SRC), 3
// MD1SRC<MD1MS4>
extern volatile __bit                   MD1MS4              __at(0x1E7E4);	// @ (0x3CFC * 8 + 4)
#define                                 MD1MS4_bit          BANKMASK(MD1SRC), 4
// MD1CON0<MD1OPOL>
extern volatile __bit                   MD1OPOL             __at(0x1E7D4);	// @ (0x3CFA * 8 + 4)
#define                                 MD1OPOL_bit         BANKMASK(MD1CON0), 4
// MD1CON0<MD1OUT>
extern volatile __bit                   MD1OUT              __at(0x1E7D5);	// @ (0x3CFA * 8 + 5)
#define                                 MD1OUT_bit          BANKMASK(MD1CON0), 5
// ADCON2<MD2>
extern volatile __bit                   MD2                 __at(0x1F7D2);	// @ (0x3EFA * 8 + 2)
#define                                 MD2_bit             BANKMASK(ADCON2), 2
// PCON1<MEMV>
extern volatile __bit                   MEMV                __at(0x1FF89);	// @ (0x3FF1 * 8 + 1)
#define                                 MEMV_bit            BANKMASK(PCON1), 1
// OSCEN<MFOEN>
extern volatile __bit                   MFOEN               __at(0x1CEED);	// @ (0x39DD * 8 + 5)
#define                                 MFOEN_bit           BANKMASK(OSCEN), 5
// OSCSTAT<MFOR>
extern volatile __bit                   MFOR                __at(0x1CEE5);	// @ (0x39DC * 8 + 5)
#define                                 MFOR_bit            BANKMASK(OSCSTAT), 5
// SCANCON0<MREG>
extern volatile __bit                   MREG                __at(0x1CBE2);	// @ (0x397C * 8 + 2)
#define                                 MREG_bit            BANKMASK(SCANCON0), 2
// MD1SRC<MS0>
