LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   ODCA0               __at(0x1D210);	// @ (0x3A42 * 8 + 0)
#define                                 ODCA0_bit           BANKMASK(ODCONA), 0
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x1D211);	// @ (0x3A42 * 8 + 1)
#define                                 ODCA1_bit           BANKMASK(ODCONA), 1
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x1D212);	// @ (0x3A42 * 8 + 2)
#define                                 ODCA2_bit           BANKMASK(ODCONA), 2
// ODCONA<ODCA3>
extern volatile __bit                   ODCA3               __at(0x1D213);	// @ (0x3A42 * 8 + 3)
#define                                 ODCA3_bit           BANKMASK(ODCONA), 3
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x1D214);	// @ (0x3A42 * 8 + 4)
#define                                 ODCA4_bit           BANKMASK(ODCONA), 4
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x1D215);	// @ (0x3A42 * 8 + 5)
#define                                 ODCA5_bit           BANKMASK(ODCONA), 5
// ODCONA<ODCA6>
extern volatile __bit                   ODCA6               __at(0x1D216);	// @ (0x3A42 * 8 + 6)
#define                                 ODCA6_bit           BANKMASK(ODCONA), 6
// ODCONA<ODCA7>
extern volatile __bit                   ODCA7               __at(0x1D217);	// @ (0x3A42 * 8 + 7)
#define                                 ODCA7_bit           BANKMASK(ODCONA), 7
// ODCONB<ODCB0>
extern volatile __bit                   ODCB0               __at(0x1D290);	// @ (0x3A52 * 8 + 0)
#define                                 ODCB0_bit           BANKMASK(ODCONB), 0
// ODCONB<ODCB1>
extern volatile __bit                   ODCB1               __at(0x1D291);	// @ (0x3A52 * 8 + 1)
#define                                 ODCB1_bit           BANKMASK(ODCONB), 1
// ODCONB<ODCB2>
extern volatile __bit                   ODCB2               __at(0x1D292);	// @ (0x3A52 * 8 + 2)
#define                                 ODCB2_bit           BANKMASK(ODCONB), 2
// ODCONB<ODCB3>
extern volatile __bit                   ODCB3               __at(0x1D293);	// @ (0x3A52 * 8 + 3)
#define                                 ODCB3_bit           BANKMASK(ODCONB), 3
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x1D294);	// @ (0x3A52 * 8 + 4)
#define                                 ODCB4_bit           BANKMASK(ODCONB), 4
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x1D295);	// @ (0x3A52 * 8 + 5)
#define                                 ODCB5_bit           BANKMASK(ODCONB), 5
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x1D296);	// @ (0x3A52 * 8 + 6)
#define                                 ODCB6_bit           BANKMASK(ODCONB), 6
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x1D297);	// @ (0x3A52 * 8 + 7)
#define                                 ODCB7_bit           BANKMASK(ODCONB), 7
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x1D310);	// @ (0x3A62 * 8 + 0)
#define                                 ODCC0_bit           BANKMASK(ODCONC), 0
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x1D311);	// @ (0x3A62 * 8 + 1)
#define                                 ODCC1_bit           BANKMASK(ODCONC), 1
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x1D312);	// @ (0x3A62 * 8 + 2)
#define                                 ODCC2_bit           BANKMASK(ODCONC), 2
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x1D313);	// @ (0x3A62 * 8 + 3)
#define                                 ODCC3_bit           BANKMASK(ODCONC), 3
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x1D314);	// @ (0x3A62 * 8 + 4)
#define                                 ODCC4_bit           BANKMASK(ODCONC), 4
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x1D315);	// @ (0x3A62 * 8 + 5)
#define                                 ODCC5_bit           BANKMASK(ODCONC), 5
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x1D316);	// @ (0x3A62 * 8 + 6)
#define                                 ODCC6_bit           BANKMASK(ODCONC), 6
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x1D317);	// @ (0x3A62 * 8 + 7)
#define                                 ODCC7_bit           BANKMASK(ODCONC), 7
// ODCOND<ODCD0>
extern volatile __bit                   ODCD0               __at(0x1D390);	// @ (0x3A72 * 8 + 0)
#define                                 ODCD0_bit           BANKMASK(ODCOND), 0
// ODCOND<ODCD1>
extern volatile __bit                   ODCD1               __at(0x1D391);	// @ (0x3A72 * 8 + 1)
#define                                 ODCD1_bit           BANKMASK(ODCOND), 1
// ODCOND<ODCD2>
extern volatile __bit                   ODCD2               __at(0x1D392);	// @ (0x3A72 * 8 + 2)
#define                                 ODCD2_bit           BANKMASK(ODCOND), 2
// ODCOND<ODCD3>
extern volatile __bit                   ODCD3               __at(0x1D393);	// @ (0x3A72 * 8 + 3)
#define                                 ODCD3_bit           BANKMASK(ODCOND), 3
// ODCOND<ODCD4>
extern volatile __bit                   ODCD4               __at(0x1D394);	// @ (0x3A72 * 8 + 4)
#define                                 ODCD4_bit           BANKMASK(ODCOND), 4
// ODCOND<ODCD5>
extern volatile __bit                   ODCD5               __at(0x1D395);	// @ (0x3A72 * 8 + 5)
#define                                 ODCD5_bit           BANKMASK(ODCOND), 5
// ODCOND<ODCD6>
extern volatile __bit                   ODCD6               __at(0x1D396);	// @ (0x3A72 * 8 + 6)
#define                                 ODCD6_bit           BANKMASK(ODCOND), 6
// ODCOND<ODCD7>
extern volatile __bit                   ODCD7               __at(0x1D397);	// @ (0x3A72 * 8 + 7)
#define                                 ODCD7_bit           BANKMASK(ODCOND), 7
// ODCONE<ODCE0>
extern volatile __bit                   ODCE0               __at(0x1D410);	// @ (0x3A82 * 8 + 0)
#define                                 ODCE0_bit           BANKMASK(ODCONE), 0
// ODCONE<ODCE1>
extern volatile __bit                   ODCE1               __at(0x1D411);	// @ (0x3A82 * 8 + 1)
#define                                 ODCE1_bit           BANKMASK(ODCONE), 1
// ODCONE<ODCE2>
extern volatile __bit                   ODCE2               __at(0x1D412);	// @ (0x3A82 * 8 + 2)
#define                                 ODCE2_bit           BANKMASK(ODCONE), 2
// DAC1CON0<OE1>
extern volatile __bit                   OE1                 __at(0x1F4F5);	// @ (0x3E9E * 8 + 5)
#define                                 OE1_bit             BANKMASK(DAC1CON0), 5
// DAC1CON0<OE2>
extern volatile __bit                   OE2                 __at(0x1F4F4);	// @ (0x3E9E * 8 + 4)
#define                                 OE2_bit             BANKMASK(DAC1CON0), 4
// MD1CON0<OPOL>
extern volatile __bit                   OPOL                __at(0x1E7D4);	// @ (0x3CFA * 8 + 4)
#define                                 OPOL_bit            BANKMASK(MD1CON0), 4
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x1CEDC);	// @ (0x39DB * 8 + 4)
#define                                 ORDY_bit            BANKMASK(OSCCON3), 4
// PIE0<OSFIE>
extern volatile __bit                   OSFIE               __at(0x1CC82);	// @ (0x3990 * 8 + 2)
#define                                 OSFIE_bit           BANKMASK(PIE0), 2
// PIR0<OSFIF>
extern volatile __bit                   OSFIF               __at(0x1CD02);	// @ (0x39A0 * 8 + 2)
#define                                 OSFIF_bit           BANKMASK(PIR0), 2
// IPR0<OSFIP>
extern volatile __bit                   OSFIP               __at(0x1CC02);	// @ (0x3980 * 8 + 2)
#define                                 OSFIP_bit           BANKMASK(IPR0), 2
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x1FEC3);	// @ (0x3FD8 * 8 + 3)
#define                                 OVERFLOW_bit        BANKMASK(STATUS), 3
// U1P1H<P1H>
extern volatile __bit                   P1H                 __at(0x1EF68);	// @ (0x3DED * 8 + 0)
#define                                 P1H_bit             BANKMASK(U1P1H), 0
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x1FBF7);	// @ (0x3F7E * 8 + 7)
#define                                 P1M1_bit            BANKMASK(CCP1CON), 7
// U1P2H<P2H>
extern volatile __bit                   P2H                 __at(0x1EF78);	// @ (0x3DEF * 8 + 0)
#define                                 P2H_bit             BANKMASK(U1P2H), 0
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x1FBD7);	// @ (0x3F7A * 8 + 7)
#define                                 P2M1_bit            BANKMASK(CCP2CON), 7
// U1P3H<P3H>
extern volatile __bit                   P3H                 __at(0x1EF88);	// @ (0x3DF1 * 8 + 0)
#define                                 P3H_bit             BANKMASK(U1P3H), 0
// CCP3CON<P3M1>
extern volatile __bit                   P3M1                __at(0x1FBB7);	// @ (0x3F76 * 8 + 7)
#define                                 P3M1_bit            BANKMASK(CCP3CON), 7
// CCP4CON<P4M1>
extern volatile __bit                   P4M1                __at(0x1FB97);	// @ (0x3F72 * 8 + 7)
#define                                 P4M1_bit            BANKMASK(CCP4CON), 7
// CCPTMRS1<P5TSEL0>
extern volatile __bit                   P5TSEL0             __at(0x1FAF8);	// @ (0x3F5F * 8 + 0)
#define                                 P5TSEL0_bit         BANKMASK(CCPTMRS1), 0
// CCPTMRS1<P5TSEL1>
extern volatile __bit                   P5TSEL1             __at(0x1FAF9);	// @ (0x3F5F * 8 + 1)
#define                                 P5TSEL1_bit         BANKMASK(CCPTMRS1), 1
// CCPTMRS1<P6TSEL0>
extern volatile __bit                   P6TSEL0             __at(0x1FAFA);	// @ (0x3F5F * 8 + 2)
#define                                 P6TSEL0_bit         BANKMASK(CCPTMRS1), 2
// CCPTMRS1<P6TSEL1>
extern volatile __bit                   P6TSEL1             __at(0x1FAFB);	// @ (0x3F5F * 8 + 3)
#define                                 P6TSEL1_bit         BANKMASK(CCPTMRS1), 3
// CCPTMRS1<P7TSEL0>
extern volatile __bit                   P7TSEL0             __at(0x1FAFC);	// @ (0x3F5F * 8 + 4)
#define                                 P7TSEL0_bit         BANKMASK(CCPTMRS1), 4
// CCPTMRS1<P7TSEL1>
extern volatile __bit                   P7TSEL1             __at(0x1FAFD);	// @ (0x3F5F * 8 + 5)
#define                                 P7TSEL1_bit         BANKMASK(CCPTMRS1), 5
// CCPTMRS1<P8TSEL0>
extern volatile __bit                   P8TSEL0             __at(0x1FAFE);	// @ (0x3F5F * 8 + 6)
#define                                 P8TSEL0_bit         BANKMASK(CCPTMRS1), 6
// CCPTMRS1<P8TSEL1>
extern volatile __bit                   P8TSEL1             __at(0x1FAFF);	// @ (0x3F5F * 8 + 7)
#define                                 P8TSEL1_bit         BANKMASK(CCPTMRS1), 7
// PORTC<PA1>
extern volatile __bit                   PA1                 __at(0x1FE62);	// @ (0x3FCC * 8 + 2)
#define                                 PA1_bit             BANKMASK(PORTC), 2
// PORTC<PA2>
extern volatile __bit                   PA2                 __at(0x1FE61);	// @ (0x3FCC * 8 + 1)
#define                                 PA2_bit             BANKMASK(PORTC), 1
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0x1EBD2);	// @ (0x3D7A * 8 + 2)
#define                                 PC1IE_bit           BANKMASK(I2C1PIE), 2
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0x1EBCA);	// @ (0x3D79 * 8 + 2)
#define                                 PC1IF_bit           BANKMASK(I2C1PIR), 2
// I2C2PIE<PC2IE>
extern volatile __bit                   PC2IE               __at(0x1EB22);	// @ (0x3D64 * 8 + 2)
#define                                 PC2IE_bit           BANKMASK(I2C2PIE), 2
// I2C2PIR<PC2IF>
extern volatile __bit                   PC2IF               __at(0x1EB1A);	// @ (0x3D63 * 8 + 2)
#define                                 PC2IF_bit           BANKMASK(I2C2PIR), 2
// PORTE<PC3E>
extern volatile __bit                   PC3E                __at(0x1FE73);	// @ (0x3FCE * 8 + 3)
#define                                 PC3E_bit            BANKMASK(PORTE), 3
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x1F9F0);	// @ (0x3F3E * 8 + 0)
#define                                 PFM_bit             BANKMASK(NCO1CON), 0
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x1CB48);	// @ (0x3969 * 8 + 0)
#define                                 PLEN0_bit           BANKMASK(CRCCON1), 0
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x1CB49);	// @ (0x3969 * 8 + 1)
#define                                 PLEN1_bit           BANKMASK(CRCCON1), 1
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x1CB4A);	// @ (0x3969 * 8 + 2)
#define                                 PLEN2_bit           BANKMASK(CRCCON1), 2
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x1CB4B);	// @ (0x3969 * 8 + 3)
#define                                 PLEN3_bit           BANKMASK(CRCCON1), 3
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x1CEE0);	// @ (0x39DC * 8 + 0)
#define                                 PLLR_bit            BANKMASK(OSCSTAT), 0
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x1FF81);	// @ (0x3FF0 * 8 + 1)
#define                                 POR_bit             BANKMASK(PCON0), 1
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x1F7CF);	// @ (0x3EF9 * 8 + 7)
#define                                 PPOL_bit            BANKMASK(ADCON1), 7
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x1D5F8);	// @ (0x3ABF * 8 + 0)
#define                                 PPSLOCKED_bit       BANKMASK(PPSLOCK), 0
// SMT1PRH<PR10>
extern volatile __bit                   PR10                __at(0x1F8E2);	// @ (0x3F1C * 8 + 2)
#define                                 PR10_bit            BANKMASK(SMT1PRH), 2
// SMT1PRH<PR11>
extern volatile __bit                   PR11                __at(0x1F8E3);	// @ (0x3F1C * 8 + 3)
#define                                 PR11_bit            BANKMASK(SMT1PRH), 3
// SMT1PRH<PR12>
extern volatile __bit                   PR12                __at(0x1F8E4);	// @ (0x3F1C * 8 + 4)
#define                                 PR12_bit            BANKMASK(SMT1PRH), 4
// SMT1PRH<PR13>
extern volatile __bit                   PR13                __at(0x1F8E5);	// @ (0x3F1C * 8 + 5)
#define                                 PR13_bit            BANKMASK(SMT1PRH), 5
// SMT1PRH<PR14>
extern volatile __bit                   PR14                __at(0x1F8E6);	// @ (0x3F1C * 8 + 6)
#define                                 PR14_bit            BANKMASK(SMT1PRH), 6
// SMT1PRH<PR15>
extern volatile __bit                   PR15                __at(0x1F8E7);	// @ (0x3F1C * 8 + 7)
#define                                 PR15_bit            BANKMASK(SMT1PRH), 7
// SMT1PRU<PR16>
extern volatile __bit                   PR16                __at(0x1F8E8);	// @ (0x3F1D * 8 + 0)
#define                                 PR16_bit            BANKMASK(SMT1PRU), 0
// SMT1PRU<PR17>
extern volatile __bit                   PR17                __at(0x1F8E9);	// @ (0x3F1D * 8 + 1)
#define                                 PR17_bit            BANKMASK(SMT1PRU), 1
// SMT1PRU<PR18>
extern volatile __bit                   PR18                __at(0x1F8EA);	// @ (0x3F1D * 8 + 2)
#define                                 PR18_bit            BANKMASK(SMT1PRU), 2
// SMT1PRU<PR19>
extern volatile __bit                   PR19                __at(0x1F8EB);	// @ (0x3F1D * 8 + 3)
#define                                 PR19_bit            BANKMASK(SMT1PRU), 3
// SMT1PRU<PR20>
extern volatile __bit                   PR20                __at(0x1F8EC);	// @ (0x3F1D * 8 + 4)
#define                                 PR20_bit            BANKMASK(SMT1PRU), 4
// SMT1PRU<PR21>
extern volatile __bit                   PR21                __at(0x1F8ED);	// @ (0x3F1D * 8 + 5)
#define                                 PR21_bit            BANKMASK(SMT1PRU), 5
// SMT1PRU<PR22>
extern volatile __bit                   PR22                __at(0x1F8EE);	// @ (0x3F1D * 8 + 6)
#define                                 PR22_bit            BANKMASK(SMT1PRU), 6
// SMT1PRU<PR23>
extern volatile __bit                   PR23                __at(0x1F8EF);	// @ (0x3F1D * 8 + 7)
#define                                 PR23_bit            BANKMASK(SMT1PRU), 7
// SMT1PRL<PR3>
extern volatile __bit                   PR3                 __at(0x1F8DB);	// @ (0x3F1B * 8 + 3)
#define                                 PR3_bit             BANKMASK(SMT1PRL), 3
// SMT1PRL<PR5>
extern volatile __bit                   PR5                 __at(0x1F8DD);	// @ (0x3F1B * 8 + 5)
#define                                 PR5_bit             BANKMASK(SMT1PRL), 5
// SMT1PRL<PR7>
extern volatile __bit                   PR7                 __at(0x1F8DF);	// @ (0x3F1B * 8 + 7)
#define                                 PR7_bit             BANKMASK(SMT1PRL), 7
// SMT1PRH<PR8>
extern volatile __bit                   PR8                 __at(0x1F8E0);	// @ (0x3F1C * 8 + 0)
#define                                 PR8_bit             BANKMASK(SMT1PRH), 0
// SMT1PRH<PR9>
extern volatile __bit                   PR9                 __at(0x1F8E1);	// @ (0x3F1C * 8 + 1)
#define                                 PR9_bit             BANKMASK(SMT1PRH), 1
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0x1F7B0);	// @ (0x3EF6 * 8 + 0)
#define                                 PRE0_bit            BANKMASK(ADPREL), 0
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0x1F7B1);	// @ (0x3EF6 * 8 + 1)
#define                                 PRE1_bit            BANKMASK(ADPREL), 1
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0x1F7BA);	// @ (0x3EF7 * 8 + 2)
#define                                 PRE10_bit           BANKMASK(ADPREH), 2
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0x1F7BB);	// @ (0x3EF7 * 8 + 3)
#define                                 PRE11_bit           BANKMASK(ADPREH), 3
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0x1F7BC);	// @ (0x3EF7 * 8 + 4)
#define                                 PRE12_bit           BANKMASK(ADPREH), 4
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0x1F7B2);	// @ (0x3EF6 * 8 + 2)
#define                                 PRE2_bit            BANKMASK(ADPREL), 2
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0x1F7B3);	// @ (0x3EF6 * 8 + 3)
#define                                 PRE3_bit            BANKMASK(ADPREL), 3
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0x1F7B4);	// @ (0x3EF6 * 8 + 4)
#define                                 PRE4_bit            BANKMASK(ADPREL), 4
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0x1F7B5);	// @ (0x3EF6 * 8 + 5)
#define                                 PRE5_bit            BANKMASK(ADPREL), 5
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0x1F7B6);	// @ (0x3EF6 * 8 + 6)
#define                                 PRE6_bit            BANKMASK(ADPREL), 6
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0x1F7B7);	// @ (0x3EF6 * 8 + 7)
#define                                 PRE7_bit            BANKMASK(ADPREL), 7
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0x1F7B8);	// @ (0x3EF7 * 8 + 0)
#define                                 PRE8_bit            BANKMASK(ADPREH), 0
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0x1F7B9);	// @ (0x3EF7 * 8 + 1)
#define                                 PRE9_bit            BANKMASK(ADPREH), 1
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0x1F7E8);	// @ (0x3EFD * 8 + 0)
#define                                 PREF0_bit           BANKMASK(ADREF), 0
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0x1F7E9);	// @ (0x3EFD * 8 + 1)
#define                                 PREF1_bit           BANKMASK(ADREF), 1
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0x1F768);	// @ (0x3EED * 8 + 0)
#define                                 PREV0_bit           BANKMASK(ADPREVL), 0
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0x1F769);	// @ (0x3EED * 8 + 1)
#define                                 PREV1_bit           BANKMASK(ADPREVL), 1
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0x1F772);	// @ (0x3EEE * 8 + 2)
#define                                 PREV10_bit          BANKMASK(ADPREVH), 2
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0x1F773);	// @ (0x3EEE * 8 + 3)
#define                                 PREV11_bit          BANKMASK(ADPREVH), 3
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0x1F774);	// @ (0x3EEE * 8 + 4)
#define                                 PREV12_bit          BANKMASK(ADPREVH), 4
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0x1F775);	// @ (0x3EEE * 8 + 5)
#define                                 PREV13_bit          BANKMASK(ADPREVH), 5
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0x1F776);	// @ (0x3EEE * 8 + 6)
#define                                 PREV14_bit          BANKMASK(ADPREVH), 6
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0x1F777);	// @ (0x3EEE * 8 + 7)
#define                                 PREV15_bit          BANKMASK(ADPREVH), 7
// ADPREVL<PREV2>
extern volatile __bit                   PREV2               __at(0x1F76A);	// @ (0x3EED * 8 + 2)
#define                                 PREV2_bit           BANKMASK(ADPREVL), 2
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0x1F76B);	// @ (0x3EED * 8 + 3)
#define                                 PREV3_bit           BANKMASK(ADPREVL), 3
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0x1F76C);	// @ (0x3EED * 8 + 4)
#define                                 PREV4_bit           BANKMASK(ADPREVL), 4
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0x1F76D);	// @ (0x3EED * 8 + 5)
#define                                 PREV5_bit           BANKMASK(ADPREVL), 5
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0x1F76E);	// @ (0x3EED * 8 + 6)
#define                                 PREV6_bit           BANKMASK(ADPREVL), 6
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0x1F76F);	// @ (0x3EED * 8 + 7)
#define                                 PREV7_bit           BANKMASK(ADPREVL), 7
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0x1F770);	// @ (0x3EEE * 8 + 0)
#define                                 PREV8_bit           BANKMASK(ADPREVH), 0
// ADPREVH<PREV9>
