LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   PREV9               __at(0x1F771);	// @ (0x3EEE * 8 + 1)
#define                                 PREV9_bit           BANKMASK(ADPREVH), 1
// PRLOCK<PRLOCKED>
extern volatile __bit                   PRLOCKED            __at(0x1CF78);	// @ (0x39EF * 8 + 0)
#define                                 PRLOCKED_bit        BANKMASK(PRLOCK), 0
// SMT1CON0<PS0>
extern volatile __bit                   PS0                 __at(0x1F8F0);	// @ (0x3F1E * 8 + 0)
#define                                 PS0_bit             BANKMASK(SMT1CON0), 0
// SMT1CON0<PS1>
extern volatile __bit                   PS1                 __at(0x1F8F1);	// @ (0x3F1E * 8 + 1)
#define                                 PS1_bit             BANKMASK(SMT1CON0), 1
// WDTPSL<PSCNT0>
extern volatile __bit                   PSCNT0              __at(0x1CAE8);	// @ (0x395D * 8 + 0)
#define                                 PSCNT0_bit          BANKMASK(WDTPSL), 0
// WDTPSL<PSCNT1>
extern volatile __bit                   PSCNT1              __at(0x1CAE9);	// @ (0x395D * 8 + 1)
#define                                 PSCNT1_bit          BANKMASK(WDTPSL), 1
// WDTPSH<PSCNT10>
extern volatile __bit                   PSCNT10             __at(0x1CAF2);	// @ (0x395E * 8 + 2)
#define                                 PSCNT10_bit         BANKMASK(WDTPSH), 2
// WDTPSH<PSCNT11>
extern volatile __bit                   PSCNT11             __at(0x1CAF3);	// @ (0x395E * 8 + 3)
#define                                 PSCNT11_bit         BANKMASK(WDTPSH), 3
// WDTPSH<PSCNT12>
extern volatile __bit                   PSCNT12             __at(0x1CAF4);	// @ (0x395E * 8 + 4)
#define                                 PSCNT12_bit         BANKMASK(WDTPSH), 4
// WDTPSH<PSCNT13>
extern volatile __bit                   PSCNT13             __at(0x1CAF5);	// @ (0x395E * 8 + 5)
#define                                 PSCNT13_bit         BANKMASK(WDTPSH), 5
// WDTPSH<PSCNT14>
extern volatile __bit                   PSCNT14             __at(0x1CAF6);	// @ (0x395E * 8 + 6)
#define                                 PSCNT14_bit         BANKMASK(WDTPSH), 6
// WDTPSH<PSCNT15>
extern volatile __bit                   PSCNT15             __at(0x1CAF7);	// @ (0x395E * 8 + 7)
#define                                 PSCNT15_bit         BANKMASK(WDTPSH), 7
// WDTTMR<PSCNT16>
extern volatile __bit                   PSCNT16             __at(0x1CAF8);	// @ (0x395F * 8 + 0)
#define                                 PSCNT16_bit         BANKMASK(WDTTMR), 0
// WDTTMR<PSCNT17>
extern volatile __bit                   PSCNT17             __at(0x1CAF9);	// @ (0x395F * 8 + 1)
#define                                 PSCNT17_bit         BANKMASK(WDTTMR), 1
// WDTPSL<PSCNT2>
extern volatile __bit                   PSCNT2              __at(0x1CAEA);	// @ (0x395D * 8 + 2)
#define                                 PSCNT2_bit          BANKMASK(WDTPSL), 2
// WDTPSL<PSCNT3>
extern volatile __bit                   PSCNT3              __at(0x1CAEB);	// @ (0x395D * 8 + 3)
#define                                 PSCNT3_bit          BANKMASK(WDTPSL), 3
// WDTPSL<PSCNT4>
extern volatile __bit                   PSCNT4              __at(0x1CAEC);	// @ (0x395D * 8 + 4)
#define                                 PSCNT4_bit          BANKMASK(WDTPSL), 4
// WDTPSL<PSCNT5>
extern volatile __bit                   PSCNT5              __at(0x1CAED);	// @ (0x395D * 8 + 5)
#define                                 PSCNT5_bit          BANKMASK(WDTPSL), 5
// WDTPSL<PSCNT6>
extern volatile __bit                   PSCNT6              __at(0x1CAEE);	// @ (0x395D * 8 + 6)
#define                                 PSCNT6_bit          BANKMASK(WDTPSL), 6
// WDTPSL<PSCNT7>
extern volatile __bit                   PSCNT7              __at(0x1CAEF);	// @ (0x395D * 8 + 7)
#define                                 PSCNT7_bit          BANKMASK(WDTPSL), 7
// WDTPSH<PSCNT8>
extern volatile __bit                   PSCNT8              __at(0x1CAF0);	// @ (0x395E * 8 + 0)
#define                                 PSCNT8_bit          BANKMASK(WDTPSH), 0
// WDTPSH<PSCNT9>
extern volatile __bit                   PSCNT9              __at(0x1CAF1);	// @ (0x395E * 8 + 1)
#define                                 PSCNT9_bit          BANKMASK(WDTPSH), 1
// ADCON2<PSIS>
extern volatile __bit                   PSIS                __at(0x1F7D7);	// @ (0x3EFA * 8 + 7)
#define                                 PSIS_bit            BANKMASK(ADCON2), 7
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x1CC8F);	// @ (0x3991 * 8 + 7)
#define                                 PSPIE_bit           BANKMASK(PIE1), 7
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x1CD0F);	// @ (0x39A1 * 8 + 7)
#define                                 PSPIF_bit           BANKMASK(PIR1), 7
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x1CC0F);	// @ (0x3981 * 8 + 7)
#define                                 PSPIP_bit           BANKMASK(IPR1), 7
// DAC1CON0<PSS0>
extern volatile __bit                   PSS0                __at(0x1F4F2);	// @ (0x3E9E * 8 + 2)
#define                                 PSS0_bit            BANKMASK(DAC1CON0), 2
// DAC1CON0<PSS1>
extern volatile __bit                   PSS1                __at(0x1F4F3);	// @ (0x3E9E * 8 + 3)
#define                                 PSS1_bit            BANKMASK(DAC1CON0), 3
// PWM5DCL<PWM5DC0>
extern volatile __bit                   PWM5DC0             __at(0x1FB66);	// @ (0x3F6C * 8 + 6)
#define                                 PWM5DC0_bit         BANKMASK(PWM5DCL), 6
// PWM5DCL<PWM5DC1>
extern volatile __bit                   PWM5DC1             __at(0x1FB67);	// @ (0x3F6C * 8 + 7)
#define                                 PWM5DC1_bit         BANKMASK(PWM5DCL), 7
// PWM5DCH<PWM5DC2>
extern volatile __bit                   PWM5DC2             __at(0x1FB68);	// @ (0x3F6D * 8 + 0)
#define                                 PWM5DC2_bit         BANKMASK(PWM5DCH), 0
// PWM5DCH<PWM5DC3>
extern volatile __bit                   PWM5DC3             __at(0x1FB69);	// @ (0x3F6D * 8 + 1)
#define                                 PWM5DC3_bit         BANKMASK(PWM5DCH), 1
// PWM5DCH<PWM5DC4>
extern volatile __bit                   PWM5DC4             __at(0x1FB6A);	// @ (0x3F6D * 8 + 2)
#define                                 PWM5DC4_bit         BANKMASK(PWM5DCH), 2
// PWM5DCH<PWM5DC5>
extern volatile __bit                   PWM5DC5             __at(0x1FB6B);	// @ (0x3F6D * 8 + 3)
#define                                 PWM5DC5_bit         BANKMASK(PWM5DCH), 3
// PWM5DCH<PWM5DC6>
extern volatile __bit                   PWM5DC6             __at(0x1FB6C);	// @ (0x3F6D * 8 + 4)
#define                                 PWM5DC6_bit         BANKMASK(PWM5DCH), 4
// PWM5DCH<PWM5DC7>
extern volatile __bit                   PWM5DC7             __at(0x1FB6D);	// @ (0x3F6D * 8 + 5)
#define                                 PWM5DC7_bit         BANKMASK(PWM5DCH), 5
// PWM5DCH<PWM5DC8>
extern volatile __bit                   PWM5DC8             __at(0x1FB6E);	// @ (0x3F6D * 8 + 6)
#define                                 PWM5DC8_bit         BANKMASK(PWM5DCH), 6
// PWM5DCH<PWM5DC9>
extern volatile __bit                   PWM5DC9             __at(0x1FB6F);	// @ (0x3F6D * 8 + 7)
#define                                 PWM5DC9_bit         BANKMASK(PWM5DCH), 7
// PWM5CON<PWM5EN>
extern volatile __bit                   PWM5EN              __at(0x1FB77);	// @ (0x3F6E * 8 + 7)
#define                                 PWM5EN_bit          BANKMASK(PWM5CON), 7
// PMD3<PWM5MD>
extern volatile __bit                   PWM5MD              __at(0x1CE1C);	// @ (0x39C3 * 8 + 4)
#define                                 PWM5MD_bit          BANKMASK(PMD3), 4
// PWM5CON<PWM5OUT>
extern volatile __bit                   PWM5OUT             __at(0x1FB75);	// @ (0x3F6E * 8 + 5)
#define                                 PWM5OUT_bit         BANKMASK(PWM5CON), 5
// PWM5CON<PWM5POL>
extern volatile __bit                   PWM5POL             __at(0x1FB74);	// @ (0x3F6E * 8 + 4)
#define                                 PWM5POL_bit         BANKMASK(PWM5CON), 4
// PWM6DCL<PWM6DC0>
extern volatile __bit                   PWM6DC0             __at(0x1FB46);	// @ (0x3F68 * 8 + 6)
#define                                 PWM6DC0_bit         BANKMASK(PWM6DCL), 6
// PWM6DCL<PWM6DC1>
extern volatile __bit                   PWM6DC1             __at(0x1FB47);	// @ (0x3F68 * 8 + 7)
#define                                 PWM6DC1_bit         BANKMASK(PWM6DCL), 7
// PWM6DCH<PWM6DC2>
extern volatile __bit                   PWM6DC2             __at(0x1FB48);	// @ (0x3F69 * 8 + 0)
#define                                 PWM6DC2_bit         BANKMASK(PWM6DCH), 0
// PWM6DCH<PWM6DC3>
extern volatile __bit                   PWM6DC3             __at(0x1FB49);	// @ (0x3F69 * 8 + 1)
#define                                 PWM6DC3_bit         BANKMASK(PWM6DCH), 1
// PWM6DCH<PWM6DC4>
extern volatile __bit                   PWM6DC4             __at(0x1FB4A);	// @ (0x3F69 * 8 + 2)
#define                                 PWM6DC4_bit         BANKMASK(PWM6DCH), 2
// PWM6DCH<PWM6DC5>
extern volatile __bit                   PWM6DC5             __at(0x1FB4B);	// @ (0x3F69 * 8 + 3)
#define                                 PWM6DC5_bit         BANKMASK(PWM6DCH), 3
// PWM6DCH<PWM6DC6>
extern volatile __bit                   PWM6DC6             __at(0x1FB4C);	// @ (0x3F69 * 8 + 4)
#define                                 PWM6DC6_bit         BANKMASK(PWM6DCH), 4
// PWM6DCH<PWM6DC7>
extern volatile __bit                   PWM6DC7             __at(0x1FB4D);	// @ (0x3F69 * 8 + 5)
#define                                 PWM6DC7_bit         BANKMASK(PWM6DCH), 5
// PWM6DCH<PWM6DC8>
extern volatile __bit                   PWM6DC8             __at(0x1FB4E);	// @ (0x3F69 * 8 + 6)
#define                                 PWM6DC8_bit         BANKMASK(PWM6DCH), 6
// PWM6DCH<PWM6DC9>
extern volatile __bit                   PWM6DC9             __at(0x1FB4F);	// @ (0x3F69 * 8 + 7)
#define                                 PWM6DC9_bit         BANKMASK(PWM6DCH), 7
// PWM6CON<PWM6EN>
extern volatile __bit                   PWM6EN              __at(0x1FB57);	// @ (0x3F6A * 8 + 7)
#define                                 PWM6EN_bit          BANKMASK(PWM6CON), 7
// PMD3<PWM6MD>
extern volatile __bit                   PWM6MD              __at(0x1CE1D);	// @ (0x39C3 * 8 + 5)
#define                                 PWM6MD_bit          BANKMASK(PMD3), 5
// PWM6CON<PWM6OUT>
extern volatile __bit                   PWM6OUT             __at(0x1FB55);	// @ (0x3F6A * 8 + 5)
#define                                 PWM6OUT_bit         BANKMASK(PWM6CON), 5
// PWM6CON<PWM6POL>
extern volatile __bit                   PWM6POL             __at(0x1FB54);	// @ (0x3F6A * 8 + 4)
#define                                 PWM6POL_bit         BANKMASK(PWM6CON), 4
// PWM7DCL<PWM7DC0>
extern volatile __bit                   PWM7DC0             __at(0x1FB26);	// @ (0x3F64 * 8 + 6)
#define                                 PWM7DC0_bit         BANKMASK(PWM7DCL), 6
// PWM7DCL<PWM7DC1>
extern volatile __bit                   PWM7DC1             __at(0x1FB27);	// @ (0x3F64 * 8 + 7)
#define                                 PWM7DC1_bit         BANKMASK(PWM7DCL), 7
// PWM7DCH<PWM7DC2>
extern volatile __bit                   PWM7DC2             __at(0x1FB28);	// @ (0x3F65 * 8 + 0)
#define                                 PWM7DC2_bit         BANKMASK(PWM7DCH), 0
// PWM7DCH<PWM7DC3>
extern volatile __bit                   PWM7DC3             __at(0x1FB29);	// @ (0x3F65 * 8 + 1)
#define                                 PWM7DC3_bit         BANKMASK(PWM7DCH), 1
// PWM7DCH<PWM7DC4>
extern volatile __bit                   PWM7DC4             __at(0x1FB2A);	// @ (0x3F65 * 8 + 2)
#define                                 PWM7DC4_bit         BANKMASK(PWM7DCH), 2
// PWM7DCH<PWM7DC5>
extern volatile __bit                   PWM7DC5             __at(0x1FB2B);	// @ (0x3F65 * 8 + 3)
#define                                 PWM7DC5_bit         BANKMASK(PWM7DCH), 3
// PWM7DCH<PWM7DC6>
extern volatile __bit                   PWM7DC6             __at(0x1FB2C);	// @ (0x3F65 * 8 + 4)
#define                                 PWM7DC6_bit         BANKMASK(PWM7DCH), 4
// PWM7DCH<PWM7DC7>
extern volatile __bit                   PWM7DC7             __at(0x1FB2D);	// @ (0x3F65 * 8 + 5)
#define                                 PWM7DC7_bit         BANKMASK(PWM7DCH), 5
// PWM7DCH<PWM7DC8>
extern volatile __bit                   PWM7DC8             __at(0x1FB2E);	// @ (0x3F65 * 8 + 6)
#define                                 PWM7DC8_bit         BANKMASK(PWM7DCH), 6
// PWM7DCH<PWM7DC9>
extern volatile __bit                   PWM7DC9             __at(0x1FB2F);	// @ (0x3F65 * 8 + 7)
#define                                 PWM7DC9_bit         BANKMASK(PWM7DCH), 7
// PWM7CON<PWM7EN>
extern volatile __bit                   PWM7EN              __at(0x1FB37);	// @ (0x3F66 * 8 + 7)
#define                                 PWM7EN_bit          BANKMASK(PWM7CON), 7
// PMD3<PWM7MD>
extern volatile __bit                   PWM7MD              __at(0x1CE1E);	// @ (0x39C3 * 8 + 6)
#define                                 PWM7MD_bit          BANKMASK(PMD3), 6
// PWM7CON<PWM7OUT>
extern volatile __bit                   PWM7OUT             __at(0x1FB35);	// @ (0x3F66 * 8 + 5)
#define                                 PWM7OUT_bit         BANKMASK(PWM7CON), 5
// PWM7CON<PWM7POL>
extern volatile __bit                   PWM7POL             __at(0x1FB34);	// @ (0x3F66 * 8 + 4)
#define                                 PWM7POL_bit         BANKMASK(PWM7CON), 4
// PWM8DCL<PWM8DC0>
extern volatile __bit                   PWM8DC0             __at(0x1FB06);	// @ (0x3F60 * 8 + 6)
#define                                 PWM8DC0_bit         BANKMASK(PWM8DCL), 6
// PWM8DCL<PWM8DC1>
extern volatile __bit                   PWM8DC1             __at(0x1FB07);	// @ (0x3F60 * 8 + 7)
#define                                 PWM8DC1_bit         BANKMASK(PWM8DCL), 7
// PWM8DCH<PWM8DC2>
extern volatile __bit                   PWM8DC2             __at(0x1FB08);	// @ (0x3F61 * 8 + 0)
#define                                 PWM8DC2_bit         BANKMASK(PWM8DCH), 0
// PWM8DCH<PWM8DC3>
extern volatile __bit                   PWM8DC3             __at(0x1FB09);	// @ (0x3F61 * 8 + 1)
#define                                 PWM8DC3_bit         BANKMASK(PWM8DCH), 1
// PWM8DCH<PWM8DC4>
extern volatile __bit                   PWM8DC4             __at(0x1FB0A);	// @ (0x3F61 * 8 + 2)
#define                                 PWM8DC4_bit         BANKMASK(PWM8DCH), 2
// PWM8DCH<PWM8DC5>
extern volatile __bit                   PWM8DC5             __at(0x1FB0B);	// @ (0x3F61 * 8 + 3)
#define                                 PWM8DC5_bit         BANKMASK(PWM8DCH), 3
// PWM8DCH<PWM8DC6>
extern volatile __bit                   PWM8DC6             __at(0x1FB0C);	// @ (0x3F61 * 8 + 4)
#define                                 PWM8DC6_bit         BANKMASK(PWM8DCH), 4
// PWM8DCH<PWM8DC7>
extern volatile __bit                   PWM8DC7             __at(0x1FB0D);	// @ (0x3F61 * 8 + 5)
#define                                 PWM8DC7_bit         BANKMASK(PWM8DCH), 5
// PWM8DCH<PWM8DC8>
extern volatile __bit                   PWM8DC8             __at(0x1FB0E);	// @ (0x3F61 * 8 + 6)
#define                                 PWM8DC8_bit         BANKMASK(PWM8DCH), 6
// PWM8DCH<PWM8DC9>
extern volatile __bit                   PWM8DC9             __at(0x1FB0F);	// @ (0x3F61 * 8 + 7)
#define                                 PWM8DC9_bit         BANKMASK(PWM8DCH), 7
// PWM8CON<PWM8EN>
extern volatile __bit                   PWM8EN              __at(0x1FB17);	// @ (0x3F62 * 8 + 7)
#define                                 PWM8EN_bit          BANKMASK(PWM8CON), 7
// PMD3<PWM8MD>
extern volatile __bit                   PWM8MD              __at(0x1CE1F);	// @ (0x39C3 * 8 + 7)
#define                                 PWM8MD_bit          BANKMASK(PMD3), 7
// PWM8CON<PWM8OUT>
extern volatile __bit                   PWM8OUT             __at(0x1FB15);	// @ (0x3F62 * 8 + 5)
#define                                 PWM8OUT_bit         BANKMASK(PWM8CON), 5
// PWM8CON<PWM8POL>
extern volatile __bit                   PWM8POL             __at(0x1FB14);	// @ (0x3F62 * 8 + 4)
#define                                 PWM8POL_bit         BANKMASK(PWM8CON), 4
// NCO1CLK<PWS0>
extern volatile __bit                   PWS0                __at(0x1F9FD);	// @ (0x3F3F * 8 + 5)
#define                                 PWS0_bit            BANKMASK(NCO1CLK), 5
// NCO1CLK<PWS1>
extern volatile __bit                   PWS1                __at(0x1F9FE);	// @ (0x3F3F * 8 + 6)
#define                                 PWS1_bit            BANKMASK(NCO1CLK), 6
// NCO1CLK<PWS2>
extern volatile __bit                   PWS2                __at(0x1F9FF);	// @ (0x3F3F * 8 + 7)
#define                                 PWS2_bit            BANKMASK(NCO1CLK), 7
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x1FE50);	// @ (0x3FCA * 8 + 0)
#define                                 RA0_bit             BANKMASK(PORTA), 0
// RA0PPS<RA0PPS0>
extern volatile __bit                   RA0PPS0             __at(0x1D000);	// @ (0x3A00 * 8 + 0)
#define                                 RA0PPS0_bit         BANKMASK(RA0PPS), 0
// RA0PPS<RA0PPS1>
extern volatile __bit                   RA0PPS1             __at(0x1D001);	// @ (0x3A00 * 8 + 1)
#define                                 RA0PPS1_bit         BANKMASK(RA0PPS), 1
// RA0PPS<RA0PPS2>
extern volatile __bit                   RA0PPS2             __at(0x1D002);	// @ (0x3A00 * 8 + 2)
#define                                 RA0PPS2_bit         BANKMASK(RA0PPS), 2
// RA0PPS<RA0PPS3>
extern volatile __bit                   RA0PPS3             __at(0x1D003);	// @ (0x3A00 * 8 + 3)
#define                                 RA0PPS3_bit         BANKMASK(RA0PPS), 3
// RA0PPS<RA0PPS4>
extern volatile __bit                   RA0PPS4             __at(0x1D004);	// @ (0x3A00 * 8 + 4)
#define                                 RA0PPS4_bit         BANKMASK(RA0PPS), 4
// RA0PPS<RA0PPS5>
extern volatile __bit                   RA0PPS5             __at(0x1D005);	// @ (0x3A00 * 8 + 5)
#define                                 RA0PPS5_bit         BANKMASK(RA0PPS), 5
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x1FE51);	// @ (0x3FCA * 8 + 1)
#define                                 RA1_bit             BANKMASK(PORTA), 1
// RA1PPS<RA1PPS0>
extern volatile __bit                   RA1PPS0             __at(0x1D008);	// @ (0x3A01 * 8 + 0)
#define                                 RA1PPS0_bit         BANKMASK(RA1PPS), 0
// RA1PPS<RA1PPS1>
extern volatile __bit                   RA1PPS1             __at(0x1D009);	// @ (0x3A01 * 8 + 1)
#define                                 RA1PPS1_bit         BANKMASK(RA1PPS), 1
// RA1PPS<RA1PPS2>
extern volatile __bit                   RA1PPS2             __at(0x1D00A);	// @ (0x3A01 * 8 + 2)
#define                                 RA1PPS2_bit         BANKMASK(RA1PPS), 2
// RA1PPS<RA1PPS3>
extern volatile __bit                   RA1PPS3             __at(0x1D00B);	// @ (0x3A01 * 8 + 3)
#define                                 RA1PPS3_bit         BANKMASK(RA1PPS), 3
// RA1PPS<RA1PPS4>
extern volatile __bit                   RA1PPS4             __at(0x1D00C);	// @ (0x3A01 * 8 + 4)
#define                                 RA1PPS4_bit         BANKMASK(RA1PPS), 4
// RA1PPS<RA1PPS5>
extern volatile __bit                   RA1PPS5             __at(0x1D00D);	// @ (0x3A01 * 8 + 5)
#define                                 RA1PPS5_bit         BANKMASK(RA1PPS), 5
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x1FE52);	// @ (0x3FCA * 8 + 2)
#define                                 RA2_bit             BANKMASK(PORTA), 2
// RA2PPS<RA2PPS0>
extern volatile __bit                   RA2PPS0             __at(0x1D010);	// @ (0x3A02 * 8 + 0)
#define                                 RA2PPS0_bit         BANKMASK(RA2PPS), 0
// RA2PPS<RA2PPS1>
extern volatile __bit                   RA2PPS1             __at(0x1D011);	// @ (0x3A02 * 8 + 1)
#define                                 RA2PPS1_bit         BANKMASK(RA2PPS), 1
// RA2PPS<RA2PPS2>
extern volatile __bit                   RA2PPS2             __at(0x1D012);	// @ (0x3A02 * 8 + 2)
#define                                 RA2PPS2_bit         BANKMASK(RA2PPS), 2
// RA2PPS<RA2PPS3>
extern volatile __bit                   RA2PPS3             __at(0x1D013);	// @ (0x3A02 * 8 + 3)
#define                                 RA2PPS3_bit         BANKMASK(RA2PPS), 3
// RA2PPS<RA2PPS4>
extern volatile __bit                   RA2PPS4             __at(0x1D014);	// @ (0x3A02 * 8 + 4)
#define                                 RA2PPS4_bit         BANKMASK(RA2PPS), 4
// RA2PPS<RA2PPS5>
extern volatile __bit                   RA2PPS5             __at(0x1D015);	// @ (0x3A02 * 8 + 5)
#define                                 RA2PPS5_bit         BANKMASK(RA2PPS), 5
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x1FE53);	// @ (0x3FCA * 8 + 3)
#define                                 RA3_bit             BANKMASK(PORTA), 3
// RA3PPS<RA3PPS0>
extern volatile __bit                   RA3PPS0             __at(0x1D018);	// @ (0x3A03 * 8 + 0)
#define                                 RA3PPS0_bit         BANKMASK(RA3PPS), 0
// RA3PPS<RA3PPS1>
extern volatile __bit                   RA3PPS1             __at(0x1D019);	// @ (0x3A03 * 8 + 1)
#define                                 RA3PPS1_bit         BANKMASK(RA3PPS), 1
// RA3PPS<RA3PPS2>
extern volatile __bit                   RA3PPS2             __at(0x1D01A);	// @ (0x3A03 * 8 + 2)
#define                                 RA3PPS2_bit         BANKMASK(RA3PPS), 2
// RA3PPS<RA3PPS3>
extern volatile __bit                   RA3PPS3             __at(0x1D01B);	// @ (0x3A03 * 8 + 3)
#define                                 RA3PPS3_bit         BANKMASK(RA3PPS), 3
// RA3PPS<RA3PPS4>
extern volatile __bit                   RA3PPS4             __at(0x1D01C);	// @ (0x3A03 * 8 + 4)
#define                                 RA3PPS4_bit         BANKMASK(RA3PPS), 4
// RA3PPS<RA3PPS5>
extern volatile __bit                   RA3PPS5             __at(0x1D01D);	// @ (0x3A03 * 8 + 5)
#define                                 RA3PPS5_bit         BANKMASK(RA3PPS), 5
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x1FE54);	// @ (0x3FCA * 8 + 4)
#define                                 RA4_bit             BANKMASK(PORTA), 4
// RA4PPS<RA4PPS0>
extern volatile __bit                   RA4PPS0             __at(0x1D020);	// @ (0x3A04 * 8 + 0)
#define                                 RA4PPS0_bit         BANKMASK(RA4PPS), 0
// RA4PPS<RA4PPS1>
extern volatile __bit                   RA4PPS1             __at(0x1D021);	// @ (0x3A04 * 8 + 1)
#define                                 RA4PPS1_bit         BANKMASK(RA4PPS), 1
// RA4PPS<RA4PPS2>
extern volatile __bit                   RA4PPS2             __at(0x1D022);	// @ (0x3A04 * 8 + 2)
#define                                 RA4PPS2_bit         BANKMASK(RA4PPS), 2
// RA4PPS<RA4PPS3>
extern volatile __bit                   RA4PPS3             __at(0x1D023);	// @ (0x3A04 * 8 + 3)
#define                                 RA4PPS3_bit         BANKMASK(RA4PPS), 3
// RA4PPS<RA4PPS4>
extern volatile __bit                   RA4PPS4             __at(0x1D024);	// @ (0x3A04 * 8 + 4)
#define                                 RA4PPS4_bit         BANKMASK(RA4PPS), 4
// RA4PPS<RA4PPS5>
extern volatile __bit                   RA4PPS5             __at(0x1D025);	// @ (0x3A04 * 8 + 5)
#define                                 RA4PPS5_bit         BANKMASK(RA4PPS), 5
// PORTA<RA5>
