LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   RA5                 __at(0x1FE55);	// @ (0x3FCA * 8 + 5)
#define                                 RA5_bit             BANKMASK(PORTA), 5
// RA5PPS<RA5PPS0>
extern volatile __bit                   RA5PPS0             __at(0x1D028);	// @ (0x3A05 * 8 + 0)
#define                                 RA5PPS0_bit         BANKMASK(RA5PPS), 0
// RA5PPS<RA5PPS1>
extern volatile __bit                   RA5PPS1             __at(0x1D029);	// @ (0x3A05 * 8 + 1)
#define                                 RA5PPS1_bit         BANKMASK(RA5PPS), 1
// RA5PPS<RA5PPS2>
extern volatile __bit                   RA5PPS2             __at(0x1D02A);	// @ (0x3A05 * 8 + 2)
#define                                 RA5PPS2_bit         BANKMASK(RA5PPS), 2
// RA5PPS<RA5PPS3>
extern volatile __bit                   RA5PPS3             __at(0x1D02B);	// @ (0x3A05 * 8 + 3)
#define                                 RA5PPS3_bit         BANKMASK(RA5PPS), 3
// RA5PPS<RA5PPS4>
extern volatile __bit                   RA5PPS4             __at(0x1D02C);	// @ (0x3A05 * 8 + 4)
#define                                 RA5PPS4_bit         BANKMASK(RA5PPS), 4
// RA5PPS<RA5PPS5>
extern volatile __bit                   RA5PPS5             __at(0x1D02D);	// @ (0x3A05 * 8 + 5)
#define                                 RA5PPS5_bit         BANKMASK(RA5PPS), 5
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x1FE56);	// @ (0x3FCA * 8 + 6)
#define                                 RA6_bit             BANKMASK(PORTA), 6
// RA6PPS<RA6PPS0>
extern volatile __bit                   RA6PPS0             __at(0x1D030);	// @ (0x3A06 * 8 + 0)
#define                                 RA6PPS0_bit         BANKMASK(RA6PPS), 0
// RA6PPS<RA6PPS1>
extern volatile __bit                   RA6PPS1             __at(0x1D031);	// @ (0x3A06 * 8 + 1)
#define                                 RA6PPS1_bit         BANKMASK(RA6PPS), 1
// RA6PPS<RA6PPS2>
extern volatile __bit                   RA6PPS2             __at(0x1D032);	// @ (0x3A06 * 8 + 2)
#define                                 RA6PPS2_bit         BANKMASK(RA6PPS), 2
// RA6PPS<RA6PPS3>
extern volatile __bit                   RA6PPS3             __at(0x1D033);	// @ (0x3A06 * 8 + 3)
#define                                 RA6PPS3_bit         BANKMASK(RA6PPS), 3
// RA6PPS<RA6PPS4>
extern volatile __bit                   RA6PPS4             __at(0x1D034);	// @ (0x3A06 * 8 + 4)
#define                                 RA6PPS4_bit         BANKMASK(RA6PPS), 4
// RA6PPS<RA6PPS5>
extern volatile __bit                   RA6PPS5             __at(0x1D035);	// @ (0x3A06 * 8 + 5)
#define                                 RA6PPS5_bit         BANKMASK(RA6PPS), 5
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x1FE57);	// @ (0x3FCA * 8 + 7)
#define                                 RA7_bit             BANKMASK(PORTA), 7
// RA7PPS<RA7PPS0>
extern volatile __bit                   RA7PPS0             __at(0x1D038);	// @ (0x3A07 * 8 + 0)
#define                                 RA7PPS0_bit         BANKMASK(RA7PPS), 0
// RA7PPS<RA7PPS1>
extern volatile __bit                   RA7PPS1             __at(0x1D039);	// @ (0x3A07 * 8 + 1)
#define                                 RA7PPS1_bit         BANKMASK(RA7PPS), 1
// RA7PPS<RA7PPS2>
extern volatile __bit                   RA7PPS2             __at(0x1D03A);	// @ (0x3A07 * 8 + 2)
#define                                 RA7PPS2_bit         BANKMASK(RA7PPS), 2
// RA7PPS<RA7PPS3>
extern volatile __bit                   RA7PPS3             __at(0x1D03B);	// @ (0x3A07 * 8 + 3)
#define                                 RA7PPS3_bit         BANKMASK(RA7PPS), 3
// RA7PPS<RA7PPS4>
extern volatile __bit                   RA7PPS4             __at(0x1D03C);	// @ (0x3A07 * 8 + 4)
#define                                 RA7PPS4_bit         BANKMASK(RA7PPS), 4
// RA7PPS<RA7PPS5>
extern volatile __bit                   RA7PPS5             __at(0x1D03D);	// @ (0x3A07 * 8 + 5)
#define                                 RA7PPS5_bit         BANKMASK(RA7PPS), 5
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x1FE58);	// @ (0x3FCB * 8 + 0)
#define                                 RB0_bit             BANKMASK(PORTB), 0
// RB0PPS<RB0PPS0>
extern volatile __bit                   RB0PPS0             __at(0x1D040);	// @ (0x3A08 * 8 + 0)
#define                                 RB0PPS0_bit         BANKMASK(RB0PPS), 0
// RB0PPS<RB0PPS1>
extern volatile __bit                   RB0PPS1             __at(0x1D041);	// @ (0x3A08 * 8 + 1)
#define                                 RB0PPS1_bit         BANKMASK(RB0PPS), 1
// RB0PPS<RB0PPS2>
extern volatile __bit                   RB0PPS2             __at(0x1D042);	// @ (0x3A08 * 8 + 2)
#define                                 RB0PPS2_bit         BANKMASK(RB0PPS), 2
// RB0PPS<RB0PPS3>
extern volatile __bit                   RB0PPS3             __at(0x1D043);	// @ (0x3A08 * 8 + 3)
#define                                 RB0PPS3_bit         BANKMASK(RB0PPS), 3
// RB0PPS<RB0PPS4>
extern volatile __bit                   RB0PPS4             __at(0x1D044);	// @ (0x3A08 * 8 + 4)
#define                                 RB0PPS4_bit         BANKMASK(RB0PPS), 4
// RB0PPS<RB0PPS5>
extern volatile __bit                   RB0PPS5             __at(0x1D045);	// @ (0x3A08 * 8 + 5)
#define                                 RB0PPS5_bit         BANKMASK(RB0PPS), 5
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x1FE59);	// @ (0x3FCB * 8 + 1)
#define                                 RB1_bit             BANKMASK(PORTB), 1
// RB1PPS<RB1PPS0>
extern volatile __bit                   RB1PPS0             __at(0x1D048);	// @ (0x3A09 * 8 + 0)
#define                                 RB1PPS0_bit         BANKMASK(RB1PPS), 0
// RB1PPS<RB1PPS1>
extern volatile __bit                   RB1PPS1             __at(0x1D049);	// @ (0x3A09 * 8 + 1)
#define                                 RB1PPS1_bit         BANKMASK(RB1PPS), 1
// RB1PPS<RB1PPS2>
extern volatile __bit                   RB1PPS2             __at(0x1D04A);	// @ (0x3A09 * 8 + 2)
#define                                 RB1PPS2_bit         BANKMASK(RB1PPS), 2
// RB1PPS<RB1PPS3>
extern volatile __bit                   RB1PPS3             __at(0x1D04B);	// @ (0x3A09 * 8 + 3)
#define                                 RB1PPS3_bit         BANKMASK(RB1PPS), 3
// RB1PPS<RB1PPS4>
extern volatile __bit                   RB1PPS4             __at(0x1D04C);	// @ (0x3A09 * 8 + 4)
#define                                 RB1PPS4_bit         BANKMASK(RB1PPS), 4
// RB1PPS<RB1PPS5>
extern volatile __bit                   RB1PPS5             __at(0x1D04D);	// @ (0x3A09 * 8 + 5)
#define                                 RB1PPS5_bit         BANKMASK(RB1PPS), 5
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x1FE5A);	// @ (0x3FCB * 8 + 2)
#define                                 RB2_bit             BANKMASK(PORTB), 2
// RB2PPS<RB2PPS0>
extern volatile __bit                   RB2PPS0             __at(0x1D050);	// @ (0x3A0A * 8 + 0)
#define                                 RB2PPS0_bit         BANKMASK(RB2PPS), 0
// RB2PPS<RB2PPS1>
extern volatile __bit                   RB2PPS1             __at(0x1D051);	// @ (0x3A0A * 8 + 1)
#define                                 RB2PPS1_bit         BANKMASK(RB2PPS), 1
// RB2PPS<RB2PPS2>
extern volatile __bit                   RB2PPS2             __at(0x1D052);	// @ (0x3A0A * 8 + 2)
#define                                 RB2PPS2_bit         BANKMASK(RB2PPS), 2
// RB2PPS<RB2PPS3>
extern volatile __bit                   RB2PPS3             __at(0x1D053);	// @ (0x3A0A * 8 + 3)
#define                                 RB2PPS3_bit         BANKMASK(RB2PPS), 3
// RB2PPS<RB2PPS4>
extern volatile __bit                   RB2PPS4             __at(0x1D054);	// @ (0x3A0A * 8 + 4)
#define                                 RB2PPS4_bit         BANKMASK(RB2PPS), 4
// RB2PPS<RB2PPS5>
extern volatile __bit                   RB2PPS5             __at(0x1D055);	// @ (0x3A0A * 8 + 5)
#define                                 RB2PPS5_bit         BANKMASK(RB2PPS), 5
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x1FE5B);	// @ (0x3FCB * 8 + 3)
#define                                 RB3_bit             BANKMASK(PORTB), 3
// RB3PPS<RB3PPS0>
extern volatile __bit                   RB3PPS0             __at(0x1D058);	// @ (0x3A0B * 8 + 0)
#define                                 RB3PPS0_bit         BANKMASK(RB3PPS), 0
// RB3PPS<RB3PPS1>
extern volatile __bit                   RB3PPS1             __at(0x1D059);	// @ (0x3A0B * 8 + 1)
#define                                 RB3PPS1_bit         BANKMASK(RB3PPS), 1
// RB3PPS<RB3PPS2>
extern volatile __bit                   RB3PPS2             __at(0x1D05A);	// @ (0x3A0B * 8 + 2)
#define                                 RB3PPS2_bit         BANKMASK(RB3PPS), 2
// RB3PPS<RB3PPS3>
extern volatile __bit                   RB3PPS3             __at(0x1D05B);	// @ (0x3A0B * 8 + 3)
#define                                 RB3PPS3_bit         BANKMASK(RB3PPS), 3
// RB3PPS<RB3PPS4>
extern volatile __bit                   RB3PPS4             __at(0x1D05C);	// @ (0x3A0B * 8 + 4)
#define                                 RB3PPS4_bit         BANKMASK(RB3PPS), 4
// RB3PPS<RB3PPS5>
extern volatile __bit                   RB3PPS5             __at(0x1D05D);	// @ (0x3A0B * 8 + 5)
#define                                 RB3PPS5_bit         BANKMASK(RB3PPS), 5
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x1FE5C);	// @ (0x3FCB * 8 + 4)
#define                                 RB4_bit             BANKMASK(PORTB), 4
// RB4PPS<RB4PPS0>
extern volatile __bit                   RB4PPS0             __at(0x1D060);	// @ (0x3A0C * 8 + 0)
#define                                 RB4PPS0_bit         BANKMASK(RB4PPS), 0
// RB4PPS<RB4PPS1>
extern volatile __bit                   RB4PPS1             __at(0x1D061);	// @ (0x3A0C * 8 + 1)
#define                                 RB4PPS1_bit         BANKMASK(RB4PPS), 1
// RB4PPS<RB4PPS2>
extern volatile __bit                   RB4PPS2             __at(0x1D062);	// @ (0x3A0C * 8 + 2)
#define                                 RB4PPS2_bit         BANKMASK(RB4PPS), 2
// RB4PPS<RB4PPS3>
extern volatile __bit                   RB4PPS3             __at(0x1D063);	// @ (0x3A0C * 8 + 3)
#define                                 RB4PPS3_bit         BANKMASK(RB4PPS), 3
// RB4PPS<RB4PPS4>
extern volatile __bit                   RB4PPS4             __at(0x1D064);	// @ (0x3A0C * 8 + 4)
#define                                 RB4PPS4_bit         BANKMASK(RB4PPS), 4
// RB4PPS<RB4PPS5>
extern volatile __bit                   RB4PPS5             __at(0x1D065);	// @ (0x3A0C * 8 + 5)
#define                                 RB4PPS5_bit         BANKMASK(RB4PPS), 5
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x1FE5D);	// @ (0x3FCB * 8 + 5)
#define                                 RB5_bit             BANKMASK(PORTB), 5
// RB5PPS<RB5PPS0>
extern volatile __bit                   RB5PPS0             __at(0x1D068);	// @ (0x3A0D * 8 + 0)
#define                                 RB5PPS0_bit         BANKMASK(RB5PPS), 0
// RB5PPS<RB5PPS1>
extern volatile __bit                   RB5PPS1             __at(0x1D069);	// @ (0x3A0D * 8 + 1)
#define                                 RB5PPS1_bit         BANKMASK(RB5PPS), 1
// RB5PPS<RB5PPS2>
extern volatile __bit                   RB5PPS2             __at(0x1D06A);	// @ (0x3A0D * 8 + 2)
#define                                 RB5PPS2_bit         BANKMASK(RB5PPS), 2
// RB5PPS<RB5PPS3>
extern volatile __bit                   RB5PPS3             __at(0x1D06B);	// @ (0x3A0D * 8 + 3)
#define                                 RB5PPS3_bit         BANKMASK(RB5PPS), 3
// RB5PPS<RB5PPS4>
extern volatile __bit                   RB5PPS4             __at(0x1D06C);	// @ (0x3A0D * 8 + 4)
#define                                 RB5PPS4_bit         BANKMASK(RB5PPS), 4
// RB5PPS<RB5PPS5>
extern volatile __bit                   RB5PPS5             __at(0x1D06D);	// @ (0x3A0D * 8 + 5)
#define                                 RB5PPS5_bit         BANKMASK(RB5PPS), 5
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x1FE5E);	// @ (0x3FCB * 8 + 6)
#define                                 RB6_bit             BANKMASK(PORTB), 6
// RB6PPS<RB6PPS0>
extern volatile __bit                   RB6PPS0             __at(0x1D070);	// @ (0x3A0E * 8 + 0)
#define                                 RB6PPS0_bit         BANKMASK(RB6PPS), 0
// RB6PPS<RB6PPS1>
extern volatile __bit                   RB6PPS1             __at(0x1D071);	// @ (0x3A0E * 8 + 1)
#define                                 RB6PPS1_bit         BANKMASK(RB6PPS), 1
// RB6PPS<RB6PPS2>
extern volatile __bit                   RB6PPS2             __at(0x1D072);	// @ (0x3A0E * 8 + 2)
#define                                 RB6PPS2_bit         BANKMASK(RB6PPS), 2
// RB6PPS<RB6PPS3>
extern volatile __bit                   RB6PPS3             __at(0x1D073);	// @ (0x3A0E * 8 + 3)
#define                                 RB6PPS3_bit         BANKMASK(RB6PPS), 3
// RB6PPS<RB6PPS4>
extern volatile __bit                   RB6PPS4             __at(0x1D074);	// @ (0x3A0E * 8 + 4)
#define                                 RB6PPS4_bit         BANKMASK(RB6PPS), 4
// RB6PPS<RB6PPS5>
extern volatile __bit                   RB6PPS5             __at(0x1D075);	// @ (0x3A0E * 8 + 5)
#define                                 RB6PPS5_bit         BANKMASK(RB6PPS), 5
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x1FE5F);	// @ (0x3FCB * 8 + 7)
#define                                 RB7_bit             BANKMASK(PORTB), 7
// RB7PPS<RB7PPS0>
extern volatile __bit                   RB7PPS0             __at(0x1D078);	// @ (0x3A0F * 8 + 0)
#define                                 RB7PPS0_bit         BANKMASK(RB7PPS), 0
// RB7PPS<RB7PPS1>
extern volatile __bit                   RB7PPS1             __at(0x1D079);	// @ (0x3A0F * 8 + 1)
#define                                 RB7PPS1_bit         BANKMASK(RB7PPS), 1
// RB7PPS<RB7PPS2>
extern volatile __bit                   RB7PPS2             __at(0x1D07A);	// @ (0x3A0F * 8 + 2)
#define                                 RB7PPS2_bit         BANKMASK(RB7PPS), 2
// RB7PPS<RB7PPS3>
extern volatile __bit                   RB7PPS3             __at(0x1D07B);	// @ (0x3A0F * 8 + 3)
#define                                 RB7PPS3_bit         BANKMASK(RB7PPS), 3
// RB7PPS<RB7PPS4>
extern volatile __bit                   RB7PPS4             __at(0x1D07C);	// @ (0x3A0F * 8 + 4)
#define                                 RB7PPS4_bit         BANKMASK(RB7PPS), 4
// RB7PPS<RB7PPS5>
extern volatile __bit                   RB7PPS5             __at(0x1D07D);	// @ (0x3A0F * 8 + 5)
#define                                 RB7PPS5_bit         BANKMASK(RB7PPS), 5
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x1FE60);	// @ (0x3FCC * 8 + 0)
#define                                 RC0_bit             BANKMASK(PORTC), 0
// RC0PPS<RC0PPS0>
extern volatile __bit                   RC0PPS0             __at(0x1D080);	// @ (0x3A10 * 8 + 0)
#define                                 RC0PPS0_bit         BANKMASK(RC0PPS), 0
// RC0PPS<RC0PPS1>
extern volatile __bit                   RC0PPS1             __at(0x1D081);	// @ (0x3A10 * 8 + 1)
#define                                 RC0PPS1_bit         BANKMASK(RC0PPS), 1
// RC0PPS<RC0PPS2>
extern volatile __bit                   RC0PPS2             __at(0x1D082);	// @ (0x3A10 * 8 + 2)
#define                                 RC0PPS2_bit         BANKMASK(RC0PPS), 2
// RC0PPS<RC0PPS3>
extern volatile __bit                   RC0PPS3             __at(0x1D083);	// @ (0x3A10 * 8 + 3)
#define                                 RC0PPS3_bit         BANKMASK(RC0PPS), 3
// RC0PPS<RC0PPS4>
extern volatile __bit                   RC0PPS4             __at(0x1D084);	// @ (0x3A10 * 8 + 4)
#define                                 RC0PPS4_bit         BANKMASK(RC0PPS), 4
// RC0PPS<RC0PPS5>
extern volatile __bit                   RC0PPS5             __at(0x1D085);	// @ (0x3A10 * 8 + 5)
#define                                 RC0PPS5_bit         BANKMASK(RC0PPS), 5
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x1FE61);	// @ (0x3FCC * 8 + 1)
#define                                 RC1_bit             BANKMASK(PORTC), 1
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x1CC8D);	// @ (0x3991 * 8 + 5)
#define                                 RC1IE_bit           BANKMASK(PIE1), 5
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x1CD0D);	// @ (0x39A1 * 8 + 5)
#define                                 RC1IF_bit           BANKMASK(PIR1), 5
// IPR1<RC1IP>
extern volatile __bit                   RC1IP               __at(0x1CC0D);	// @ (0x3981 * 8 + 5)
#define                                 RC1IP_bit           BANKMASK(IPR1), 5
// RC1PPS<RC1PPS0>
extern volatile __bit                   RC1PPS0             __at(0x1D088);	// @ (0x3A11 * 8 + 0)
#define                                 RC1PPS0_bit         BANKMASK(RC1PPS), 0
// RC1PPS<RC1PPS1>
extern volatile __bit                   RC1PPS1             __at(0x1D089);	// @ (0x3A11 * 8 + 1)
#define                                 RC1PPS1_bit         BANKMASK(RC1PPS), 1
// RC1PPS<RC1PPS2>
extern volatile __bit                   RC1PPS2             __at(0x1D08A);	// @ (0x3A11 * 8 + 2)
#define                                 RC1PPS2_bit         BANKMASK(RC1PPS), 2
// RC1PPS<RC1PPS3>
extern volatile __bit                   RC1PPS3             __at(0x1D08B);	// @ (0x3A11 * 8 + 3)
#define                                 RC1PPS3_bit         BANKMASK(RC1PPS), 3
// RC1PPS<RC1PPS4>
extern volatile __bit                   RC1PPS4             __at(0x1D08C);	// @ (0x3A11 * 8 + 4)
#define                                 RC1PPS4_bit         BANKMASK(RC1PPS), 4
// RC1PPS<RC1PPS5>
extern volatile __bit                   RC1PPS5             __at(0x1D08D);	// @ (0x3A11 * 8 + 5)
#define                                 RC1PPS5_bit         BANKMASK(RC1PPS), 5
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x1FE62);	// @ (0x3FCC * 8 + 2)
#define                                 RC2_bit             BANKMASK(PORTC), 2
// RC2PPS<RC2PPS0>
extern volatile __bit                   RC2PPS0             __at(0x1D090);	// @ (0x3A12 * 8 + 0)
#define                                 RC2PPS0_bit         BANKMASK(RC2PPS), 0
// RC2PPS<RC2PPS1>
extern volatile __bit                   RC2PPS1             __at(0x1D091);	// @ (0x3A12 * 8 + 1)
#define                                 RC2PPS1_bit         BANKMASK(RC2PPS), 1
// RC2PPS<RC2PPS2>
extern volatile __bit                   RC2PPS2             __at(0x1D092);	// @ (0x3A12 * 8 + 2)
#define                                 RC2PPS2_bit         BANKMASK(RC2PPS), 2
// RC2PPS<RC2PPS3>
extern volatile __bit                   RC2PPS3             __at(0x1D093);	// @ (0x3A12 * 8 + 3)
#define                                 RC2PPS3_bit         BANKMASK(RC2PPS), 3
// RC2PPS<RC2PPS4>
extern volatile __bit                   RC2PPS4             __at(0x1D094);	// @ (0x3A12 * 8 + 4)
#define                                 RC2PPS4_bit         BANKMASK(RC2PPS), 4
// RC2PPS<RC2PPS5>
extern volatile __bit                   RC2PPS5             __at(0x1D095);	// @ (0x3A12 * 8 + 5)
#define                                 RC2PPS5_bit         BANKMASK(RC2PPS), 5
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x1FE63);	// @ (0x3FCC * 8 + 3)
#define                                 RC3_bit             BANKMASK(PORTC), 3
// RC3PPS<RC3PPS0>
extern volatile __bit                   RC3PPS0             __at(0x1D098);	// @ (0x3A13 * 8 + 0)
#define                                 RC3PPS0_bit         BANKMASK(RC3PPS), 0
// RC3PPS<RC3PPS1>
extern volatile __bit                   RC3PPS1             __at(0x1D099);	// @ (0x3A13 * 8 + 1)
#define                                 RC3PPS1_bit         BANKMASK(RC3PPS), 1
// RC3PPS<RC3PPS2>
extern volatile __bit                   RC3PPS2             __at(0x1D09A);	// @ (0x3A13 * 8 + 2)
#define                                 RC3PPS2_bit         BANKMASK(RC3PPS), 2
// RC3PPS<RC3PPS3>
extern volatile __bit                   RC3PPS3             __at(0x1D09B);	// @ (0x3A13 * 8 + 3)
#define                                 RC3PPS3_bit         BANKMASK(RC3PPS), 3
// RC3PPS<RC3PPS4>
extern volatile __bit                   RC3PPS4             __at(0x1D09C);	// @ (0x3A13 * 8 + 4)
#define                                 RC3PPS4_bit         BANKMASK(RC3PPS), 4
// RC3PPS<RC3PPS5>
extern volatile __bit                   RC3PPS5             __at(0x1D09D);	// @ (0x3A13 * 8 + 5)
#define                                 RC3PPS5_bit         BANKMASK(RC3PPS), 5
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x1FE64);	// @ (0x3FCC * 8 + 4)
#define                                 RC4_bit             BANKMASK(PORTC), 4
// RC4PPS<RC4PPS0>
extern volatile __bit                   RC4PPS0             __at(0x1D0A0);	// @ (0x3A14 * 8 + 0)
#define                                 RC4PPS0_bit         BANKMASK(RC4PPS), 0
// RC4PPS<RC4PPS1>
extern volatile __bit                   RC4PPS1             __at(0x1D0A1);	// @ (0x3A14 * 8 + 1)
#define                                 RC4PPS1_bit         BANKMASK(RC4PPS), 1
// RC4PPS<RC4PPS2>
extern volatile __bit                   RC4PPS2             __at(0x1D0A2);	// @ (0x3A14 * 8 + 2)
#define                                 RC4PPS2_bit         BANKMASK(RC4PPS), 2
// RC4PPS<RC4PPS3>
extern volatile __bit                   RC4PPS3             __at(0x1D0A3);	// @ (0x3A14 * 8 + 3)
#define                                 RC4PPS3_bit         BANKMASK(RC4PPS), 3
// RC4PPS<RC4PPS4>
extern volatile __bit                   RC4PPS4             __at(0x1D0A4);	// @ (0x3A14 * 8 + 4)
#define                                 RC4PPS4_bit         BANKMASK(RC4PPS), 4
// RC4PPS<RC4PPS5>
extern volatile __bit                   RC4PPS5             __at(0x1D0A5);	// @ (0x3A14 * 8 + 5)
#define                                 RC4PPS5_bit         BANKMASK(RC4PPS), 5
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x1FE65);	// @ (0x3FCC * 8 + 5)
#define                                 RC5_bit             BANKMASK(PORTC), 5
// RC5PPS<RC5PPS0>
extern volatile __bit                   RC5PPS0             __at(0x1D0A8);	// @ (0x3A15 * 8 + 0)
#define                                 RC5PPS0_bit         BANKMASK(RC5PPS), 0
// RC5PPS<RC5PPS1>
extern volatile __bit                   RC5PPS1             __at(0x1D0A9);	// @ (0x3A15 * 8 + 1)
#define                                 RC5PPS1_bit         BANKMASK(RC5PPS), 1
// RC5PPS<RC5PPS2>
extern volatile __bit                   RC5PPS2             __at(0x1D0AA);	// @ (0x3A15 * 8 + 2)
#define                                 RC5PPS2_bit         BANKMASK(RC5PPS), 2
// RC5PPS<RC5PPS3>
extern volatile __bit                   RC5PPS3             __at(0x1D0AB);	// @ (0x3A15 * 8 + 3)
#define                                 RC5PPS3_bit         BANKMASK(RC5PPS), 3
// RC5PPS<RC5PPS4>
extern volatile __bit                   RC5PPS4             __at(0x1D0AC);	// @ (0x3A15 * 8 + 4)
#define                                 RC5PPS4_bit         BANKMASK(RC5PPS), 4
// RC5PPS<RC5PPS5>
extern volatile __bit                   RC5PPS5             __at(0x1D0AD);	// @ (0x3A15 * 8 + 5)
#define                                 RC5PPS5_bit         BANKMASK(RC5PPS), 5
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x1FE66);	// @ (0x3FCC * 8 + 6)
#define                                 RC6_bit             BANKMASK(PORTC), 6
// RC6PPS<RC6PPS0>
