LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   RC6PPS0             __at(0x1D0B0);	// @ (0x3A16 * 8 + 0)
#define                                 RC6PPS0_bit         BANKMASK(RC6PPS), 0
// RC6PPS<RC6PPS1>
extern volatile __bit                   RC6PPS1             __at(0x1D0B1);	// @ (0x3A16 * 8 + 1)
#define                                 RC6PPS1_bit         BANKMASK(RC6PPS), 1
// RC6PPS<RC6PPS2>
extern volatile __bit                   RC6PPS2             __at(0x1D0B2);	// @ (0x3A16 * 8 + 2)
#define                                 RC6PPS2_bit         BANKMASK(RC6PPS), 2
// RC6PPS<RC6PPS3>
extern volatile __bit                   RC6PPS3             __at(0x1D0B3);	// @ (0x3A16 * 8 + 3)
#define                                 RC6PPS3_bit         BANKMASK(RC6PPS), 3
// RC6PPS<RC6PPS4>
extern volatile __bit                   RC6PPS4             __at(0x1D0B4);	// @ (0x3A16 * 8 + 4)
#define                                 RC6PPS4_bit         BANKMASK(RC6PPS), 4
// RC6PPS<RC6PPS5>
extern volatile __bit                   RC6PPS5             __at(0x1D0B5);	// @ (0x3A16 * 8 + 5)
#define                                 RC6PPS5_bit         BANKMASK(RC6PPS), 5
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x1FE67);	// @ (0x3FCC * 8 + 7)
#define                                 RC7_bit             BANKMASK(PORTC), 7
// RC7PPS<RC7PPS0>
extern volatile __bit                   RC7PPS0             __at(0x1D0B8);	// @ (0x3A17 * 8 + 0)
#define                                 RC7PPS0_bit         BANKMASK(RC7PPS), 0
// RC7PPS<RC7PPS1>
extern volatile __bit                   RC7PPS1             __at(0x1D0B9);	// @ (0x3A17 * 8 + 1)
#define                                 RC7PPS1_bit         BANKMASK(RC7PPS), 1
// RC7PPS<RC7PPS2>
extern volatile __bit                   RC7PPS2             __at(0x1D0BA);	// @ (0x3A17 * 8 + 2)
#define                                 RC7PPS2_bit         BANKMASK(RC7PPS), 2
// RC7PPS<RC7PPS3>
extern volatile __bit                   RC7PPS3             __at(0x1D0BB);	// @ (0x3A17 * 8 + 3)
#define                                 RC7PPS3_bit         BANKMASK(RC7PPS), 3
// RC7PPS<RC7PPS4>
extern volatile __bit                   RC7PPS4             __at(0x1D0BC);	// @ (0x3A17 * 8 + 4)
#define                                 RC7PPS4_bit         BANKMASK(RC7PPS), 4
// RC7PPS<RC7PPS5>
extern volatile __bit                   RC7PPS5             __at(0x1D0BD);	// @ (0x3A17 * 8 + 5)
#define                                 RC7PPS5_bit         BANKMASK(RC7PPS), 5
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0x1CF28);	// @ (0x39E5 * 8 + 0)
#define                                 RD_bit              BANKMASK(NVMCON1), 0
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x1FE68);	// @ (0x3FCD * 8 + 0)
#define                                 RD0_bit             BANKMASK(PORTD), 0
// RD0PPS<RD0PPS0>
extern volatile __bit                   RD0PPS0             __at(0x1D0C0);	// @ (0x3A18 * 8 + 0)
#define                                 RD0PPS0_bit         BANKMASK(RD0PPS), 0
// RD0PPS<RD0PPS1>
extern volatile __bit                   RD0PPS1             __at(0x1D0C1);	// @ (0x3A18 * 8 + 1)
#define                                 RD0PPS1_bit         BANKMASK(RD0PPS), 1
// RD0PPS<RD0PPS2>
extern volatile __bit                   RD0PPS2             __at(0x1D0C2);	// @ (0x3A18 * 8 + 2)
#define                                 RD0PPS2_bit         BANKMASK(RD0PPS), 2
// RD0PPS<RD0PPS3>
extern volatile __bit                   RD0PPS3             __at(0x1D0C3);	// @ (0x3A18 * 8 + 3)
#define                                 RD0PPS3_bit         BANKMASK(RD0PPS), 3
// RD0PPS<RD0PPS4>
extern volatile __bit                   RD0PPS4             __at(0x1D0C4);	// @ (0x3A18 * 8 + 4)
#define                                 RD0PPS4_bit         BANKMASK(RD0PPS), 4
// RD0PPS<RD0PPS5>
extern volatile __bit                   RD0PPS5             __at(0x1D0C5);	// @ (0x3A18 * 8 + 5)
#define                                 RD0PPS5_bit         BANKMASK(RD0PPS), 5
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x1FE69);	// @ (0x3FCD * 8 + 1)
#define                                 RD1_bit             BANKMASK(PORTD), 1
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x1FD91);	// @ (0x3FB2 * 8 + 1)
#define                                 RD161_bit           BANKMASK(T1CON), 1
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x1FD31);	// @ (0x3FA6 * 8 + 1)
#define                                 RD163_bit           BANKMASK(T3CON), 1
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x1FCD1);	// @ (0x3F9A * 8 + 1)
#define                                 RD165_bit           BANKMASK(T5CON), 1
// RD1PPS<RD1PPS0>
extern volatile __bit                   RD1PPS0             __at(0x1D0C8);	// @ (0x3A19 * 8 + 0)
#define                                 RD1PPS0_bit         BANKMASK(RD1PPS), 0
// RD1PPS<RD1PPS1>
extern volatile __bit                   RD1PPS1             __at(0x1D0C9);	// @ (0x3A19 * 8 + 1)
#define                                 RD1PPS1_bit         BANKMASK(RD1PPS), 1
// RD1PPS<RD1PPS2>
extern volatile __bit                   RD1PPS2             __at(0x1D0CA);	// @ (0x3A19 * 8 + 2)
#define                                 RD1PPS2_bit         BANKMASK(RD1PPS), 2
// RD1PPS<RD1PPS3>
extern volatile __bit                   RD1PPS3             __at(0x1D0CB);	// @ (0x3A19 * 8 + 3)
#define                                 RD1PPS3_bit         BANKMASK(RD1PPS), 3
// RD1PPS<RD1PPS4>
extern volatile __bit                   RD1PPS4             __at(0x1D0CC);	// @ (0x3A19 * 8 + 4)
#define                                 RD1PPS4_bit         BANKMASK(RD1PPS), 4
// RD1PPS<RD1PPS5>
extern volatile __bit                   RD1PPS5             __at(0x1D0CD);	// @ (0x3A19 * 8 + 5)
#define                                 RD1PPS5_bit         BANKMASK(RD1PPS), 5
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x1FE6A);	// @ (0x3FCD * 8 + 2)
#define                                 RD2_bit             BANKMASK(PORTD), 2
// RD2PPS<RD2PPS0>
extern volatile __bit                   RD2PPS0             __at(0x1D0D0);	// @ (0x3A1A * 8 + 0)
#define                                 RD2PPS0_bit         BANKMASK(RD2PPS), 0
// RD2PPS<RD2PPS1>
extern volatile __bit                   RD2PPS1             __at(0x1D0D1);	// @ (0x3A1A * 8 + 1)
#define                                 RD2PPS1_bit         BANKMASK(RD2PPS), 1
// RD2PPS<RD2PPS2>
extern volatile __bit                   RD2PPS2             __at(0x1D0D2);	// @ (0x3A1A * 8 + 2)
#define                                 RD2PPS2_bit         BANKMASK(RD2PPS), 2
// RD2PPS<RD2PPS3>
extern volatile __bit                   RD2PPS3             __at(0x1D0D3);	// @ (0x3A1A * 8 + 3)
#define                                 RD2PPS3_bit         BANKMASK(RD2PPS), 3
// RD2PPS<RD2PPS4>
extern volatile __bit                   RD2PPS4             __at(0x1D0D4);	// @ (0x3A1A * 8 + 4)
#define                                 RD2PPS4_bit         BANKMASK(RD2PPS), 4
// RD2PPS<RD2PPS5>
extern volatile __bit                   RD2PPS5             __at(0x1D0D5);	// @ (0x3A1A * 8 + 5)
#define                                 RD2PPS5_bit         BANKMASK(RD2PPS), 5
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x1FE6B);	// @ (0x3FCD * 8 + 3)
#define                                 RD3_bit             BANKMASK(PORTD), 3
// RD3PPS<RD3PPS0>
extern volatile __bit                   RD3PPS0             __at(0x1D0D8);	// @ (0x3A1B * 8 + 0)
#define                                 RD3PPS0_bit         BANKMASK(RD3PPS), 0
// RD3PPS<RD3PPS1>
extern volatile __bit                   RD3PPS1             __at(0x1D0D9);	// @ (0x3A1B * 8 + 1)
#define                                 RD3PPS1_bit         BANKMASK(RD3PPS), 1
// RD3PPS<RD3PPS2>
extern volatile __bit                   RD3PPS2             __at(0x1D0DA);	// @ (0x3A1B * 8 + 2)
#define                                 RD3PPS2_bit         BANKMASK(RD3PPS), 2
// RD3PPS<RD3PPS3>
extern volatile __bit                   RD3PPS3             __at(0x1D0DB);	// @ (0x3A1B * 8 + 3)
#define                                 RD3PPS3_bit         BANKMASK(RD3PPS), 3
// RD3PPS<RD3PPS4>
extern volatile __bit                   RD3PPS4             __at(0x1D0DC);	// @ (0x3A1B * 8 + 4)
#define                                 RD3PPS4_bit         BANKMASK(RD3PPS), 4
// RD3PPS<RD3PPS5>
extern volatile __bit                   RD3PPS5             __at(0x1D0DD);	// @ (0x3A1B * 8 + 5)
#define                                 RD3PPS5_bit         BANKMASK(RD3PPS), 5
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x1FE6C);	// @ (0x3FCD * 8 + 4)
#define                                 RD4_bit             BANKMASK(PORTD), 4
// RD4PPS<RD4PPS0>
extern volatile __bit                   RD4PPS0             __at(0x1D0E0);	// @ (0x3A1C * 8 + 0)
#define                                 RD4PPS0_bit         BANKMASK(RD4PPS), 0
// RD4PPS<RD4PPS1>
extern volatile __bit                   RD4PPS1             __at(0x1D0E1);	// @ (0x3A1C * 8 + 1)
#define                                 RD4PPS1_bit         BANKMASK(RD4PPS), 1
// RD4PPS<RD4PPS2>
extern volatile __bit                   RD4PPS2             __at(0x1D0E2);	// @ (0x3A1C * 8 + 2)
#define                                 RD4PPS2_bit         BANKMASK(RD4PPS), 2
// RD4PPS<RD4PPS3>
extern volatile __bit                   RD4PPS3             __at(0x1D0E3);	// @ (0x3A1C * 8 + 3)
#define                                 RD4PPS3_bit         BANKMASK(RD4PPS), 3
// RD4PPS<RD4PPS4>
extern volatile __bit                   RD4PPS4             __at(0x1D0E4);	// @ (0x3A1C * 8 + 4)
#define                                 RD4PPS4_bit         BANKMASK(RD4PPS), 4
// RD4PPS<RD4PPS5>
extern volatile __bit                   RD4PPS5             __at(0x1D0E5);	// @ (0x3A1C * 8 + 5)
#define                                 RD4PPS5_bit         BANKMASK(RD4PPS), 5
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x1FE6D);	// @ (0x3FCD * 8 + 5)
#define                                 RD5_bit             BANKMASK(PORTD), 5
// RD5PPS<RD5PPS0>
extern volatile __bit                   RD5PPS0             __at(0x1D0E8);	// @ (0x3A1D * 8 + 0)
#define                                 RD5PPS0_bit         BANKMASK(RD5PPS), 0
// RD5PPS<RD5PPS1>
extern volatile __bit                   RD5PPS1             __at(0x1D0E9);	// @ (0x3A1D * 8 + 1)
#define                                 RD5PPS1_bit         BANKMASK(RD5PPS), 1
// RD5PPS<RD5PPS2>
extern volatile __bit                   RD5PPS2             __at(0x1D0EA);	// @ (0x3A1D * 8 + 2)
#define                                 RD5PPS2_bit         BANKMASK(RD5PPS), 2
// RD5PPS<RD5PPS3>
extern volatile __bit                   RD5PPS3             __at(0x1D0EB);	// @ (0x3A1D * 8 + 3)
#define                                 RD5PPS3_bit         BANKMASK(RD5PPS), 3
// RD5PPS<RD5PPS4>
extern volatile __bit                   RD5PPS4             __at(0x1D0EC);	// @ (0x3A1D * 8 + 4)
#define                                 RD5PPS4_bit         BANKMASK(RD5PPS), 4
// RD5PPS<RD5PPS5>
extern volatile __bit                   RD5PPS5             __at(0x1D0ED);	// @ (0x3A1D * 8 + 5)
#define                                 RD5PPS5_bit         BANKMASK(RD5PPS), 5
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x1FE6E);	// @ (0x3FCD * 8 + 6)
#define                                 RD6_bit             BANKMASK(PORTD), 6
// RD6PPS<RD6PPS0>
extern volatile __bit                   RD6PPS0             __at(0x1D0F0);	// @ (0x3A1E * 8 + 0)
#define                                 RD6PPS0_bit         BANKMASK(RD6PPS), 0
// RD6PPS<RD6PPS1>
extern volatile __bit                   RD6PPS1             __at(0x1D0F1);	// @ (0x3A1E * 8 + 1)
#define                                 RD6PPS1_bit         BANKMASK(RD6PPS), 1
// RD6PPS<RD6PPS2>
extern volatile __bit                   RD6PPS2             __at(0x1D0F2);	// @ (0x3A1E * 8 + 2)
#define                                 RD6PPS2_bit         BANKMASK(RD6PPS), 2
// RD6PPS<RD6PPS3>
extern volatile __bit                   RD6PPS3             __at(0x1D0F3);	// @ (0x3A1E * 8 + 3)
#define                                 RD6PPS3_bit         BANKMASK(RD6PPS), 3
// RD6PPS<RD6PPS4>
extern volatile __bit                   RD6PPS4             __at(0x1D0F4);	// @ (0x3A1E * 8 + 4)
#define                                 RD6PPS4_bit         BANKMASK(RD6PPS), 4
// RD6PPS<RD6PPS5>
extern volatile __bit                   RD6PPS5             __at(0x1D0F5);	// @ (0x3A1E * 8 + 5)
#define                                 RD6PPS5_bit         BANKMASK(RD6PPS), 5
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x1FE6F);	// @ (0x3FCD * 8 + 7)
#define                                 RD7_bit             BANKMASK(PORTD), 7
// RD7PPS<RD7PPS0>
extern volatile __bit                   RD7PPS0             __at(0x1D0F8);	// @ (0x3A1F * 8 + 0)
#define                                 RD7PPS0_bit         BANKMASK(RD7PPS), 0
// RD7PPS<RD7PPS1>
extern volatile __bit                   RD7PPS1             __at(0x1D0F9);	// @ (0x3A1F * 8 + 1)
#define                                 RD7PPS1_bit         BANKMASK(RD7PPS), 1
// RD7PPS<RD7PPS2>
extern volatile __bit                   RD7PPS2             __at(0x1D0FA);	// @ (0x3A1F * 8 + 2)
#define                                 RD7PPS2_bit         BANKMASK(RD7PPS), 2
// RD7PPS<RD7PPS3>
extern volatile __bit                   RD7PPS3             __at(0x1D0FB);	// @ (0x3A1F * 8 + 3)
#define                                 RD7PPS3_bit         BANKMASK(RD7PPS), 3
// RD7PPS<RD7PPS4>
extern volatile __bit                   RD7PPS4             __at(0x1D0FC);	// @ (0x3A1F * 8 + 4)
#define                                 RD7PPS4_bit         BANKMASK(RD7PPS), 4
// RD7PPS<RD7PPS5>
extern volatile __bit                   RD7PPS5             __at(0x1D0FD);	// @ (0x3A1F * 8 + 5)
#define                                 RD7PPS5_bit         BANKMASK(RD7PPS), 5
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x1FE70);	// @ (0x3FCE * 8 + 0)
#define                                 RE0_bit             BANKMASK(PORTE), 0
// RE0PPS<RE0PPS0>
extern volatile __bit                   RE0PPS0             __at(0x1D100);	// @ (0x3A20 * 8 + 0)
#define                                 RE0PPS0_bit         BANKMASK(RE0PPS), 0
// RE0PPS<RE0PPS1>
extern volatile __bit                   RE0PPS1             __at(0x1D101);	// @ (0x3A20 * 8 + 1)
#define                                 RE0PPS1_bit         BANKMASK(RE0PPS), 1
// RE0PPS<RE0PPS2>
extern volatile __bit                   RE0PPS2             __at(0x1D102);	// @ (0x3A20 * 8 + 2)
#define                                 RE0PPS2_bit         BANKMASK(RE0PPS), 2
// RE0PPS<RE0PPS3>
extern volatile __bit                   RE0PPS3             __at(0x1D103);	// @ (0x3A20 * 8 + 3)
#define                                 RE0PPS3_bit         BANKMASK(RE0PPS), 3
// RE0PPS<RE0PPS4>
extern volatile __bit                   RE0PPS4             __at(0x1D104);	// @ (0x3A20 * 8 + 4)
#define                                 RE0PPS4_bit         BANKMASK(RE0PPS), 4
// RE0PPS<RE0PPS5>
extern volatile __bit                   RE0PPS5             __at(0x1D105);	// @ (0x3A20 * 8 + 5)
#define                                 RE0PPS5_bit         BANKMASK(RE0PPS), 5
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x1FE71);	// @ (0x3FCE * 8 + 1)
#define                                 RE1_bit             BANKMASK(PORTE), 1
// RE1PPS<RE1PPS0>
extern volatile __bit                   RE1PPS0             __at(0x1D108);	// @ (0x3A21 * 8 + 0)
#define                                 RE1PPS0_bit         BANKMASK(RE1PPS), 0
// RE1PPS<RE1PPS1>
extern volatile __bit                   RE1PPS1             __at(0x1D109);	// @ (0x3A21 * 8 + 1)
#define                                 RE1PPS1_bit         BANKMASK(RE1PPS), 1
// RE1PPS<RE1PPS2>
extern volatile __bit                   RE1PPS2             __at(0x1D10A);	// @ (0x3A21 * 8 + 2)
#define                                 RE1PPS2_bit         BANKMASK(RE1PPS), 2
// RE1PPS<RE1PPS3>
extern volatile __bit                   RE1PPS3             __at(0x1D10B);	// @ (0x3A21 * 8 + 3)
#define                                 RE1PPS3_bit         BANKMASK(RE1PPS), 3
// RE1PPS<RE1PPS4>
extern volatile __bit                   RE1PPS4             __at(0x1D10C);	// @ (0x3A21 * 8 + 4)
#define                                 RE1PPS4_bit         BANKMASK(RE1PPS), 4
// RE1PPS<RE1PPS5>
extern volatile __bit                   RE1PPS5             __at(0x1D10D);	// @ (0x3A21 * 8 + 5)
#define                                 RE1PPS5_bit         BANKMASK(RE1PPS), 5
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x1FE72);	// @ (0x3FCE * 8 + 2)
#define                                 RE2_bit             BANKMASK(PORTE), 2
// RE2PPS<RE2PPS0>
extern volatile __bit                   RE2PPS0             __at(0x1D110);	// @ (0x3A22 * 8 + 0)
#define                                 RE2PPS0_bit         BANKMASK(RE2PPS), 0
// RE2PPS<RE2PPS1>
extern volatile __bit                   RE2PPS1             __at(0x1D111);	// @ (0x3A22 * 8 + 1)
#define                                 RE2PPS1_bit         BANKMASK(RE2PPS), 1
// RE2PPS<RE2PPS2>
extern volatile __bit                   RE2PPS2             __at(0x1D112);	// @ (0x3A22 * 8 + 2)
#define                                 RE2PPS2_bit         BANKMASK(RE2PPS), 2
// RE2PPS<RE2PPS3>
extern volatile __bit                   RE2PPS3             __at(0x1D113);	// @ (0x3A22 * 8 + 3)
#define                                 RE2PPS3_bit         BANKMASK(RE2PPS), 3
// RE2PPS<RE2PPS4>
extern volatile __bit                   RE2PPS4             __at(0x1D114);	// @ (0x3A22 * 8 + 4)
#define                                 RE2PPS4_bit         BANKMASK(RE2PPS), 4
// RE2PPS<RE2PPS5>
extern volatile __bit                   RE2PPS5             __at(0x1D115);	// @ (0x3A22 * 8 + 5)
#define                                 RE2PPS5_bit         BANKMASK(RE2PPS), 5
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x1FE73);	// @ (0x3FCE * 8 + 3)
#define                                 RE3_bit             BANKMASK(PORTE), 3
// NVMCON1<REG0>
extern volatile __bit                   REG0                __at(0x1CF2E);	// @ (0x39E5 * 8 + 6)
#define                                 REG0_bit            BANKMASK(NVMCON1), 6
// NVMCON1<REG1>
extern volatile __bit                   REG1                __at(0x1CF2F);	// @ (0x39E5 * 8 + 7)
#define                                 REG1_bit            BANKMASK(NVMCON1), 7
// SMT1CON1<REPEAT>
extern volatile __bit                   REPEAT              __at(0x1F8FE);	// @ (0x3F1F * 8 + 6)
#define                                 REPEAT_bit          BANKMASK(SMT1CON1), 6
// ADRESL<RES0>
extern volatile __bit                   RES0                __at(0x1F778);	// @ (0x3EEF * 8 + 0)
#define                                 RES0_bit            BANKMASK(ADRESL), 0
// ADRESL<RES1>
extern volatile __bit                   RES1                __at(0x1F779);	// @ (0x3EEF * 8 + 1)
#define                                 RES1_bit            BANKMASK(ADRESL), 1
// ADRESH<RES10>
extern volatile __bit                   RES10               __at(0x1F782);	// @ (0x3EF0 * 8 + 2)
#define                                 RES10_bit           BANKMASK(ADRESH), 2
// ADRESH<RES11>
extern volatile __bit                   RES11               __at(0x1F783);	// @ (0x3EF0 * 8 + 3)
#define                                 RES11_bit           BANKMASK(ADRESH), 3
// ADRESH<RES12>
extern volatile __bit                   RES12               __at(0x1F784);	// @ (0x3EF0 * 8 + 4)
#define                                 RES12_bit           BANKMASK(ADRESH), 4
// ADRESH<RES13>
extern volatile __bit                   RES13               __at(0x1F785);	// @ (0x3EF0 * 8 + 5)
#define                                 RES13_bit           BANKMASK(ADRESH), 5
// ADRESH<RES14>
extern volatile __bit                   RES14               __at(0x1F786);	// @ (0x3EF0 * 8 + 6)
#define                                 RES14_bit           BANKMASK(ADRESH), 6
// ADRESH<RES15>
extern volatile __bit                   RES15               __at(0x1F787);	// @ (0x3EF0 * 8 + 7)
#define                                 RES15_bit           BANKMASK(ADRESH), 7
// ADRESL<RES2>
extern volatile __bit                   RES2                __at(0x1F77A);	// @ (0x3EEF * 8 + 2)
#define                                 RES2_bit            BANKMASK(ADRESL), 2
// ADRESL<RES3>
extern volatile __bit                   RES3                __at(0x1F77B);	// @ (0x3EEF * 8 + 3)
#define                                 RES3_bit            BANKMASK(ADRESL), 3
// ADRESL<RES4>
extern volatile __bit                   RES4                __at(0x1F77C);	// @ (0x3EEF * 8 + 4)
#define                                 RES4_bit            BANKMASK(ADRESL), 4
// ADRESL<RES5>
extern volatile __bit                   RES5                __at(0x1F77D);	// @ (0x3EEF * 8 + 5)
#define                                 RES5_bit            BANKMASK(ADRESL), 5
// ADRESL<RES6>
extern volatile __bit                   RES6                __at(0x1F77E);	// @ (0x3EEF * 8 + 6)
#define                                 RES6_bit            BANKMASK(ADRESL), 6
// ADRESL<RES7>
extern volatile __bit                   RES7                __at(0x1F77F);	// @ (0x3EEF * 8 + 7)
#define                                 RES7_bit            BANKMASK(ADRESL), 7
// ADRESH<RES8>
extern volatile __bit                   RES8                __at(0x1F780);	// @ (0x3EF0 * 8 + 0)
#define                                 RES8_bit            BANKMASK(ADRESH), 0
// ADRESH<RES9>
extern volatile __bit                   RES9                __at(0x1F781);	// @ (0x3EF0 * 8 + 1)
#define                                 RES9_bit            BANKMASK(ADRESH), 1
// PCON0<RI>
extern volatile __bit                   RI                  __at(0x1FF82);	// @ (0x3FF0 * 8 + 2)
#define                                 RI_bit              BANKMASK(PCON0), 2
// PORTA<RJPU>
extern volatile __bit                   RJPU                __at(0x1FE57);	// @ (0x3FCA * 8 + 7)
#define                                 RJPU_bit            BANKMASK(PORTA), 7
// PCON0<RMCLR>
extern volatile __bit                   RMCLR               __at(0x1FF83);	// @ (0x3FF0 * 8 + 3)
#define                                 RMCLR_bit           BANKMASK(PCON0), 3
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x1CEC5);	// @ (0x39D8 * 8 + 5)
#define                                 ROI_bit             BANKMASK(CPUDOZE), 5
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0x1F760);	// @ (0x3EEC * 8 + 0)
#define                                 RPT0_bit            BANKMASK(ADRPT), 0
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0x1F761);	// @ (0x3EEC * 8 + 1)
#define                                 RPT1_bit            BANKMASK(ADRPT), 1
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0x1F762);	// @ (0x3EEC * 8 + 2)
#define                                 RPT2_bit            BANKMASK(ADRPT), 2
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0x1F763);	// @ (0x3EEC * 8 + 3)
#define                                 RPT3_bit            BANKMASK(ADRPT), 3
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0x1F764);	// @ (0x3EEC * 8 + 4)
#define                                 RPT4_bit            BANKMASK(ADRPT), 4
// ADRPT<RPT5>
