LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   RPT5                __at(0x1F765);	// @ (0x3EEC * 8 + 5)
#define                                 RPT5_bit            BANKMASK(ADRPT), 5
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0x1F766);	// @ (0x3EEC * 8 + 6)
#define                                 RPT6_bit            BANKMASK(ADRPT), 6
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0x1F767);	// @ (0x3EEC * 8 + 7)
#define                                 RPT7_bit            BANKMASK(ADRPT), 7
// I2C1PIE<RSC1IE>
extern volatile __bit                   RSC1IE              __at(0x1EBD1);	// @ (0x3D7A * 8 + 1)
#define                                 RSC1IE_bit          BANKMASK(I2C1PIE), 1
// I2C1PIR<RSC1IF>
extern volatile __bit                   RSC1IF              __at(0x1EBC9);	// @ (0x3D79 * 8 + 1)
#define                                 RSC1IF_bit          BANKMASK(I2C1PIR), 1
// I2C2PIE<RSC2IE>
extern volatile __bit                   RSC2IE              __at(0x1EB21);	// @ (0x3D64 * 8 + 1)
#define                                 RSC2IE_bit          BANKMASK(I2C2PIE), 1
// I2C2PIR<RSC2IF>
extern volatile __bit                   RSC2IF              __at(0x1EB19);	// @ (0x3D63 * 8 + 1)
#define                                 RSC2IF_bit          BANKMASK(I2C2PIR), 1
// SMT1STAT<RST>
extern volatile __bit                   RST                 __at(0x1F905);	// @ (0x3F20 * 8 + 5)
#define                                 RST_bit             BANKMASK(SMT1STAT), 5
// PCON0<RWDT>
extern volatile __bit                   RWDT                __at(0x1FF84);	// @ (0x3FF0 * 8 + 4)
#define                                 RWDT_bit            BANKMASK(PCON0), 4
// SPI1RXB<RXB0>
extern volatile __bit                   RXB0                __at(0x1E880);	// @ (0x3D10 * 8 + 0)
#define                                 RXB0_bit            BANKMASK(SPI1RXB), 0
// PIE3<RXB0IE>
extern volatile __bit                   RXB0IE              __at(0x1CC98);	// @ (0x3993 * 8 + 0)
#define                                 RXB0IE_bit          BANKMASK(PIE3), 0
// SPI1RXB<RXB1>
extern volatile __bit                   RXB1                __at(0x1E881);	// @ (0x3D10 * 8 + 1)
#define                                 RXB1_bit            BANKMASK(SPI1RXB), 1
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x1CC99);	// @ (0x3993 * 8 + 1)
#define                                 RXB1IE_bit          BANKMASK(PIE3), 1
// SPI1RXB<RXB2>
extern volatile __bit                   RXB2                __at(0x1E882);	// @ (0x3D10 * 8 + 2)
#define                                 RXB2_bit            BANKMASK(SPI1RXB), 2
// SPI1RXB<RXB3>
extern volatile __bit                   RXB3                __at(0x1E883);	// @ (0x3D10 * 8 + 3)
#define                                 RXB3_bit            BANKMASK(SPI1RXB), 3
// SPI1RXB<RXB4>
extern volatile __bit                   RXB4                __at(0x1E884);	// @ (0x3D10 * 8 + 4)
#define                                 RXB4_bit            BANKMASK(SPI1RXB), 4
// SPI1RXB<RXB5>
extern volatile __bit                   RXB5                __at(0x1E885);	// @ (0x3D10 * 8 + 5)
#define                                 RXB5_bit            BANKMASK(SPI1RXB), 5
// SPI1RXB<RXB6>
extern volatile __bit                   RXB6                __at(0x1E886);	// @ (0x3D10 * 8 + 6)
#define                                 RXB6_bit            BANKMASK(SPI1RXB), 6
// SPI1RXB<RXB7>
extern volatile __bit                   RXB7                __at(0x1E887);	// @ (0x3D10 * 8 + 7)
#define                                 RXB7_bit            BANKMASK(SPI1RXB), 7
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x1CC99);	// @ (0x3993 * 8 + 1)
#define                                 RXBNIE_bit          BANKMASK(PIE3), 1
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x1CD19);	// @ (0x39A3 * 8 + 1)
#define                                 RXBNIF_bit          BANKMASK(PIR3), 1
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x1CC19);	// @ (0x3983 * 8 + 1)
#define                                 RXBNIP_bit          BANKMASK(IPR3), 1
// SPI1INTE<RXOIE>
extern volatile __bit                   RXOIE               __at(0x1E8DA);	// @ (0x3D1B * 8 + 2)
#define                                 RXOIE_bit           BANKMASK(SPI1INTE), 2
// SPI1INTF<RXOIF>
extern volatile __bit                   RXOIF               __at(0x1E8D2);	// @ (0x3D1A * 8 + 2)
#define                                 RXOIF_bit           BANKMASK(SPI1INTF), 2
// SPI1CON2<RXR>
extern volatile __bit                   RXR                 __at(0x1E8B0);	// @ (0x3D16 * 8 + 0)
#define                                 RXR_bit             BANKMASK(SPI1CON2), 0
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x1CE87);	// @ (0x39D0 * 8 + 7)
#define                                 SBOREN_bit          BANKMASK(BORCON), 7
// I2C1PIE<SC1IE>
extern volatile __bit                   SC1IE               __at(0x1EBD0);	// @ (0x3D7A * 8 + 0)
#define                                 SC1IE_bit           BANKMASK(I2C1PIE), 0
// I2C1PIR<SC1IF>
extern volatile __bit                   SC1IF               __at(0x1EBC8);	// @ (0x3D79 * 8 + 0)
#define                                 SC1IF_bit           BANKMASK(I2C1PIR), 0
// I2C2PIE<SC2IE>
extern volatile __bit                   SC2IE               __at(0x1EB20);	// @ (0x3D64 * 8 + 0)
#define                                 SC2IE_bit           BANKMASK(I2C2PIE), 0
// I2C2PIR<SC2IF>
extern volatile __bit                   SC2IF               __at(0x1EB18);	// @ (0x3D63 * 8 + 0)
#define                                 SC2IF_bit           BANKMASK(I2C2PIR), 0
// SCANHADRL<SCANHADR0>
extern volatile __bit                   SCANHADR0           __at(0x1CBC8);	// @ (0x3979 * 8 + 0)
#define                                 SCANHADR0_bit       BANKMASK(SCANHADRL), 0
// SCANHADRL<SCANHADR1>
extern volatile __bit                   SCANHADR1           __at(0x1CBC9);	// @ (0x3979 * 8 + 1)
#define                                 SCANHADR1_bit       BANKMASK(SCANHADRL), 1
// SCANHADRH<SCANHADR10>
extern volatile __bit                   SCANHADR10          __at(0x1CBD2);	// @ (0x397A * 8 + 2)
#define                                 SCANHADR10_bit      BANKMASK(SCANHADRH), 2
// SCANHADRH<SCANHADR11>
extern volatile __bit                   SCANHADR11          __at(0x1CBD3);	// @ (0x397A * 8 + 3)
#define                                 SCANHADR11_bit      BANKMASK(SCANHADRH), 3
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x1CBD4);	// @ (0x397A * 8 + 4)
#define                                 SCANHADR12_bit      BANKMASK(SCANHADRH), 4
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x1CBD5);	// @ (0x397A * 8 + 5)
#define                                 SCANHADR13_bit      BANKMASK(SCANHADRH), 5
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x1CBD6);	// @ (0x397A * 8 + 6)
#define                                 SCANHADR14_bit      BANKMASK(SCANHADRH), 6
// SCANHADRH<SCANHADR15>
extern volatile __bit                   SCANHADR15          __at(0x1CBD7);	// @ (0x397A * 8 + 7)
#define                                 SCANHADR15_bit      BANKMASK(SCANHADRH), 7
// SCANHADRU<SCANHADR16>
extern volatile __bit                   SCANHADR16          __at(0x1CBD8);	// @ (0x397B * 8 + 0)
#define                                 SCANHADR16_bit      BANKMASK(SCANHADRU), 0
// SCANHADRU<SCANHADR17>
extern volatile __bit                   SCANHADR17          __at(0x1CBD9);	// @ (0x397B * 8 + 1)
#define                                 SCANHADR17_bit      BANKMASK(SCANHADRU), 1
// SCANHADRU<SCANHADR18>
extern volatile __bit                   SCANHADR18          __at(0x1CBDA);	// @ (0x397B * 8 + 2)
#define                                 SCANHADR18_bit      BANKMASK(SCANHADRU), 2
// SCANHADRU<SCANHADR19>
extern volatile __bit                   SCANHADR19          __at(0x1CBDB);	// @ (0x397B * 8 + 3)
#define                                 SCANHADR19_bit      BANKMASK(SCANHADRU), 3
// SCANHADRL<SCANHADR2>
extern volatile __bit                   SCANHADR2           __at(0x1CBCA);	// @ (0x3979 * 8 + 2)
#define                                 SCANHADR2_bit       BANKMASK(SCANHADRL), 2
// SCANHADRU<SCANHADR20>
extern volatile __bit                   SCANHADR20          __at(0x1CBDC);	// @ (0x397B * 8 + 4)
#define                                 SCANHADR20_bit      BANKMASK(SCANHADRU), 4
// SCANHADRU<SCANHADR21>
extern volatile __bit                   SCANHADR21          __at(0x1CBDD);	// @ (0x397B * 8 + 5)
#define                                 SCANHADR21_bit      BANKMASK(SCANHADRU), 5
// SCANHADRL<SCANHADR3>
extern volatile __bit                   SCANHADR3           __at(0x1CBCB);	// @ (0x3979 * 8 + 3)
#define                                 SCANHADR3_bit       BANKMASK(SCANHADRL), 3
// SCANHADRL<SCANHADR4>
extern volatile __bit                   SCANHADR4           __at(0x1CBCC);	// @ (0x3979 * 8 + 4)
#define                                 SCANHADR4_bit       BANKMASK(SCANHADRL), 4
// SCANHADRL<SCANHADR5>
extern volatile __bit                   SCANHADR5           __at(0x1CBCD);	// @ (0x3979 * 8 + 5)
#define                                 SCANHADR5_bit       BANKMASK(SCANHADRL), 5
// SCANHADRL<SCANHADR6>
extern volatile __bit                   SCANHADR6           __at(0x1CBCE);	// @ (0x3979 * 8 + 6)
#define                                 SCANHADR6_bit       BANKMASK(SCANHADRL), 6
// SCANHADRL<SCANHADR7>
extern volatile __bit                   SCANHADR7           __at(0x1CBCF);	// @ (0x3979 * 8 + 7)
#define                                 SCANHADR7_bit       BANKMASK(SCANHADRL), 7
// SCANHADRH<SCANHADR8>
extern volatile __bit                   SCANHADR8           __at(0x1CBD0);	// @ (0x397A * 8 + 0)
#define                                 SCANHADR8_bit       BANKMASK(SCANHADRH), 0
// SCANHADRH<SCANHADR9>
extern volatile __bit                   SCANHADR9           __at(0x1CBD1);	// @ (0x397A * 8 + 1)
#define                                 SCANHADR9_bit       BANKMASK(SCANHADRH), 1
// PIE0<SCANIE>
extern volatile __bit                   SCANIE              __at(0x1CC85);	// @ (0x3990 * 8 + 5)
#define                                 SCANIE_bit          BANKMASK(PIE0), 5
// PIR0<SCANIF>
extern volatile __bit                   SCANIF              __at(0x1CD05);	// @ (0x39A0 * 8 + 5)
#define                                 SCANIF_bit          BANKMASK(PIR0), 5
// IPR0<SCANIP>
extern volatile __bit                   SCANIP              __at(0x1CC05);	// @ (0x3980 * 8 + 5)
#define                                 SCANIP_bit          BANKMASK(IPR0), 5
// SCANLADRL<SCANLADR0>
extern volatile __bit                   SCANLADR0           __at(0x1CBB0);	// @ (0x3976 * 8 + 0)
#define                                 SCANLADR0_bit       BANKMASK(SCANLADRL), 0
// SCANLADRL<SCANLADR1>
extern volatile __bit                   SCANLADR1           __at(0x1CBB1);	// @ (0x3976 * 8 + 1)
#define                                 SCANLADR1_bit       BANKMASK(SCANLADRL), 1
// SCANLADRH<SCANLADR10>
extern volatile __bit                   SCANLADR10          __at(0x1CBBA);	// @ (0x3977 * 8 + 2)
#define                                 SCANLADR10_bit      BANKMASK(SCANLADRH), 2
// SCANLADRH<SCANLADR11>
extern volatile __bit                   SCANLADR11          __at(0x1CBBB);	// @ (0x3977 * 8 + 3)
#define                                 SCANLADR11_bit      BANKMASK(SCANLADRH), 3
// SCANLADRH<SCANLADR12>
extern volatile __bit                   SCANLADR12          __at(0x1CBBC);	// @ (0x3977 * 8 + 4)
#define                                 SCANLADR12_bit      BANKMASK(SCANLADRH), 4
// SCANLADRH<SCANLADR13>
extern volatile __bit                   SCANLADR13          __at(0x1CBBD);	// @ (0x3977 * 8 + 5)
#define                                 SCANLADR13_bit      BANKMASK(SCANLADRH), 5
// SCANLADRH<SCANLADR14>
extern volatile __bit                   SCANLADR14          __at(0x1CBBE);	// @ (0x3977 * 8 + 6)
#define                                 SCANLADR14_bit      BANKMASK(SCANLADRH), 6
// SCANLADRH<SCANLADR15>
extern volatile __bit                   SCANLADR15          __at(0x1CBBF);	// @ (0x3977 * 8 + 7)
#define                                 SCANLADR15_bit      BANKMASK(SCANLADRH), 7
// SCANLADRU<SCANLADR16>
extern volatile __bit                   SCANLADR16          __at(0x1CBC0);	// @ (0x3978 * 8 + 0)
#define                                 SCANLADR16_bit      BANKMASK(SCANLADRU), 0
// SCANLADRU<SCANLADR17>
extern volatile __bit                   SCANLADR17          __at(0x1CBC1);	// @ (0x3978 * 8 + 1)
#define                                 SCANLADR17_bit      BANKMASK(SCANLADRU), 1
// SCANLADRU<SCANLADR18>
extern volatile __bit                   SCANLADR18          __at(0x1CBC2);	// @ (0x3978 * 8 + 2)
#define                                 SCANLADR18_bit      BANKMASK(SCANLADRU), 2
// SCANLADRU<SCANLADR19>
extern volatile __bit                   SCANLADR19          __at(0x1CBC3);	// @ (0x3978 * 8 + 3)
#define                                 SCANLADR19_bit      BANKMASK(SCANLADRU), 3
// SCANLADRL<SCANLADR2>
extern volatile __bit                   SCANLADR2           __at(0x1CBB2);	// @ (0x3976 * 8 + 2)
#define                                 SCANLADR2_bit       BANKMASK(SCANLADRL), 2
// SCANLADRU<SCANLADR20>
extern volatile __bit                   SCANLADR20          __at(0x1CBC4);	// @ (0x3978 * 8 + 4)
#define                                 SCANLADR20_bit      BANKMASK(SCANLADRU), 4
// SCANLADRU<SCANLADR21>
extern volatile __bit                   SCANLADR21          __at(0x1CBC5);	// @ (0x3978 * 8 + 5)
#define                                 SCANLADR21_bit      BANKMASK(SCANLADRU), 5
// SCANLADRL<SCANLADR3>
extern volatile __bit                   SCANLADR3           __at(0x1CBB3);	// @ (0x3976 * 8 + 3)
#define                                 SCANLADR3_bit       BANKMASK(SCANLADRL), 3
// SCANLADRL<SCANLADR4>
extern volatile __bit                   SCANLADR4           __at(0x1CBB4);	// @ (0x3976 * 8 + 4)
#define                                 SCANLADR4_bit       BANKMASK(SCANLADRL), 4
// SCANLADRL<SCANLADR5>
extern volatile __bit                   SCANLADR5           __at(0x1CBB5);	// @ (0x3976 * 8 + 5)
#define                                 SCANLADR5_bit       BANKMASK(SCANLADRL), 5
// SCANLADRL<SCANLADR6>
extern volatile __bit                   SCANLADR6           __at(0x1CBB6);	// @ (0x3976 * 8 + 6)
#define                                 SCANLADR6_bit       BANKMASK(SCANLADRL), 6
// SCANLADRL<SCANLADR7>
extern volatile __bit                   SCANLADR7           __at(0x1CBB7);	// @ (0x3976 * 8 + 7)
#define                                 SCANLADR7_bit       BANKMASK(SCANLADRL), 7
// SCANLADRH<SCANLADR8>
extern volatile __bit                   SCANLADR8           __at(0x1CBB8);	// @ (0x3977 * 8 + 0)
#define                                 SCANLADR8_bit       BANKMASK(SCANLADRH), 0
// SCANLADRH<SCANLADR9>
extern volatile __bit                   SCANLADR9           __at(0x1CBB9);	// @ (0x3977 * 8 + 1)
#define                                 SCANLADR9_bit       BANKMASK(SCANLADRH), 1
// PMD0<SCANMD>
extern volatile __bit                   SCANMD              __at(0x1CE03);	// @ (0x39C0 * 8 + 3)
#define                                 SCANMD_bit          BANKMASK(PMD0), 3
// SCANPR<SCANPR0>
extern volatile __bit                   SCANPR0             __at(0x1CFB8);	// @ (0x39F7 * 8 + 0)
#define                                 SCANPR0_bit         BANKMASK(SCANPR), 0
// SCANPR<SCANPR1>
extern volatile __bit                   SCANPR1             __at(0x1CFB9);	// @ (0x39F7 * 8 + 1)
#define                                 SCANPR1_bit         BANKMASK(SCANPR), 1
// SCANPR<SCANPR2>
extern volatile __bit                   SCANPR2             __at(0x1CFBA);	// @ (0x39F7 * 8 + 2)
#define                                 SCANPR2_bit         BANKMASK(SCANPR), 2
// SPI1CON1<SDIP>
extern volatile __bit                   SDIP                __at(0x1E8A9);	// @ (0x3D15 * 8 + 1)
#define                                 SDIP_bit            BANKMASK(SPI1CON1), 1
// SPI1CON1<SDOP>
extern volatile __bit                   SDOP                __at(0x1E8A8);	// @ (0x3D15 * 8 + 0)
#define                                 SDOP_bit            BANKMASK(SPI1CON1), 0
// HLVDCON1<SEL0>
extern volatile __bit                   SEL0                __at(0x1F650);	// @ (0x3ECA * 8 + 0)
#define                                 SEL0_bit            BANKMASK(HLVDCON1), 0
// HLVDCON1<SEL1>
extern volatile __bit                   SEL1                __at(0x1F651);	// @ (0x3ECA * 8 + 1)
#define                                 SEL1_bit            BANKMASK(HLVDCON1), 1
// HLVDCON1<SEL2>
extern volatile __bit                   SEL2                __at(0x1F652);	// @ (0x3ECA * 8 + 2)
#define                                 SEL2_bit            BANKMASK(HLVDCON1), 2
// HLVDCON1<SEL3>
extern volatile __bit                   SEL3                __at(0x1F653);	// @ (0x3ECA * 8 + 3)
#define                                 SEL3_bit            BANKMASK(HLVDCON1), 3
// SCANCON0<SGO>
extern volatile __bit                   SGO                 __at(0x1CBE5);	// @ (0x397C * 8 + 5)
#define                                 SGO_bit             BANKMASK(SCANCON0), 5
// SHADCON<SHADLO>
extern volatile __bit                   SHADLO              __at(0x1C418);	// @ (0x3883 * 8 + 0)
#define                                 SHADLO_bit          BANKMASK(SHADCON), 0
// CRCSHIFTL<SHFT0>
extern volatile __bit                   SHFT0               __at(0x1CB20);	// @ (0x3964 * 8 + 0)
#define                                 SHFT0_bit           BANKMASK(CRCSHIFTL), 0
// CRCSHIFTL<SHFT1>
extern volatile __bit                   SHFT1               __at(0x1CB21);	// @ (0x3964 * 8 + 1)
#define                                 SHFT1_bit           BANKMASK(CRCSHIFTL), 1
// CRCSHIFTH<SHFT10>
extern volatile __bit                   SHFT10              __at(0x1CB2A);	// @ (0x3965 * 8 + 2)
#define                                 SHFT10_bit          BANKMASK(CRCSHIFTH), 2
// CRCSHIFTH<SHFT11>
extern volatile __bit                   SHFT11              __at(0x1CB2B);	// @ (0x3965 * 8 + 3)
#define                                 SHFT11_bit          BANKMASK(CRCSHIFTH), 3
// CRCSHIFTH<SHFT12>
extern volatile __bit                   SHFT12              __at(0x1CB2C);	// @ (0x3965 * 8 + 4)
#define                                 SHFT12_bit          BANKMASK(CRCSHIFTH), 4
// CRCSHIFTH<SHFT13>
extern volatile __bit                   SHFT13              __at(0x1CB2D);	// @ (0x3965 * 8 + 5)
#define                                 SHFT13_bit          BANKMASK(CRCSHIFTH), 5
// CRCSHIFTH<SHFT14>
extern volatile __bit                   SHFT14              __at(0x1CB2E);	// @ (0x3965 * 8 + 6)
#define                                 SHFT14_bit          BANKMASK(CRCSHIFTH), 6
// CRCSHIFTH<SHFT15>
extern volatile __bit                   SHFT15              __at(0x1CB2F);	// @ (0x3965 * 8 + 7)
#define                                 SHFT15_bit          BANKMASK(CRCSHIFTH), 7
// CRCSHIFTL<SHFT2>
extern volatile __bit                   SHFT2               __at(0x1CB22);	// @ (0x3964 * 8 + 2)
#define                                 SHFT2_bit           BANKMASK(CRCSHIFTL), 2
// CRCSHIFTL<SHFT3>
extern volatile __bit                   SHFT3               __at(0x1CB23);	// @ (0x3964 * 8 + 3)
#define                                 SHFT3_bit           BANKMASK(CRCSHIFTL), 3
// CRCSHIFTL<SHFT4>
extern volatile __bit                   SHFT4               __at(0x1CB24);	// @ (0x3964 * 8 + 4)
#define                                 SHFT4_bit           BANKMASK(CRCSHIFTL), 4
// CRCSHIFTL<SHFT5>
extern volatile __bit                   SHFT5               __at(0x1CB25);	// @ (0x3964 * 8 + 5)
#define                                 SHFT5_bit           BANKMASK(CRCSHIFTL), 5
// CRCSHIFTL<SHFT6>
extern volatile __bit                   SHFT6               __at(0x1CB26);	// @ (0x3964 * 8 + 6)
#define                                 SHFT6_bit           BANKMASK(CRCSHIFTL), 6
// CRCSHIFTL<SHFT7>
extern volatile __bit                   SHFT7               __at(0x1CB27);	// @ (0x3964 * 8 + 7)
#define                                 SHFT7_bit           BANKMASK(CRCSHIFTL), 7
// CRCSHIFTH<SHFT8>
extern volatile __bit                   SHFT8               __at(0x1CB28);	// @ (0x3965 * 8 + 0)
#define                                 SHFT8_bit           BANKMASK(CRCSHIFTH), 0
// CRCSHIFTH<SHFT9>
extern volatile __bit                   SHFT9               __at(0x1CB29);	// @ (0x3965 * 8 + 1)
#define                                 SHFT9_bit           BANKMASK(CRCSHIFTH), 1
// CRCCON0<SHIFTM>
extern volatile __bit                   SHIFTM              __at(0x1CB41);	// @ (0x3968 * 8 + 1)
#define                                 SHIFTM_bit          BANKMASK(CRCCON0), 1
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0x1D218);	// @ (0x3A43 * 8 + 0)
#define                                 SLRA0_bit           BANKMASK(SLRCONA), 0
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0x1D219);	// @ (0x3A43 * 8 + 1)
#define                                 SLRA1_bit           BANKMASK(SLRCONA), 1
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0x1D21A);	// @ (0x3A43 * 8 + 2)
#define                                 SLRA2_bit           BANKMASK(SLRCONA), 2
// SLRCONA<SLRA3>
extern volatile __bit                   SLRA3               __at(0x1D21B);	// @ (0x3A43 * 8 + 3)
#define                                 SLRA3_bit           BANKMASK(SLRCONA), 3
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0x1D21C);	// @ (0x3A43 * 8 + 4)
#define                                 SLRA4_bit           BANKMASK(SLRCONA), 4
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0x1D21D);	// @ (0x3A43 * 8 + 5)
#define                                 SLRA5_bit           BANKMASK(SLRCONA), 5
// SLRCONA<SLRA6>
extern volatile __bit                   SLRA6               __at(0x1D21E);	// @ (0x3A43 * 8 + 6)
#define                                 SLRA6_bit           BANKMASK(SLRCONA), 6
// SLRCONA<SLRA7>
extern volatile __bit                   SLRA7               __at(0x1D21F);	// @ (0x3A43 * 8 + 7)
#define                                 SLRA7_bit           BANKMASK(SLRCONA), 7
// SLRCONB<SLRB0>
extern volatile __bit                   SLRB0               __at(0x1D298);	// @ (0x3A53 * 8 + 0)
#define                                 SLRB0_bit           BANKMASK(SLRCONB), 0
// SLRCONB<SLRB1>
extern volatile __bit                   SLRB1               __at(0x1D299);	// @ (0x3A53 * 8 + 1)
#define                                 SLRB1_bit           BANKMASK(SLRCONB), 1
// SLRCONB<SLRB2>
extern volatile __bit                   SLRB2               __at(0x1D29A);	// @ (0x3A53 * 8 + 2)
#define                                 SLRB2_bit           BANKMASK(SLRCONB), 2
// SLRCONB<SLRB3>
extern volatile __bit                   SLRB3               __at(0x1D29B);	// @ (0x3A53 * 8 + 3)
#define                                 SLRB3_bit           BANKMASK(SLRCONB), 3
// SLRCONB<SLRB4>
extern volatile __bit                   SLRB4               __at(0x1D29C);	// @ (0x3A53 * 8 + 4)
#define                                 SLRB4_bit           BANKMASK(SLRCONB), 4
// SLRCONB<SLRB5>
extern volatile __bit                   SLRB5               __at(0x1D29D);	// @ (0x3A53 * 8 + 5)
#define                                 SLRB5_bit           BANKMASK(SLRCONB), 5
// SLRCONB<SLRB6>
