LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   SLRB6               __at(0x1D29E);	// @ (0x3A53 * 8 + 6)
#define                                 SLRB6_bit           BANKMASK(SLRCONB), 6
// SLRCONB<SLRB7>
extern volatile __bit                   SLRB7               __at(0x1D29F);	// @ (0x3A53 * 8 + 7)
#define                                 SLRB7_bit           BANKMASK(SLRCONB), 7
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0x1D318);	// @ (0x3A63 * 8 + 0)
#define                                 SLRC0_bit           BANKMASK(SLRCONC), 0
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0x1D319);	// @ (0x3A63 * 8 + 1)
#define                                 SLRC1_bit           BANKMASK(SLRCONC), 1
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0x1D31A);	// @ (0x3A63 * 8 + 2)
#define                                 SLRC2_bit           BANKMASK(SLRCONC), 2
// SLRCONC<SLRC3>
extern volatile __bit                   SLRC3               __at(0x1D31B);	// @ (0x3A63 * 8 + 3)
#define                                 SLRC3_bit           BANKMASK(SLRCONC), 3
// SLRCONC<SLRC4>
extern volatile __bit                   SLRC4               __at(0x1D31C);	// @ (0x3A63 * 8 + 4)
#define                                 SLRC4_bit           BANKMASK(SLRCONC), 4
// SLRCONC<SLRC5>
extern volatile __bit                   SLRC5               __at(0x1D31D);	// @ (0x3A63 * 8 + 5)
#define                                 SLRC5_bit           BANKMASK(SLRCONC), 5
// SLRCONC<SLRC6>
extern volatile __bit                   SLRC6               __at(0x1D31E);	// @ (0x3A63 * 8 + 6)
#define                                 SLRC6_bit           BANKMASK(SLRCONC), 6
// SLRCONC<SLRC7>
extern volatile __bit                   SLRC7               __at(0x1D31F);	// @ (0x3A63 * 8 + 7)
#define                                 SLRC7_bit           BANKMASK(SLRCONC), 7
// SLRCOND<SLRD0>
extern volatile __bit                   SLRD0               __at(0x1D398);	// @ (0x3A73 * 8 + 0)
#define                                 SLRD0_bit           BANKMASK(SLRCOND), 0
// SLRCOND<SLRD1>
extern volatile __bit                   SLRD1               __at(0x1D399);	// @ (0x3A73 * 8 + 1)
#define                                 SLRD1_bit           BANKMASK(SLRCOND), 1
// SLRCOND<SLRD2>
extern volatile __bit                   SLRD2               __at(0x1D39A);	// @ (0x3A73 * 8 + 2)
#define                                 SLRD2_bit           BANKMASK(SLRCOND), 2
// SLRCOND<SLRD3>
extern volatile __bit                   SLRD3               __at(0x1D39B);	// @ (0x3A73 * 8 + 3)
#define                                 SLRD3_bit           BANKMASK(SLRCOND), 3
// SLRCOND<SLRD4>
extern volatile __bit                   SLRD4               __at(0x1D39C);	// @ (0x3A73 * 8 + 4)
#define                                 SLRD4_bit           BANKMASK(SLRCOND), 4
// SLRCOND<SLRD5>
extern volatile __bit                   SLRD5               __at(0x1D39D);	// @ (0x3A73 * 8 + 5)
#define                                 SLRD5_bit           BANKMASK(SLRCOND), 5
// SLRCOND<SLRD6>
extern volatile __bit                   SLRD6               __at(0x1D39E);	// @ (0x3A73 * 8 + 6)
#define                                 SLRD6_bit           BANKMASK(SLRCOND), 6
// SLRCOND<SLRD7>
extern volatile __bit                   SLRD7               __at(0x1D39F);	// @ (0x3A73 * 8 + 7)
#define                                 SLRD7_bit           BANKMASK(SLRCOND), 7
// SLRCONE<SLRE0>
extern volatile __bit                   SLRE0               __at(0x1D418);	// @ (0x3A83 * 8 + 0)
#define                                 SLRE0_bit           BANKMASK(SLRCONE), 0
// SLRCONE<SLRE1>
extern volatile __bit                   SLRE1               __at(0x1D419);	// @ (0x3A83 * 8 + 1)
#define                                 SLRE1_bit           BANKMASK(SLRCONE), 1
// SLRCONE<SLRE2>
extern volatile __bit                   SLRE2               __at(0x1D41A);	// @ (0x3A83 * 8 + 2)
#define                                 SLRE2_bit           BANKMASK(SLRCONE), 2
// SPI1CON1<SMP>
extern volatile __bit                   SMP                 __at(0x1E8AF);	// @ (0x3D15 * 8 + 7)
#define                                 SMP_bit             BANKMASK(SPI1CON1), 7
// SMT1STAT<SMT1AS>
extern volatile __bit                   SMT1AS              __at(0x1F900);	// @ (0x3F20 * 8 + 0)
#define                                 SMT1AS_bit          BANKMASK(SMT1STAT), 0
// SMT1CON0<SMT1CPOL>
extern volatile __bit                   SMT1CPOL            __at(0x1F8F2);	// @ (0x3F1E * 8 + 2)
#define                                 SMT1CPOL_bit        BANKMASK(SMT1CON0), 2
// SMT1CPRL<SMT1CPR0>
extern volatile __bit                   SMT1CPR0            __at(0x1F8A8);	// @ (0x3F15 * 8 + 0)
#define                                 SMT1CPR0_bit        BANKMASK(SMT1CPRL), 0
// SMT1CPRL<SMT1CPR1>
extern volatile __bit                   SMT1CPR1            __at(0x1F8A9);	// @ (0x3F15 * 8 + 1)
#define                                 SMT1CPR1_bit        BANKMASK(SMT1CPRL), 1
// SMT1CPRH<SMT1CPR10>
extern volatile __bit                   SMT1CPR10           __at(0x1F8B2);	// @ (0x3F16 * 8 + 2)
#define                                 SMT1CPR10_bit       BANKMASK(SMT1CPRH), 2
// SMT1CPRH<SMT1CPR11>
extern volatile __bit                   SMT1CPR11           __at(0x1F8B3);	// @ (0x3F16 * 8 + 3)
#define                                 SMT1CPR11_bit       BANKMASK(SMT1CPRH), 3
// SMT1CPRH<SMT1CPR12>
extern volatile __bit                   SMT1CPR12           __at(0x1F8B4);	// @ (0x3F16 * 8 + 4)
#define                                 SMT1CPR12_bit       BANKMASK(SMT1CPRH), 4
// SMT1CPRH<SMT1CPR13>
extern volatile __bit                   SMT1CPR13           __at(0x1F8B5);	// @ (0x3F16 * 8 + 5)
#define                                 SMT1CPR13_bit       BANKMASK(SMT1CPRH), 5
// SMT1CPRH<SMT1CPR14>
extern volatile __bit                   SMT1CPR14           __at(0x1F8B6);	// @ (0x3F16 * 8 + 6)
#define                                 SMT1CPR14_bit       BANKMASK(SMT1CPRH), 6
// SMT1CPRH<SMT1CPR15>
extern volatile __bit                   SMT1CPR15           __at(0x1F8B7);	// @ (0x3F16 * 8 + 7)
#define                                 SMT1CPR15_bit       BANKMASK(SMT1CPRH), 7
// SMT1CPRU<SMT1CPR16>
extern volatile __bit                   SMT1CPR16           __at(0x1F8B8);	// @ (0x3F17 * 8 + 0)
#define                                 SMT1CPR16_bit       BANKMASK(SMT1CPRU), 0
// SMT1CPRU<SMT1CPR17>
extern volatile __bit                   SMT1CPR17           __at(0x1F8B9);	// @ (0x3F17 * 8 + 1)
#define                                 SMT1CPR17_bit       BANKMASK(SMT1CPRU), 1
// SMT1CPRU<SMT1CPR18>
extern volatile __bit                   SMT1CPR18           __at(0x1F8BA);	// @ (0x3F17 * 8 + 2)
#define                                 SMT1CPR18_bit       BANKMASK(SMT1CPRU), 2
// SMT1CPRU<SMT1CPR19>
extern volatile __bit                   SMT1CPR19           __at(0x1F8BB);	// @ (0x3F17 * 8 + 3)
#define                                 SMT1CPR19_bit       BANKMASK(SMT1CPRU), 3
// SMT1CPRL<SMT1CPR2>
extern volatile __bit                   SMT1CPR2            __at(0x1F8AA);	// @ (0x3F15 * 8 + 2)
#define                                 SMT1CPR2_bit        BANKMASK(SMT1CPRL), 2
// SMT1CPRU<SMT1CPR20>
extern volatile __bit                   SMT1CPR20           __at(0x1F8BC);	// @ (0x3F17 * 8 + 4)
#define                                 SMT1CPR20_bit       BANKMASK(SMT1CPRU), 4
// SMT1CPRU<SMT1CPR21>
extern volatile __bit                   SMT1CPR21           __at(0x1F8BD);	// @ (0x3F17 * 8 + 5)
#define                                 SMT1CPR21_bit       BANKMASK(SMT1CPRU), 5
// SMT1CPRU<SMT1CPR22>
extern volatile __bit                   SMT1CPR22           __at(0x1F8BE);	// @ (0x3F17 * 8 + 6)
#define                                 SMT1CPR22_bit       BANKMASK(SMT1CPRU), 6
// SMT1CPRU<SMT1CPR23>
extern volatile __bit                   SMT1CPR23           __at(0x1F8BF);	// @ (0x3F17 * 8 + 7)
#define                                 SMT1CPR23_bit       BANKMASK(SMT1CPRU), 7
// SMT1CPRL<SMT1CPR3>
extern volatile __bit                   SMT1CPR3            __at(0x1F8AB);	// @ (0x3F15 * 8 + 3)
#define                                 SMT1CPR3_bit        BANKMASK(SMT1CPRL), 3
// SMT1CPRL<SMT1CPR4>
extern volatile __bit                   SMT1CPR4            __at(0x1F8AC);	// @ (0x3F15 * 8 + 4)
#define                                 SMT1CPR4_bit        BANKMASK(SMT1CPRL), 4
// SMT1CPRL<SMT1CPR5>
extern volatile __bit                   SMT1CPR5            __at(0x1F8AD);	// @ (0x3F15 * 8 + 5)
#define                                 SMT1CPR5_bit        BANKMASK(SMT1CPRL), 5
// SMT1CPRL<SMT1CPR6>
extern volatile __bit                   SMT1CPR6            __at(0x1F8AE);	// @ (0x3F15 * 8 + 6)
#define                                 SMT1CPR6_bit        BANKMASK(SMT1CPRL), 6
// SMT1CPRL<SMT1CPR7>
extern volatile __bit                   SMT1CPR7            __at(0x1F8AF);	// @ (0x3F15 * 8 + 7)
#define                                 SMT1CPR7_bit        BANKMASK(SMT1CPRL), 7
// SMT1CPRH<SMT1CPR8>
extern volatile __bit                   SMT1CPR8            __at(0x1F8B0);	// @ (0x3F16 * 8 + 0)
#define                                 SMT1CPR8_bit        BANKMASK(SMT1CPRH), 0
// SMT1CPRH<SMT1CPR9>
extern volatile __bit                   SMT1CPR9            __at(0x1F8B1);	// @ (0x3F16 * 8 + 1)
#define                                 SMT1CPR9_bit        BANKMASK(SMT1CPRH), 1
// SMT1STAT<SMT1CPRUP>
extern volatile __bit                   SMT1CPRUP           __at(0x1F907);	// @ (0x3F20 * 8 + 7)
#define                                 SMT1CPRUP_bit       BANKMASK(SMT1STAT), 7
// SMT1CPWL<SMT1CPW0>
extern volatile __bit                   SMT1CPW0            __at(0x1F8C0);	// @ (0x3F18 * 8 + 0)
#define                                 SMT1CPW0_bit        BANKMASK(SMT1CPWL), 0
// SMT1CPWL<SMT1CPW1>
extern volatile __bit                   SMT1CPW1            __at(0x1F8C1);	// @ (0x3F18 * 8 + 1)
#define                                 SMT1CPW1_bit        BANKMASK(SMT1CPWL), 1
// SMT1CPWH<SMT1CPW10>
extern volatile __bit                   SMT1CPW10           __at(0x1F8CA);	// @ (0x3F19 * 8 + 2)
#define                                 SMT1CPW10_bit       BANKMASK(SMT1CPWH), 2
// SMT1CPWH<SMT1CPW11>
extern volatile __bit                   SMT1CPW11           __at(0x1F8CB);	// @ (0x3F19 * 8 + 3)
#define                                 SMT1CPW11_bit       BANKMASK(SMT1CPWH), 3
// SMT1CPWH<SMT1CPW12>
extern volatile __bit                   SMT1CPW12           __at(0x1F8CC);	// @ (0x3F19 * 8 + 4)
#define                                 SMT1CPW12_bit       BANKMASK(SMT1CPWH), 4
// SMT1CPWH<SMT1CPW13>
extern volatile __bit                   SMT1CPW13           __at(0x1F8CD);	// @ (0x3F19 * 8 + 5)
#define                                 SMT1CPW13_bit       BANKMASK(SMT1CPWH), 5
// SMT1CPWH<SMT1CPW14>
extern volatile __bit                   SMT1CPW14           __at(0x1F8CE);	// @ (0x3F19 * 8 + 6)
#define                                 SMT1CPW14_bit       BANKMASK(SMT1CPWH), 6
// SMT1CPWH<SMT1CPW15>
extern volatile __bit                   SMT1CPW15           __at(0x1F8CF);	// @ (0x3F19 * 8 + 7)
#define                                 SMT1CPW15_bit       BANKMASK(SMT1CPWH), 7
// SMT1CPWU<SMT1CPW16>
extern volatile __bit                   SMT1CPW16           __at(0x1F8D0);	// @ (0x3F1A * 8 + 0)
#define                                 SMT1CPW16_bit       BANKMASK(SMT1CPWU), 0
// SMT1CPWU<SMT1CPW17>
extern volatile __bit                   SMT1CPW17           __at(0x1F8D1);	// @ (0x3F1A * 8 + 1)
#define                                 SMT1CPW17_bit       BANKMASK(SMT1CPWU), 1
// SMT1CPWU<SMT1CPW18>
extern volatile __bit                   SMT1CPW18           __at(0x1F8D2);	// @ (0x3F1A * 8 + 2)
#define                                 SMT1CPW18_bit       BANKMASK(SMT1CPWU), 2
// SMT1CPWU<SMT1CPW19>
extern volatile __bit                   SMT1CPW19           __at(0x1F8D3);	// @ (0x3F1A * 8 + 3)
#define                                 SMT1CPW19_bit       BANKMASK(SMT1CPWU), 3
// SMT1CPWL<SMT1CPW2>
extern volatile __bit                   SMT1CPW2            __at(0x1F8C2);	// @ (0x3F18 * 8 + 2)
#define                                 SMT1CPW2_bit        BANKMASK(SMT1CPWL), 2
// SMT1CPWU<SMT1CPW20>
extern volatile __bit                   SMT1CPW20           __at(0x1F8D4);	// @ (0x3F1A * 8 + 4)
#define                                 SMT1CPW20_bit       BANKMASK(SMT1CPWU), 4
// SMT1CPWU<SMT1CPW21>
extern volatile __bit                   SMT1CPW21           __at(0x1F8D5);	// @ (0x3F1A * 8 + 5)
#define                                 SMT1CPW21_bit       BANKMASK(SMT1CPWU), 5
// SMT1CPWU<SMT1CPW22>
extern volatile __bit                   SMT1CPW22           __at(0x1F8D6);	// @ (0x3F1A * 8 + 6)
#define                                 SMT1CPW22_bit       BANKMASK(SMT1CPWU), 6
// SMT1CPWU<SMT1CPW23>
extern volatile __bit                   SMT1CPW23           __at(0x1F8D7);	// @ (0x3F1A * 8 + 7)
#define                                 SMT1CPW23_bit       BANKMASK(SMT1CPWU), 7
// SMT1CPWL<SMT1CPW3>
extern volatile __bit                   SMT1CPW3            __at(0x1F8C3);	// @ (0x3F18 * 8 + 3)
#define                                 SMT1CPW3_bit        BANKMASK(SMT1CPWL), 3
// SMT1CPWL<SMT1CPW4>
extern volatile __bit                   SMT1CPW4            __at(0x1F8C4);	// @ (0x3F18 * 8 + 4)
#define                                 SMT1CPW4_bit        BANKMASK(SMT1CPWL), 4
// SMT1CPWL<SMT1CPW5>
extern volatile __bit                   SMT1CPW5            __at(0x1F8C5);	// @ (0x3F18 * 8 + 5)
#define                                 SMT1CPW5_bit        BANKMASK(SMT1CPWL), 5
// SMT1CPWL<SMT1CPW6>
extern volatile __bit                   SMT1CPW6            __at(0x1F8C6);	// @ (0x3F18 * 8 + 6)
#define                                 SMT1CPW6_bit        BANKMASK(SMT1CPWL), 6
// SMT1CPWL<SMT1CPW7>
extern volatile __bit                   SMT1CPW7            __at(0x1F8C7);	// @ (0x3F18 * 8 + 7)
#define                                 SMT1CPW7_bit        BANKMASK(SMT1CPWL), 7
// SMT1CPWH<SMT1CPW8>
extern volatile __bit                   SMT1CPW8            __at(0x1F8C8);	// @ (0x3F19 * 8 + 0)
#define                                 SMT1CPW8_bit        BANKMASK(SMT1CPWH), 0
// SMT1CPWH<SMT1CPW9>
extern volatile __bit                   SMT1CPW9            __at(0x1F8C9);	// @ (0x3F19 * 8 + 1)
#define                                 SMT1CPW9_bit        BANKMASK(SMT1CPWH), 1
// SMT1STAT<SMT1CPWUP>
extern volatile __bit                   SMT1CPWUP           __at(0x1F906);	// @ (0x3F20 * 8 + 6)
#define                                 SMT1CPWUP_bit       BANKMASK(SMT1STAT), 6
// SMT1CLK<SMT1CSEL0>
extern volatile __bit                   SMT1CSEL0           __at(0x1F908);	// @ (0x3F21 * 8 + 0)
#define                                 SMT1CSEL0_bit       BANKMASK(SMT1CLK), 0
// SMT1CLK<SMT1CSEL1>
extern volatile __bit                   SMT1CSEL1           __at(0x1F909);	// @ (0x3F21 * 8 + 1)
#define                                 SMT1CSEL1_bit       BANKMASK(SMT1CLK), 1
// SMT1CLK<SMT1CSEL2>
extern volatile __bit                   SMT1CSEL2           __at(0x1F90A);	// @ (0x3F21 * 8 + 2)
#define                                 SMT1CSEL2_bit       BANKMASK(SMT1CLK), 2
// SMT1CON0<SMT1EN>
extern volatile __bit                   SMT1EN              __at(0x1F8F7);	// @ (0x3F1E * 8 + 7)
#define                                 SMT1EN_bit          BANKMASK(SMT1CON0), 7
// SMT1CON1<SMT1GO>
extern volatile __bit                   SMT1GO              __at(0x1F8FF);	// @ (0x3F1F * 8 + 7)
#define                                 SMT1GO_bit          BANKMASK(SMT1CON1), 7
// PIE1<SMT1IE>
extern volatile __bit                   SMT1IE              __at(0x1CC8D);	// @ (0x3991 * 8 + 5)
#define                                 SMT1IE_bit          BANKMASK(PIE1), 5
// PIR1<SMT1IF>
extern volatile __bit                   SMT1IF              __at(0x1CD0D);	// @ (0x39A1 * 8 + 5)
#define                                 SMT1IF_bit          BANKMASK(PIR1), 5
// IPR1<SMT1IP>
extern volatile __bit                   SMT1IP              __at(0x1CC0D);	// @ (0x3981 * 8 + 5)
#define                                 SMT1IP_bit          BANKMASK(IPR1), 5
// PMD6<SMT1MD>
extern volatile __bit                   SMT1MD              __at(0x1CE35);	// @ (0x39C6 * 8 + 5)
#define                                 SMT1MD_bit          BANKMASK(PMD6), 5
// SMT1PRL<SMT1PR0>
extern volatile __bit                   SMT1PR0             __at(0x1F8D8);	// @ (0x3F1B * 8 + 0)
#define                                 SMT1PR0_bit         BANKMASK(SMT1PRL), 0
// SMT1PRL<SMT1PR1>
extern volatile __bit                   SMT1PR1             __at(0x1F8D9);	// @ (0x3F1B * 8 + 1)
#define                                 SMT1PR1_bit         BANKMASK(SMT1PRL), 1
// SMT1PRH<SMT1PR10>
extern volatile __bit                   SMT1PR10            __at(0x1F8E2);	// @ (0x3F1C * 8 + 2)
#define                                 SMT1PR10_bit        BANKMASK(SMT1PRH), 2
// SMT1PRH<SMT1PR11>
extern volatile __bit                   SMT1PR11            __at(0x1F8E3);	// @ (0x3F1C * 8 + 3)
#define                                 SMT1PR11_bit        BANKMASK(SMT1PRH), 3
// SMT1PRH<SMT1PR12>
extern volatile __bit                   SMT1PR12            __at(0x1F8E4);	// @ (0x3F1C * 8 + 4)
#define                                 SMT1PR12_bit        BANKMASK(SMT1PRH), 4
// SMT1PRH<SMT1PR13>
extern volatile __bit                   SMT1PR13            __at(0x1F8E5);	// @ (0x3F1C * 8 + 5)
#define                                 SMT1PR13_bit        BANKMASK(SMT1PRH), 5
// SMT1PRH<SMT1PR14>
extern volatile __bit                   SMT1PR14            __at(0x1F8E6);	// @ (0x3F1C * 8 + 6)
#define                                 SMT1PR14_bit        BANKMASK(SMT1PRH), 6
// SMT1PRH<SMT1PR15>
extern volatile __bit                   SMT1PR15            __at(0x1F8E7);	// @ (0x3F1C * 8 + 7)
#define                                 SMT1PR15_bit        BANKMASK(SMT1PRH), 7
// SMT1PRU<SMT1PR16>
extern volatile __bit                   SMT1PR16            __at(0x1F8E8);	// @ (0x3F1D * 8 + 0)
#define                                 SMT1PR16_bit        BANKMASK(SMT1PRU), 0
// SMT1PRU<SMT1PR17>
extern volatile __bit                   SMT1PR17            __at(0x1F8E9);	// @ (0x3F1D * 8 + 1)
#define                                 SMT1PR17_bit        BANKMASK(SMT1PRU), 1
// SMT1PRU<SMT1PR18>
extern volatile __bit                   SMT1PR18            __at(0x1F8EA);	// @ (0x3F1D * 8 + 2)
#define                                 SMT1PR18_bit        BANKMASK(SMT1PRU), 2
// SMT1PRU<SMT1PR19>
extern volatile __bit                   SMT1PR19            __at(0x1F8EB);	// @ (0x3F1D * 8 + 3)
#define                                 SMT1PR19_bit        BANKMASK(SMT1PRU), 3
// SMT1PRL<SMT1PR2>
extern volatile __bit                   SMT1PR2             __at(0x1F8DA);	// @ (0x3F1B * 8 + 2)
#define                                 SMT1PR2_bit         BANKMASK(SMT1PRL), 2
// SMT1PRU<SMT1PR20>
extern volatile __bit                   SMT1PR20            __at(0x1F8EC);	// @ (0x3F1D * 8 + 4)
#define                                 SMT1PR20_bit        BANKMASK(SMT1PRU), 4
// SMT1PRU<SMT1PR21>
extern volatile __bit                   SMT1PR21            __at(0x1F8ED);	// @ (0x3F1D * 8 + 5)
#define                                 SMT1PR21_bit        BANKMASK(SMT1PRU), 5
// SMT1PRU<SMT1PR22>
extern volatile __bit                   SMT1PR22            __at(0x1F8EE);	// @ (0x3F1D * 8 + 6)
#define                                 SMT1PR22_bit        BANKMASK(SMT1PRU), 6
// SMT1PRU<SMT1PR23>
extern volatile __bit                   SMT1PR23            __at(0x1F8EF);	// @ (0x3F1D * 8 + 7)
#define                                 SMT1PR23_bit        BANKMASK(SMT1PRU), 7
// SMT1PRL<SMT1PR3>
extern volatile __bit                   SMT1PR3             __at(0x1F8DB);	// @ (0x3F1B * 8 + 3)
#define                                 SMT1PR3_bit         BANKMASK(SMT1PRL), 3
// SMT1PRL<SMT1PR4>
extern volatile __bit                   SMT1PR4             __at(0x1F8DC);	// @ (0x3F1B * 8 + 4)
#define                                 SMT1PR4_bit         BANKMASK(SMT1PRL), 4
// SMT1PRL<SMT1PR5>
extern volatile __bit                   SMT1PR5             __at(0x1F8DD);	// @ (0x3F1B * 8 + 5)
#define                                 SMT1PR5_bit         BANKMASK(SMT1PRL), 5
// SMT1PRL<SMT1PR6>
extern volatile __bit                   SMT1PR6             __at(0x1F8DE);	// @ (0x3F1B * 8 + 6)
#define                                 SMT1PR6_bit         BANKMASK(SMT1PRL), 6
// SMT1PRL<SMT1PR7>
extern volatile __bit                   SMT1PR7             __at(0x1F8DF);	// @ (0x3F1B * 8 + 7)
#define                                 SMT1PR7_bit         BANKMASK(SMT1PRL), 7
// SMT1PRH<SMT1PR8>
extern volatile __bit                   SMT1PR8             __at(0x1F8E0);	// @ (0x3F1C * 8 + 0)
#define                                 SMT1PR8_bit         BANKMASK(SMT1PRH), 0
// SMT1PRH<SMT1PR9>
extern volatile __bit                   SMT1PR9             __at(0x1F8E1);	// @ (0x3F1C * 8 + 1)
#define                                 SMT1PR9_bit         BANKMASK(SMT1PRH), 1
// PIE1<SMT1PRAIE>
extern volatile __bit                   SMT1PRAIE           __at(0x1CC8E);	// @ (0x3991 * 8 + 6)
#define                                 SMT1PRAIE_bit       BANKMASK(PIE1), 6
// PIR1<SMT1PRAIF>
extern volatile __bit                   SMT1PRAIF           __at(0x1CD0E);	// @ (0x39A1 * 8 + 6)
#define                                 SMT1PRAIF_bit       BANKMASK(PIR1), 6
// IPR1<SMT1PRAIP>
extern volatile __bit                   SMT1PRAIP           __at(0x1CC0E);	// @ (0x3981 * 8 + 6)
#define                                 SMT1PRAIP_bit       BANKMASK(IPR1), 6
// SMT1CON0<SMT1PS0>
extern volatile __bit                   SMT1PS0             __at(0x1F8F0);	// @ (0x3F1E * 8 + 0)
#define                                 SMT1PS0_bit         BANKMASK(SMT1CON0), 0
// SMT1CON0<SMT1PS1>
extern volatile __bit                   SMT1PS1             __at(0x1F8F1);	// @ (0x3F1E * 8 + 1)
#define                                 SMT1PS1_bit         BANKMASK(SMT1CON0), 1
// PIE1<SMT1PWAIE>
extern volatile __bit                   SMT1PWAIE           __at(0x1CC8F);	// @ (0x3991 * 8 + 7)
#define                                 SMT1PWAIE_bit       BANKMASK(PIE1), 7
// PIR1<SMT1PWAIF>
extern volatile __bit                   SMT1PWAIF           __at(0x1CD0F);	// @ (0x39A1 * 8 + 7)
#define                                 SMT1PWAIF_bit       BANKMASK(PIR1), 7
// IPR1<SMT1PWAIP>
extern volatile __bit                   SMT1PWAIP           __at(0x1CC0F);	// @ (0x3981 * 8 + 7)
#define                                 SMT1PWAIP_bit       BANKMASK(IPR1), 7
// SMT1CON1<SMT1REPEAT>
extern volatile __bit                   SMT1REPEAT          __at(0x1F8FE);	// @ (0x3F1F * 8 + 6)
#define                                 SMT1REPEAT_bit      BANKMASK(SMT1CON1), 6
// SMT1STAT<SMT1RESET>
extern volatile __bit                   SMT1RESET           __at(0x1F905);	// @ (0x3F20 * 8 + 5)
#define                                 SMT1RESET_bit       BANKMASK(SMT1STAT), 5
// SMT1STAT<SMT1RST>
extern volatile __bit                   SMT1RST             __at(0x1F905);	// @ (0x3F20 * 8 + 5)
#define                                 SMT1RST_bit         BANKMASK(SMT1STAT), 5
// SMT1CON0<SMT1SPOL>
extern volatile __bit                   SMT1SPOL            __at(0x1F8F3);	// @ (0x3F1E * 8 + 3)
#define                                 SMT1SPOL_bit        BANKMASK(SMT1CON0), 3
// SMT1SIG<SMT1SSEL0>
extern volatile __bit                   SMT1SSEL0           __at(0x1F910);	// @ (0x3F22 * 8 + 0)
#define                                 SMT1SSEL0_bit       BANKMASK(SMT1SIG), 0
// SMT1SIG<SMT1SSEL1>
extern volatile __bit                   SMT1SSEL1           __at(0x1F911);	// @ (0x3F22 * 8 + 1)
