LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
#define                                 SMT1SSEL1_bit       BANKMASK(SMT1SIG), 1
// SMT1SIG<SMT1SSEL2>
extern volatile __bit                   SMT1SSEL2           __at(0x1F912);	// @ (0x3F22 * 8 + 2)
#define                                 SMT1SSEL2_bit       BANKMASK(SMT1SIG), 2
// SMT1SIG<SMT1SSEL3>
extern volatile __bit                   SMT1SSEL3           __at(0x1F913);	// @ (0x3F22 * 8 + 3)
#define                                 SMT1SSEL3_bit       BANKMASK(SMT1SIG), 3
// SMT1SIG<SMT1SSEL4>
extern volatile __bit                   SMT1SSEL4           __at(0x1F914);	// @ (0x3F22 * 8 + 4)
#define                                 SMT1SSEL4_bit       BANKMASK(SMT1SIG), 4
// SMT1CON0<SMT1STP>
extern volatile __bit                   SMT1STP             __at(0x1F8F5);	// @ (0x3F1E * 8 + 5)
#define                                 SMT1STP_bit         BANKMASK(SMT1CON0), 5
// SMT1TMRL<SMT1TMR0>
extern volatile __bit                   SMT1TMR0            __at(0x1F890);	// @ (0x3F12 * 8 + 0)
#define                                 SMT1TMR0_bit        BANKMASK(SMT1TMRL), 0
// SMT1TMRL<SMT1TMR1>
extern volatile __bit                   SMT1TMR1            __at(0x1F891);	// @ (0x3F12 * 8 + 1)
#define                                 SMT1TMR1_bit        BANKMASK(SMT1TMRL), 1
// SMT1TMRH<SMT1TMR10>
extern volatile __bit                   SMT1TMR10           __at(0x1F89A);	// @ (0x3F13 * 8 + 2)
#define                                 SMT1TMR10_bit       BANKMASK(SMT1TMRH), 2
// SMT1TMRH<SMT1TMR11>
extern volatile __bit                   SMT1TMR11           __at(0x1F89B);	// @ (0x3F13 * 8 + 3)
#define                                 SMT1TMR11_bit       BANKMASK(SMT1TMRH), 3
// SMT1TMRH<SMT1TMR12>
extern volatile __bit                   SMT1TMR12           __at(0x1F89C);	// @ (0x3F13 * 8 + 4)
#define                                 SMT1TMR12_bit       BANKMASK(SMT1TMRH), 4
// SMT1TMRH<SMT1TMR13>
extern volatile __bit                   SMT1TMR13           __at(0x1F89D);	// @ (0x3F13 * 8 + 5)
#define                                 SMT1TMR13_bit       BANKMASK(SMT1TMRH), 5
// SMT1TMRH<SMT1TMR14>
extern volatile __bit                   SMT1TMR14           __at(0x1F89E);	// @ (0x3F13 * 8 + 6)
#define                                 SMT1TMR14_bit       BANKMASK(SMT1TMRH), 6
// SMT1TMRH<SMT1TMR15>
extern volatile __bit                   SMT1TMR15           __at(0x1F89F);	// @ (0x3F13 * 8 + 7)
#define                                 SMT1TMR15_bit       BANKMASK(SMT1TMRH), 7
// SMT1TMRU<SMT1TMR16>
extern volatile __bit                   SMT1TMR16           __at(0x1F8A0);	// @ (0x3F14 * 8 + 0)
#define                                 SMT1TMR16_bit       BANKMASK(SMT1TMRU), 0
// SMT1TMRU<SMT1TMR17>
extern volatile __bit                   SMT1TMR17           __at(0x1F8A1);	// @ (0x3F14 * 8 + 1)
#define                                 SMT1TMR17_bit       BANKMASK(SMT1TMRU), 1
// SMT1TMRU<SMT1TMR18>
extern volatile __bit                   SMT1TMR18           __at(0x1F8A2);	// @ (0x3F14 * 8 + 2)
#define                                 SMT1TMR18_bit       BANKMASK(SMT1TMRU), 2
// SMT1TMRU<SMT1TMR19>
extern volatile __bit                   SMT1TMR19           __at(0x1F8A3);	// @ (0x3F14 * 8 + 3)
#define                                 SMT1TMR19_bit       BANKMASK(SMT1TMRU), 3
// SMT1TMRL<SMT1TMR2>
extern volatile __bit                   SMT1TMR2            __at(0x1F892);	// @ (0x3F12 * 8 + 2)
#define                                 SMT1TMR2_bit        BANKMASK(SMT1TMRL), 2
// SMT1TMRU<SMT1TMR20>
extern volatile __bit                   SMT1TMR20           __at(0x1F8A4);	// @ (0x3F14 * 8 + 4)
#define                                 SMT1TMR20_bit       BANKMASK(SMT1TMRU), 4
// SMT1TMRU<SMT1TMR21>
extern volatile __bit                   SMT1TMR21           __at(0x1F8A5);	// @ (0x3F14 * 8 + 5)
#define                                 SMT1TMR21_bit       BANKMASK(SMT1TMRU), 5
// SMT1TMRU<SMT1TMR22>
extern volatile __bit                   SMT1TMR22           __at(0x1F8A6);	// @ (0x3F14 * 8 + 6)
#define                                 SMT1TMR22_bit       BANKMASK(SMT1TMRU), 6
// SMT1TMRU<SMT1TMR23>
extern volatile __bit                   SMT1TMR23           __at(0x1F8A7);	// @ (0x3F14 * 8 + 7)
#define                                 SMT1TMR23_bit       BANKMASK(SMT1TMRU), 7
// SMT1TMRL<SMT1TMR3>
extern volatile __bit                   SMT1TMR3            __at(0x1F893);	// @ (0x3F12 * 8 + 3)
#define                                 SMT1TMR3_bit        BANKMASK(SMT1TMRL), 3
// SMT1TMRL<SMT1TMR4>
extern volatile __bit                   SMT1TMR4            __at(0x1F894);	// @ (0x3F12 * 8 + 4)
#define                                 SMT1TMR4_bit        BANKMASK(SMT1TMRL), 4
// SMT1TMRL<SMT1TMR5>
extern volatile __bit                   SMT1TMR5            __at(0x1F895);	// @ (0x3F12 * 8 + 5)
#define                                 SMT1TMR5_bit        BANKMASK(SMT1TMRL), 5
// SMT1TMRL<SMT1TMR6>
extern volatile __bit                   SMT1TMR6            __at(0x1F896);	// @ (0x3F12 * 8 + 6)
#define                                 SMT1TMR6_bit        BANKMASK(SMT1TMRL), 6
// SMT1TMRL<SMT1TMR7>
extern volatile __bit                   SMT1TMR7            __at(0x1F897);	// @ (0x3F12 * 8 + 7)
#define                                 SMT1TMR7_bit        BANKMASK(SMT1TMRL), 7
// SMT1TMRH<SMT1TMR8>
extern volatile __bit                   SMT1TMR8            __at(0x1F898);	// @ (0x3F13 * 8 + 0)
#define                                 SMT1TMR8_bit        BANKMASK(SMT1TMRH), 0
// SMT1TMRH<SMT1TMR9>
extern volatile __bit                   SMT1TMR9            __at(0x1F899);	// @ (0x3F13 * 8 + 1)
#define                                 SMT1TMR9_bit        BANKMASK(SMT1TMRH), 1
// SMT1STAT<SMT1TS>
extern volatile __bit                   SMT1TS              __at(0x1F902);	// @ (0x3F20 * 8 + 2)
#define                                 SMT1TS_bit          BANKMASK(SMT1STAT), 2
// SMT1CON0<SMT1WOL>
extern volatile __bit                   SMT1WOL             __at(0x1F8F4);	// @ (0x3F1E * 8 + 4)
#define                                 SMT1WOL_bit         BANKMASK(SMT1CON0), 4
// SMT1STAT<SMT1WS>
extern volatile __bit                   SMT1WS              __at(0x1F901);	// @ (0x3F20 * 8 + 1)
#define                                 SMT1WS_bit          BANKMASK(SMT1STAT), 1
// SMT1WIN<SMT1WSEL0>
extern volatile __bit                   SMT1WSEL0           __at(0x1F918);	// @ (0x3F23 * 8 + 0)
#define                                 SMT1WSEL0_bit       BANKMASK(SMT1WIN), 0
// SMT1WIN<SMT1WSEL1>
extern volatile __bit                   SMT1WSEL1           __at(0x1F919);	// @ (0x3F23 * 8 + 1)
#define                                 SMT1WSEL1_bit       BANKMASK(SMT1WIN), 1
// SMT1WIN<SMT1WSEL2>
extern volatile __bit                   SMT1WSEL2           __at(0x1F91A);	// @ (0x3F23 * 8 + 2)
#define                                 SMT1WSEL2_bit       BANKMASK(SMT1WIN), 2
// SMT1WIN<SMT1WSEL3>
extern volatile __bit                   SMT1WSEL3           __at(0x1F91B);	// @ (0x3F23 * 8 + 3)
#define                                 SMT1WSEL3_bit       BANKMASK(SMT1WIN), 3
// SMT1WIN<SMT1WSEL4>
extern volatile __bit                   SMT1WSEL4           __at(0x1F91C);	// @ (0x3F23 * 8 + 4)
#define                                 SMT1WSEL4_bit       BANKMASK(SMT1WIN), 4
// ADCON3<SOI>
extern volatile __bit                   SOI                 __at(0x1F7DB);	// @ (0x3EFB * 8 + 3)
#define                                 SOI_bit             BANKMASK(ADCON3), 3
// OSCSTAT<SOR>
extern volatile __bit                   SOR                 __at(0x1CEE3);	// @ (0x39DC * 8 + 3)
#define                                 SOR_bit             BANKMASK(OSCSTAT), 3
// OSCEN<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x1CEEB);	// @ (0x39DD * 8 + 3)
#define                                 SOSCEN_bit          BANKMASK(OSCEN), 3
// OSCCON3<SOSCPWR>
extern volatile __bit                   SOSCPWR             __at(0x1CEDE);	// @ (0x39DB * 8 + 6)
#define                                 SOSCPWR_bit         BANKMASK(OSCCON3), 6
// SPI1INTE<SOSIE>
extern volatile __bit                   SOSIE               __at(0x1E8DD);	// @ (0x3D1B * 8 + 5)
#define                                 SOSIE_bit           BANKMASK(SPI1INTE), 5
// SPI1INTF<SOSIF>
extern volatile __bit                   SOSIF               __at(0x1E8D5);	// @ (0x3D1A * 8 + 5)
#define                                 SOSIF_bit           BANKMASK(SPI1INTF), 5
// STKPTR<SP0>
extern volatile __bit                   SP0                 __at(0x1FFE0);	// @ (0x3FFC * 8 + 0)
#define                                 SP0_bit             BANKMASK(STKPTR), 0
// STKPTR<SP1>
extern volatile __bit                   SP1                 __at(0x1FFE1);	// @ (0x3FFC * 8 + 1)
#define                                 SP1_bit             BANKMASK(STKPTR), 1
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x1FFE2);	// @ (0x3FFC * 8 + 2)
#define                                 SP2_bit             BANKMASK(STKPTR), 2
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x1FFE3);	// @ (0x3FFC * 8 + 3)
#define                                 SP3_bit             BANKMASK(STKPTR), 3
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x1FFE4);	// @ (0x3FFC * 8 + 4)
#define                                 SP4_bit             BANKMASK(STKPTR), 4
// SPI1CON0<SPI1BMODE>
extern volatile __bit                   SPI1BMODE           __at(0x1E8A0);	// @ (0x3D14 * 8 + 0)
#define                                 SPI1BMODE_bit       BANKMASK(SPI1CON0), 0
// SPI1CON2<SPI1BUSY>
extern volatile __bit                   SPI1BUSY            __at(0x1E8B7);	// @ (0x3D16 * 8 + 7)
#define                                 SPI1BUSY_bit        BANKMASK(SPI1CON2), 7
// SPI1CON1<SPI1CKE>
extern volatile __bit                   SPI1CKE             __at(0x1E8AE);	// @ (0x3D15 * 8 + 6)
#define                                 SPI1CKE_bit         BANKMASK(SPI1CON1), 6
// SPI1CON1<SPI1CKP>
extern volatile __bit                   SPI1CKP             __at(0x1E8AD);	// @ (0x3D15 * 8 + 5)
#define                                 SPI1CKP_bit         BANKMASK(SPI1CON1), 5
// SPI1CLK<SPI1CLKSEL0>
extern volatile __bit                   SPI1CLKSEL0         __at(0x1E8E0);	// @ (0x3D1C * 8 + 0)
#define                                 SPI1CLKSEL0_bit     BANKMASK(SPI1CLK), 0
// SPI1CLK<SPI1CLKSEL1>
extern volatile __bit                   SPI1CLKSEL1         __at(0x1E8E1);	// @ (0x3D1C * 8 + 1)
#define                                 SPI1CLKSEL1_bit     BANKMASK(SPI1CLK), 1
// SPI1CLK<SPI1CLKSEL2>
extern volatile __bit                   SPI1CLKSEL2         __at(0x1E8E2);	// @ (0x3D1C * 8 + 2)
#define                                 SPI1CLKSEL2_bit     BANKMASK(SPI1CLK), 2
// SPI1STATUS<SPI1CLRBF>
extern volatile __bit                   SPI1CLRBF           __at(0x1E8BA);	// @ (0x3D17 * 8 + 2)
#define                                 SPI1CLRBF_bit       BANKMASK(SPI1STATUS), 2
// SPI1INTE<SPI1EOSIE>
extern volatile __bit                   SPI1EOSIE           __at(0x1E8DC);	// @ (0x3D1B * 8 + 4)
#define                                 SPI1EOSIE_bit       BANKMASK(SPI1INTE), 4
// SPI1INTF<SPI1EOSIF>
extern volatile __bit                   SPI1EOSIF           __at(0x1E8D4);	// @ (0x3D1A * 8 + 4)
#define                                 SPI1EOSIF_bit       BANKMASK(SPI1INTF), 4
// SPI1CON1<SPI1FST>
extern volatile __bit                   SPI1FST             __at(0x1E8AC);	// @ (0x3D15 * 8 + 4)
#define                                 SPI1FST_bit         BANKMASK(SPI1CON1), 4
// PIE2<SPI1IE>
extern volatile __bit                   SPI1IE              __at(0x1CC96);	// @ (0x3992 * 8 + 6)
#define                                 SPI1IE_bit          BANKMASK(PIE2), 6
// PIR2<SPI1IF>
extern volatile __bit                   SPI1IF              __at(0x1CD16);	// @ (0x39A2 * 8 + 6)
#define                                 SPI1IF_bit          BANKMASK(PIR2), 6
// IPR2<SPI1IP>
extern volatile __bit                   SPI1IP              __at(0x1CC16);	// @ (0x3982 * 8 + 6)
#define                                 SPI1IP_bit          BANKMASK(IPR2), 6
// SPI1CON0<SPI1LSBF>
extern volatile __bit                   SPI1LSBF            __at(0x1E8A2);	// @ (0x3D14 * 8 + 2)
#define                                 SPI1LSBF_bit        BANKMASK(SPI1CON0), 2
// SPI1CON0<SPI1MST>
extern volatile __bit                   SPI1MST             __at(0x1E8A1);	// @ (0x3D14 * 8 + 1)
#define                                 SPI1MST_bit         BANKMASK(SPI1CON0), 1
// SPI1STATUS<SPI1RXBF>
extern volatile __bit                   SPI1RXBF            __at(0x1E8B8);	// @ (0x3D17 * 8 + 0)
#define                                 SPI1RXBF_bit        BANKMASK(SPI1STATUS), 0
// PIE2<SPI1RXIE>
extern volatile __bit                   SPI1RXIE            __at(0x1CC94);	// @ (0x3992 * 8 + 4)
#define                                 SPI1RXIE_bit        BANKMASK(PIE2), 4
// PIR2<SPI1RXIF>
extern volatile __bit                   SPI1RXIF            __at(0x1CD14);	// @ (0x39A2 * 8 + 4)
#define                                 SPI1RXIF_bit        BANKMASK(PIR2), 4
// IPR2<SPI1RXIP>
extern volatile __bit                   SPI1RXIP            __at(0x1CC14);	// @ (0x3982 * 8 + 4)
#define                                 SPI1RXIP_bit        BANKMASK(IPR2), 4
// SPI1INTE<SPI1RXOIE>
extern volatile __bit                   SPI1RXOIE           __at(0x1E8DA);	// @ (0x3D1B * 8 + 2)
#define                                 SPI1RXOIE_bit       BANKMASK(SPI1INTE), 2
// SPI1INTF<SPI1RXOIF>
extern volatile __bit                   SPI1RXOIF           __at(0x1E8D2);	// @ (0x3D1A * 8 + 2)
#define                                 SPI1RXOIF_bit       BANKMASK(SPI1INTF), 2
// SPI1CON2<SPI1RXR>
extern volatile __bit                   SPI1RXR             __at(0x1E8B0);	// @ (0x3D16 * 8 + 0)
#define                                 SPI1RXR_bit         BANKMASK(SPI1CON2), 0
// SPI1STATUS<SPI1RXRE>
extern volatile __bit                   SPI1RXRE            __at(0x1E8BB);	// @ (0x3D17 * 8 + 3)
#define                                 SPI1RXRE_bit        BANKMASK(SPI1STATUS), 3
// SPI1CON1<SPI1SDIP>
extern volatile __bit                   SPI1SDIP            __at(0x1E8A9);	// @ (0x3D15 * 8 + 1)
#define                                 SPI1SDIP_bit        BANKMASK(SPI1CON1), 1
// SPI1CON1<SPI1SDOP>
extern volatile __bit                   SPI1SDOP            __at(0x1E8A8);	// @ (0x3D15 * 8 + 0)
#define                                 SPI1SDOP_bit        BANKMASK(SPI1CON1), 0
// SPI1CON1<SPI1SMP>
extern volatile __bit                   SPI1SMP             __at(0x1E8AF);	// @ (0x3D15 * 8 + 7)
#define                                 SPI1SMP_bit         BANKMASK(SPI1CON1), 7
// SPI1INTE<SPI1SOSIE>
extern volatile __bit                   SPI1SOSIE           __at(0x1E8DD);	// @ (0x3D1B * 8 + 5)
#define                                 SPI1SOSIE_bit       BANKMASK(SPI1INTE), 5
// SPI1INTF<SPI1SOSIF>
extern volatile __bit                   SPI1SOSIF           __at(0x1E8D5);	// @ (0x3D1A * 8 + 5)
#define                                 SPI1SOSIF_bit       BANKMASK(SPI1INTF), 5
// SPI1CON0<SPI1SPIEN>
extern volatile __bit                   SPI1SPIEN           __at(0x1E8A7);	// @ (0x3D14 * 8 + 7)
#define                                 SPI1SPIEN_bit       BANKMASK(SPI1CON0), 7
// SPI1INTE<SPI1SRMTIE>
extern volatile __bit                   SPI1SRMTIE          __at(0x1E8DF);	// @ (0x3D1B * 8 + 7)
#define                                 SPI1SRMTIE_bit      BANKMASK(SPI1INTE), 7
// SPI1INTF<SPI1SRMTIF>
extern volatile __bit                   SPI1SRMTIF          __at(0x1E8D7);	// @ (0x3D1A * 8 + 7)
#define                                 SPI1SRMTIF_bit      BANKMASK(SPI1INTF), 7
// SPI1CON2<SPI1SSET>
extern volatile __bit                   SPI1SSET            __at(0x1E8B2);	// @ (0x3D16 * 8 + 2)
#define                                 SPI1SSET_bit        BANKMASK(SPI1CON2), 2
// SPI1CON2<SPI1SSFLT>
extern volatile __bit                   SPI1SSFLT           __at(0x1E8B6);	// @ (0x3D16 * 8 + 6)
#define                                 SPI1SSFLT_bit       BANKMASK(SPI1CON2), 6
// SPI1CON1<SPI1SSP>
extern volatile __bit                   SPI1SSP             __at(0x1E8AA);	// @ (0x3D15 * 8 + 2)
#define                                 SPI1SSP_bit         BANKMASK(SPI1CON1), 2
// SPI1INTE<SPI1TCZIE>
extern volatile __bit                   SPI1TCZIE           __at(0x1E8DE);	// @ (0x3D1B * 8 + 6)
#define                                 SPI1TCZIE_bit       BANKMASK(SPI1INTE), 6
// SPI1INTF<SPI1TCZIF>
extern volatile __bit                   SPI1TCZIF           __at(0x1E8D6);	// @ (0x3D1A * 8 + 6)
#define                                 SPI1TCZIF_bit       BANKMASK(SPI1INTF), 6
// SPI1STATUS<SPI1TXBE>
extern volatile __bit                   SPI1TXBE            __at(0x1E8BD);	// @ (0x3D17 * 8 + 5)
#define                                 SPI1TXBE_bit        BANKMASK(SPI1STATUS), 5
// PIE2<SPI1TXIE>
extern volatile __bit                   SPI1TXIE            __at(0x1CC95);	// @ (0x3992 * 8 + 5)
#define                                 SPI1TXIE_bit        BANKMASK(PIE2), 5
// PIR2<SPI1TXIF>
extern volatile __bit                   SPI1TXIF            __at(0x1CD15);	// @ (0x39A2 * 8 + 5)
#define                                 SPI1TXIF_bit        BANKMASK(PIR2), 5
// IPR2<SPI1TXIP>
extern volatile __bit                   SPI1TXIP            __at(0x1CC15);	// @ (0x3982 * 8 + 5)
#define                                 SPI1TXIP_bit        BANKMASK(IPR2), 5
// SPI1CON2<SPI1TXR>
extern volatile __bit                   SPI1TXR             __at(0x1E8B1);	// @ (0x3D16 * 8 + 1)
#define                                 SPI1TXR_bit         BANKMASK(SPI1CON2), 1
// SPI1INTE<SPI1TXUIE>
extern volatile __bit                   SPI1TXUIE           __at(0x1E8D9);	// @ (0x3D1B * 8 + 1)
#define                                 SPI1TXUIE_bit       BANKMASK(SPI1INTE), 1
// SPI1INTF<SPI1TXUIF>
extern volatile __bit                   SPI1TXUIF           __at(0x1E8D1);	// @ (0x3D1A * 8 + 1)
#define                                 SPI1TXUIF_bit       BANKMASK(SPI1INTF), 1
// SPI1STATUS<SPI1TXWE>
extern volatile __bit                   SPI1TXWE            __at(0x1E8BF);	// @ (0x3D17 * 8 + 7)
#define                                 SPI1TXWE_bit        BANKMASK(SPI1STATUS), 7
// PMD0<SPI2MD>
extern volatile __bit                   SPI2MD              __at(0x1CE02);	// @ (0x39C0 * 8 + 2)
#define                                 SPI2MD_bit          BANKMASK(PMD0), 2
// SMT1CON0<SPOL>
extern volatile __bit                   SPOL                __at(0x1F8F3);	// @ (0x3F1E * 8 + 3)
#define                                 SPOL_bit            BANKMASK(SMT1CON0), 3
// SPI1INTE<SRMTIE>
extern volatile __bit                   SRMTIE              __at(0x1E8DF);	// @ (0x3D1B * 8 + 7)
#define                                 SRMTIE_bit          BANKMASK(SPI1INTE), 7
// SPI1INTF<SRMTIF>
extern volatile __bit                   SRMTIF              __at(0x1E8D7);	// @ (0x3D1A * 8 + 7)
#define                                 SRMTIF_bit          BANKMASK(SPI1INTF), 7
// SMT1SIG<SSEL0>
extern volatile __bit                   SSEL0               __at(0x1F910);	// @ (0x3F22 * 8 + 0)
#define                                 SSEL0_bit           BANKMASK(SMT1SIG), 0
// SMT1SIG<SSEL1>
extern volatile __bit                   SSEL1               __at(0x1F911);	// @ (0x3F22 * 8 + 1)
#define                                 SSEL1_bit           BANKMASK(SMT1SIG), 1
// SMT1SIG<SSEL2>
extern volatile __bit                   SSEL2               __at(0x1F912);	// @ (0x3F22 * 8 + 2)
#define                                 SSEL2_bit           BANKMASK(SMT1SIG), 2
// SMT1SIG<SSEL3>
extern volatile __bit                   SSEL3               __at(0x1F913);	// @ (0x3F22 * 8 + 3)
#define                                 SSEL3_bit           BANKMASK(SMT1SIG), 3
// SMT1SIG<SSEL4>
extern volatile __bit                   SSEL4               __at(0x1F914);	// @ (0x3F22 * 8 + 4)
#define                                 SSEL4_bit           BANKMASK(SMT1SIG), 4
// SPI1CON2<SSET>
extern volatile __bit                   SSET                __at(0x1E8B2);	// @ (0x3D16 * 8 + 2)
#define                                 SSET_bit            BANKMASK(SPI1CON2), 2
// SPI1CON2<SSFLT>
extern volatile __bit                   SSFLT               __at(0x1E8B6);	// @ (0x3D16 * 8 + 6)
#define                                 SSFLT_bit           BANKMASK(SPI1CON2), 6
// SPI1CON1<SSP>
extern volatile __bit                   SSP                 __at(0x1E8AA);	// @ (0x3D15 * 8 + 2)
#define                                 SSP_bit             BANKMASK(SPI1CON1), 2
// ADSTAT<STAT2>
extern volatile __bit                   STAT2               __at(0x1F7E2);	// @ (0x3EFC * 8 + 2)
#define                                 STAT2_bit           BANKMASK(ADSTAT), 2
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x1CAFA);	// @ (0x395F * 8 + 2)
#define                                 STATE_bit           BANKMASK(WDTTMR), 2
// PCON0<STKOVF>
extern volatile __bit                   STKOVF              __at(0x1FF87);	// @ (0x3FF0 * 8 + 7)
#define                                 STKOVF_bit          BANKMASK(PCON0), 7
// STKPTR<STKPTR0>
extern volatile __bit                   STKPTR0             __at(0x1FFE0);	// @ (0x3FFC * 8 + 0)
#define                                 STKPTR0_bit         BANKMASK(STKPTR), 0
// STKPTR<STKPTR1>
extern volatile __bit                   STKPTR1             __at(0x1FFE1);	// @ (0x3FFC * 8 + 1)
#define                                 STKPTR1_bit         BANKMASK(STKPTR), 1
// STKPTR<STKPTR2>
extern volatile __bit                   STKPTR2             __at(0x1FFE2);	// @ (0x3FFC * 8 + 2)
#define                                 STKPTR2_bit         BANKMASK(STKPTR), 2
// STKPTR<STKPTR3>
extern volatile __bit                   STKPTR3             __at(0x1FFE3);	// @ (0x3FFC * 8 + 3)
#define                                 STKPTR3_bit         BANKMASK(STKPTR), 3
// STKPTR<STKPTR4>
extern volatile __bit                   STKPTR4             __at(0x1FFE4);	// @ (0x3FFC * 8 + 4)
#define                                 STKPTR4_bit         BANKMASK(STKPTR), 4
// PCON0<STKUNF>
extern volatile __bit                   STKUNF              __at(0x1FF86);	// @ (0x3FF0 * 8 + 6)
#define                                 STKUNF_bit          BANKMASK(PCON0), 6
// SMT1CON0<STP>
extern volatile __bit                   STP                 __at(0x1F8F5);	// @ (0x3F1E * 8 + 5)
#define                                 STP_bit             BANKMASK(SMT1CON0), 5
// ADSTPTL<STPT0>
extern volatile __bit                   STPT0               __at(0x1F720);	// @ (0x3EE4 * 8 + 0)
#define                                 STPT0_bit           BANKMASK(ADSTPTL), 0
// ADSTPTL<STPT1>
extern volatile __bit                   STPT1               __at(0x1F721);	// @ (0x3EE4 * 8 + 1)
#define                                 STPT1_bit           BANKMASK(ADSTPTL), 1
// ADSTPTH<STPT10>
extern volatile __bit                   STPT10              __at(0x1F72A);	// @ (0x3EE5 * 8 + 2)
#define                                 STPT10_bit          BANKMASK(ADSTPTH), 2
// ADSTPTH<STPT11>
extern volatile __bit                   STPT11              __at(0x1F72B);	// @ (0x3EE5 * 8 + 3)
#define                                 STPT11_bit          BANKMASK(ADSTPTH), 3
// ADSTPTH<STPT12>
extern volatile __bit                   STPT12              __at(0x1F72C);	// @ (0x3EE5 * 8 + 4)
#define                                 STPT12_bit          BANKMASK(ADSTPTH), 4
// ADSTPTH<STPT13>
extern volatile __bit                   STPT13              __at(0x1F72D);	// @ (0x3EE5 * 8 + 5)
#define                                 STPT13_bit          BANKMASK(ADSTPTH), 5
// ADSTPTH<STPT15>
