LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   STPT15              __at(0x1F72E);	// @ (0x3EE5 * 8 + 6)
#define                                 STPT15_bit          BANKMASK(ADSTPTH), 6
// ADSTPTH<STPT16>
extern volatile __bit                   STPT16              __at(0x1F72F);	// @ (0x3EE5 * 8 + 7)
#define                                 STPT16_bit          BANKMASK(ADSTPTH), 7
// ADSTPTL<STPT2>
extern volatile __bit                   STPT2               __at(0x1F722);	// @ (0x3EE4 * 8 + 2)
#define                                 STPT2_bit           BANKMASK(ADSTPTL), 2
// ADSTPTL<STPT3>
extern volatile __bit                   STPT3               __at(0x1F723);	// @ (0x3EE4 * 8 + 3)
#define                                 STPT3_bit           BANKMASK(ADSTPTL), 3
// ADSTPTL<STPT4>
extern volatile __bit                   STPT4               __at(0x1F724);	// @ (0x3EE4 * 8 + 4)
#define                                 STPT4_bit           BANKMASK(ADSTPTL), 4
// ADSTPTL<STPT5>
extern volatile __bit                   STPT5               __at(0x1F725);	// @ (0x3EE4 * 8 + 5)
#define                                 STPT5_bit           BANKMASK(ADSTPTL), 5
// ADSTPTL<STPT6>
extern volatile __bit                   STPT6               __at(0x1F726);	// @ (0x3EE4 * 8 + 6)
#define                                 STPT6_bit           BANKMASK(ADSTPTL), 6
// ADSTPTL<STPT7>
extern volatile __bit                   STPT7               __at(0x1F727);	// @ (0x3EE4 * 8 + 7)
#define                                 STPT7_bit           BANKMASK(ADSTPTL), 7
// ADSTPTH<STPT8>
extern volatile __bit                   STPT8               __at(0x1F728);	// @ (0x3EE5 * 8 + 0)
#define                                 STPT8_bit           BANKMASK(ADSTPTH), 0
// ADSTPTH<STPT9>
extern volatile __bit                   STPT9               __at(0x1F729);	// @ (0x3EE5 * 8 + 1)
#define                                 STPT9_bit           BANKMASK(ADSTPTH), 1
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x1CAD8);	// @ (0x395B * 8 + 0)
#define                                 SWDTEN_bit          BANKMASK(WDTCON0), 0
// PIE0<SWIE>
extern volatile __bit                   SWIE                __at(0x1CC80);	// @ (0x3990 * 8 + 0)
#define                                 SWIE_bit            BANKMASK(PIE0), 0
// PIR0<SWIF>
extern volatile __bit                   SWIF                __at(0x1CD00);	// @ (0x39A0 * 8 + 0)
#define                                 SWIF_bit            BANKMASK(PIR0), 0
// IPR0<SWIP>
extern volatile __bit                   SWIP                __at(0x1CC00);	// @ (0x3980 * 8 + 0)
#define                                 SWIP_bit            BANKMASK(IPR0), 0
// PMD0<SYSCMD>
extern volatile __bit                   SYSCMD              __at(0x1CE07);	// @ (0x39C0 * 8 + 7)
#define                                 SYSCMD_bit          BANKMASK(PMD0), 7
// T0CON0<T016BIT>
extern volatile __bit                   T016BIT             __at(0x1FDC4);	// @ (0x3FB8 * 8 + 4)
#define                                 T016BIT_bit         BANKMASK(T0CON0), 4
// T0CON1<T0ASYNC>
extern volatile __bit                   T0ASYNC             __at(0x1FDCC);	// @ (0x3FB9 * 8 + 4)
#define                                 T0ASYNC_bit         BANKMASK(T0CON1), 4
// T0CON1<T0CKPS0>
extern volatile __bit                   T0CKPS0             __at(0x1FDC8);	// @ (0x3FB9 * 8 + 0)
#define                                 T0CKPS0_bit         BANKMASK(T0CON1), 0
// T0CON1<T0CKPS1>
extern volatile __bit                   T0CKPS1             __at(0x1FDC9);	// @ (0x3FB9 * 8 + 1)
#define                                 T0CKPS1_bit         BANKMASK(T0CON1), 1
// T0CON1<T0CKPS2>
extern volatile __bit                   T0CKPS2             __at(0x1FDCA);	// @ (0x3FB9 * 8 + 2)
#define                                 T0CKPS2_bit         BANKMASK(T0CON1), 2
// T0CON1<T0CKPS3>
extern volatile __bit                   T0CKPS3             __at(0x1FDCB);	// @ (0x3FB9 * 8 + 3)
#define                                 T0CKPS3_bit         BANKMASK(T0CON1), 3
// T0CON1<T0CS0>
extern volatile __bit                   T0CS0               __at(0x1FDCD);	// @ (0x3FB9 * 8 + 5)
#define                                 T0CS0_bit           BANKMASK(T0CON1), 5
// T0CON1<T0CS1>
extern volatile __bit                   T0CS1               __at(0x1FDCE);	// @ (0x3FB9 * 8 + 6)
#define                                 T0CS1_bit           BANKMASK(T0CON1), 6
// T0CON1<T0CS2>
extern volatile __bit                   T0CS2               __at(0x1FDCF);	// @ (0x3FB9 * 8 + 7)
#define                                 T0CS2_bit           BANKMASK(T0CON1), 7
// T0CON0<T0EN>
extern volatile __bit                   T0EN                __at(0x1FDC7);	// @ (0x3FB8 * 8 + 7)
#define                                 T0EN_bit            BANKMASK(T0CON0), 7
// T0CON0<T0MD16>
extern volatile __bit                   T0MD16              __at(0x1FDC4);	// @ (0x3FB8 * 8 + 4)
#define                                 T0MD16_bit          BANKMASK(T0CON0), 4
// T0CON0<T0OUT>
extern volatile __bit                   T0OUT               __at(0x1FDC5);	// @ (0x3FB8 * 8 + 5)
#define                                 T0OUT_bit           BANKMASK(T0CON0), 5
// TMR0H<T0PR0>
extern volatile __bit                   T0PR0               __at(0x1FDB8);	// @ (0x3FB7 * 8 + 0)
#define                                 T0PR0_bit           BANKMASK(TMR0H), 0
// TMR0H<T0PR1>
extern volatile __bit                   T0PR1               __at(0x1FDB9);	// @ (0x3FB7 * 8 + 1)
#define                                 T0PR1_bit           BANKMASK(TMR0H), 1
// TMR0H<T0PR2>
extern volatile __bit                   T0PR2               __at(0x1FDBA);	// @ (0x3FB7 * 8 + 2)
#define                                 T0PR2_bit           BANKMASK(TMR0H), 2
// TMR0H<T0PR3>
extern volatile __bit                   T0PR3               __at(0x1FDBB);	// @ (0x3FB7 * 8 + 3)
#define                                 T0PR3_bit           BANKMASK(TMR0H), 3
// TMR0H<T0PR4>
extern volatile __bit                   T0PR4               __at(0x1FDBC);	// @ (0x3FB7 * 8 + 4)
#define                                 T0PR4_bit           BANKMASK(TMR0H), 4
// TMR0H<T0PR5>
extern volatile __bit                   T0PR5               __at(0x1FDBD);	// @ (0x3FB7 * 8 + 5)
#define                                 T0PR5_bit           BANKMASK(TMR0H), 5
// TMR0H<T0PR6>
extern volatile __bit                   T0PR6               __at(0x1FDBE);	// @ (0x3FB7 * 8 + 6)
#define                                 T0PR6_bit           BANKMASK(TMR0H), 6
// TMR0H<T0PR7>
extern volatile __bit                   T0PR7               __at(0x1FDBF);	// @ (0x3FB7 * 8 + 7)
#define                                 T0PR7_bit           BANKMASK(TMR0H), 7
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0x1FD94);	// @ (0x3FB2 * 8 + 4)
#define                                 T1CKPS0_bit         BANKMASK(T1CON), 4
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0x1FD95);	// @ (0x3FB2 * 8 + 5)
#define                                 T1CKPS1_bit         BANKMASK(T1CON), 5
// T1CLK<T1CS0>
extern volatile __bit                   T1CS0               __at(0x1FDA8);	// @ (0x3FB5 * 8 + 0)
#define                                 T1CS0_bit           BANKMASK(T1CLK), 0
// T1CLK<T1CS1>
extern volatile __bit                   T1CS1               __at(0x1FDA9);	// @ (0x3FB5 * 8 + 1)
#define                                 T1CS1_bit           BANKMASK(T1CLK), 1
// T1CLK<T1CS2>
extern volatile __bit                   T1CS2               __at(0x1FDAA);	// @ (0x3FB5 * 8 + 2)
#define                                 T1CS2_bit           BANKMASK(T1CLK), 2
// T1CLK<T1CS3>
extern volatile __bit                   T1CS3               __at(0x1FDAB);	// @ (0x3FB5 * 8 + 3)
#define                                 T1CS3_bit           BANKMASK(T1CLK), 3
// T1CLK<T1CS4>
extern volatile __bit                   T1CS4               __at(0x1FDAC);	// @ (0x3FB5 * 8 + 4)
#define                                 T1CS4_bit           BANKMASK(T1CLK), 4
// T1GCON<T1GE>
extern volatile __bit                   T1GE                __at(0x1FD9F);	// @ (0x3FB3 * 8 + 7)
#define                                 T1GE_bit            BANKMASK(T1GCON), 7
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0x1FD9B);	// @ (0x3FB3 * 8 + 3)
#define                                 T1GGO_bit           BANKMASK(T1GCON), 3
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0x1FD9E);	// @ (0x3FB3 * 8 + 6)
#define                                 T1GPOL_bit          BANKMASK(T1GCON), 6
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0x1FD9C);	// @ (0x3FB3 * 8 + 4)
#define                                 T1GSPM_bit          BANKMASK(T1GCON), 4
// T1GATE<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0x1FDA0);	// @ (0x3FB4 * 8 + 0)
#define                                 T1GSS0_bit          BANKMASK(T1GATE), 0
// T1GATE<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0x1FDA1);	// @ (0x3FB4 * 8 + 1)
#define                                 T1GSS1_bit          BANKMASK(T1GATE), 1
// T1GATE<T1GSS2>
extern volatile __bit                   T1GSS2              __at(0x1FDA2);	// @ (0x3FB4 * 8 + 2)
#define                                 T1GSS2_bit          BANKMASK(T1GATE), 2
// T1GATE<T1GSS3>
extern volatile __bit                   T1GSS3              __at(0x1FDA3);	// @ (0x3FB4 * 8 + 3)
#define                                 T1GSS3_bit          BANKMASK(T1GATE), 3
// T1GATE<T1GSS4>
extern volatile __bit                   T1GSS4              __at(0x1FDA4);	// @ (0x3FB4 * 8 + 4)
#define                                 T1GSS4_bit          BANKMASK(T1GATE), 4
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0x1FD9D);	// @ (0x3FB3 * 8 + 5)
#define                                 T1GTM_bit           BANKMASK(T1GCON), 5
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0x1FD9A);	// @ (0x3FB3 * 8 + 2)
#define                                 T1GVAL_bit          BANKMASK(T1GCON), 2
// T1CON<T1RD16>
extern volatile __bit                   T1RD16              __at(0x1FD91);	// @ (0x3FB2 * 8 + 1)
#define                                 T1RD16_bit          BANKMASK(T1CON), 1
// T2HLT<T2CKPOL>
extern volatile __bit                   T2CKPOL             __at(0x1FD6E);	// @ (0x3FAD * 8 + 6)
#define                                 T2CKPOL_bit         BANKMASK(T2HLT), 6
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0x1FD64);	// @ (0x3FAC * 8 + 4)
#define                                 T2CKPS0_bit         BANKMASK(T2CON), 4
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0x1FD65);	// @ (0x3FAC * 8 + 5)
#define                                 T2CKPS1_bit         BANKMASK(T2CON), 5
// T2CON<T2CKPS2>
extern volatile __bit                   T2CKPS2             __at(0x1FD66);	// @ (0x3FAC * 8 + 6)
#define                                 T2CKPS2_bit         BANKMASK(T2CON), 6
// T2HLT<T2CKSYNC>
extern volatile __bit                   T2CKSYNC            __at(0x1FD6D);	// @ (0x3FAD * 8 + 5)
#define                                 T2CKSYNC_bit        BANKMASK(T2HLT), 5
// T2CLKCON<T2CS0>
extern volatile __bit                   T2CS0               __at(0x1FD70);	// @ (0x3FAE * 8 + 0)
#define                                 T2CS0_bit           BANKMASK(T2CLKCON), 0
// T2CLKCON<T2CS1>
extern volatile __bit                   T2CS1               __at(0x1FD71);	// @ (0x3FAE * 8 + 1)
#define                                 T2CS1_bit           BANKMASK(T2CLKCON), 1
// T2CLKCON<T2CS2>
extern volatile __bit                   T2CS2               __at(0x1FD72);	// @ (0x3FAE * 8 + 2)
#define                                 T2CS2_bit           BANKMASK(T2CLKCON), 2
// T2CLKCON<T2CS3>
extern volatile __bit                   T2CS3               __at(0x1FD73);	// @ (0x3FAE * 8 + 3)
#define                                 T2CS3_bit           BANKMASK(T2CLKCON), 3
// T2HLT<T2MODE0>
extern volatile __bit                   T2MODE0             __at(0x1FD68);	// @ (0x3FAD * 8 + 0)
#define                                 T2MODE0_bit         BANKMASK(T2HLT), 0
// T2HLT<T2MODE1>
extern volatile __bit                   T2MODE1             __at(0x1FD69);	// @ (0x3FAD * 8 + 1)
#define                                 T2MODE1_bit         BANKMASK(T2HLT), 1
// T2HLT<T2MODE2>
extern volatile __bit                   T2MODE2             __at(0x1FD6A);	// @ (0x3FAD * 8 + 2)
#define                                 T2MODE2_bit         BANKMASK(T2HLT), 2
// T2HLT<T2MODE3>
extern volatile __bit                   T2MODE3             __at(0x1FD6B);	// @ (0x3FAD * 8 + 3)
#define                                 T2MODE3_bit         BANKMASK(T2HLT), 3
// T2HLT<T2MODE4>
extern volatile __bit                   T2MODE4             __at(0x1FD6C);	// @ (0x3FAD * 8 + 4)
#define                                 T2MODE4_bit         BANKMASK(T2HLT), 4
// T2CON<T2ON>
extern volatile __bit                   T2ON                __at(0x1FD67);	// @ (0x3FAC * 8 + 7)
#define                                 T2ON_bit            BANKMASK(T2CON), 7
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0x1FD60);	// @ (0x3FAC * 8 + 0)
#define                                 T2OUTPS0_bit        BANKMASK(T2CON), 0
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0x1FD61);	// @ (0x3FAC * 8 + 1)
#define                                 T2OUTPS1_bit        BANKMASK(T2CON), 1
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0x1FD62);	// @ (0x3FAC * 8 + 2)
#define                                 T2OUTPS2_bit        BANKMASK(T2CON), 2
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0x1FD63);	// @ (0x3FAC * 8 + 3)
#define                                 T2OUTPS3_bit        BANKMASK(T2CON), 3
// T2HLT<T2PSYNC>
extern volatile __bit                   T2PSYNC             __at(0x1FD6F);	// @ (0x3FAD * 8 + 7)
#define                                 T2PSYNC_bit         BANKMASK(T2HLT), 7
// T2RST<T2RSEL0>
extern volatile __bit                   T2RSEL0             __at(0x1FD78);	// @ (0x3FAF * 8 + 0)
#define                                 T2RSEL0_bit         BANKMASK(T2RST), 0
// T2RST<T2RSEL1>
extern volatile __bit                   T2RSEL1             __at(0x1FD79);	// @ (0x3FAF * 8 + 1)
#define                                 T2RSEL1_bit         BANKMASK(T2RST), 1
// T2RST<T2RSEL2>
extern volatile __bit                   T2RSEL2             __at(0x1FD7A);	// @ (0x3FAF * 8 + 2)
#define                                 T2RSEL2_bit         BANKMASK(T2RST), 2
// T2RST<T2RSEL3>
extern volatile __bit                   T2RSEL3             __at(0x1FD7B);	// @ (0x3FAF * 8 + 3)
#define                                 T2RSEL3_bit         BANKMASK(T2RST), 3
// T2RST<T2RSEL4>
extern volatile __bit                   T2RSEL4             __at(0x1FD7C);	// @ (0x3FAF * 8 + 4)
#define                                 T2RSEL4_bit         BANKMASK(T2RST), 4
// T3CON<T3CKPS0>
extern volatile __bit                   T3CKPS0             __at(0x1FD34);	// @ (0x3FA6 * 8 + 4)
#define                                 T3CKPS0_bit         BANKMASK(T3CON), 4
// T3CON<T3CKPS1>
extern volatile __bit                   T3CKPS1             __at(0x1FD35);	// @ (0x3FA6 * 8 + 5)
#define                                 T3CKPS1_bit         BANKMASK(T3CON), 5
// T3CLK<T3CS0>
extern volatile __bit                   T3CS0               __at(0x1FD48);	// @ (0x3FA9 * 8 + 0)
#define                                 T3CS0_bit           BANKMASK(T3CLK), 0
// T3CLK<T3CS1>
extern volatile __bit                   T3CS1               __at(0x1FD49);	// @ (0x3FA9 * 8 + 1)
#define                                 T3CS1_bit           BANKMASK(T3CLK), 1
// T3CLK<T3CS2>
extern volatile __bit                   T3CS2               __at(0x1FD4A);	// @ (0x3FA9 * 8 + 2)
#define                                 T3CS2_bit           BANKMASK(T3CLK), 2
// T3CLK<T3CS3>
extern volatile __bit                   T3CS3               __at(0x1FD4B);	// @ (0x3FA9 * 8 + 3)
#define                                 T3CS3_bit           BANKMASK(T3CLK), 3
// T3CLK<T3CS4>
extern volatile __bit                   T3CS4               __at(0x1FD4C);	// @ (0x3FA9 * 8 + 4)
#define                                 T3CS4_bit           BANKMASK(T3CLK), 4
// T3GCON<T3GE>
extern volatile __bit                   T3GE                __at(0x1FD3F);	// @ (0x3FA7 * 8 + 7)
#define                                 T3GE_bit            BANKMASK(T3GCON), 7
// T3GCON<T3GGO>
extern volatile __bit                   T3GGO               __at(0x1FD3B);	// @ (0x3FA7 * 8 + 3)
#define                                 T3GGO_bit           BANKMASK(T3GCON), 3
// T3GCON<T3GPOL>
extern volatile __bit                   T3GPOL              __at(0x1FD3E);	// @ (0x3FA7 * 8 + 6)
#define                                 T3GPOL_bit          BANKMASK(T3GCON), 6
// T3GCON<T3GSPM>
extern volatile __bit                   T3GSPM              __at(0x1FD3C);	// @ (0x3FA7 * 8 + 4)
#define                                 T3GSPM_bit          BANKMASK(T3GCON), 4
// T3GATE<T3GSS0>
extern volatile __bit                   T3GSS0              __at(0x1FD40);	// @ (0x3FA8 * 8 + 0)
#define                                 T3GSS0_bit          BANKMASK(T3GATE), 0
// T3GATE<T3GSS1>
extern volatile __bit                   T3GSS1              __at(0x1FD41);	// @ (0x3FA8 * 8 + 1)
#define                                 T3GSS1_bit          BANKMASK(T3GATE), 1
// T3GATE<T3GSS2>
extern volatile __bit                   T3GSS2              __at(0x1FD42);	// @ (0x3FA8 * 8 + 2)
#define                                 T3GSS2_bit          BANKMASK(T3GATE), 2
// T3GATE<T3GSS3>
extern volatile __bit                   T3GSS3              __at(0x1FD43);	// @ (0x3FA8 * 8 + 3)
#define                                 T3GSS3_bit          BANKMASK(T3GATE), 3
// T3GATE<T3GSS4>
extern volatile __bit                   T3GSS4              __at(0x1FD44);	// @ (0x3FA8 * 8 + 4)
#define                                 T3GSS4_bit          BANKMASK(T3GATE), 4
// T3GCON<T3GTM>
extern volatile __bit                   T3GTM               __at(0x1FD3D);	// @ (0x3FA7 * 8 + 5)
#define                                 T3GTM_bit           BANKMASK(T3GCON), 5
// T3GCON<T3GVAL>
extern volatile __bit                   T3GVAL              __at(0x1FD3A);	// @ (0x3FA7 * 8 + 2)
#define                                 T3GVAL_bit          BANKMASK(T3GCON), 2
// T3CON<T3RD16>
extern volatile __bit                   T3RD16              __at(0x1FD31);	// @ (0x3FA6 * 8 + 1)
#define                                 T3RD16_bit          BANKMASK(T3CON), 1
// T4HLT<T4CKPOL>
extern volatile __bit                   T4CKPOL             __at(0x1FD0E);	// @ (0x3FA1 * 8 + 6)
#define                                 T4CKPOL_bit         BANKMASK(T4HLT), 6
// T4CON<T4CKPS0>
extern volatile __bit                   T4CKPS0             __at(0x1FD04);	// @ (0x3FA0 * 8 + 4)
#define                                 T4CKPS0_bit         BANKMASK(T4CON), 4
// T4CON<T4CKPS1>
extern volatile __bit                   T4CKPS1             __at(0x1FD05);	// @ (0x3FA0 * 8 + 5)
#define                                 T4CKPS1_bit         BANKMASK(T4CON), 5
// T4CON<T4CKPS2>
extern volatile __bit                   T4CKPS2             __at(0x1FD06);	// @ (0x3FA0 * 8 + 6)
#define                                 T4CKPS2_bit         BANKMASK(T4CON), 6
// T4HLT<T4CKSYNC>
extern volatile __bit                   T4CKSYNC            __at(0x1FD0D);	// @ (0x3FA1 * 8 + 5)
#define                                 T4CKSYNC_bit        BANKMASK(T4HLT), 5
// T4CLKCON<T4CS0>
extern volatile __bit                   T4CS0               __at(0x1FD10);	// @ (0x3FA2 * 8 + 0)
#define                                 T4CS0_bit           BANKMASK(T4CLKCON), 0
// T4CLKCON<T4CS1>
extern volatile __bit                   T4CS1               __at(0x1FD11);	// @ (0x3FA2 * 8 + 1)
#define                                 T4CS1_bit           BANKMASK(T4CLKCON), 1
// T4CLKCON<T4CS2>
extern volatile __bit                   T4CS2               __at(0x1FD12);	// @ (0x3FA2 * 8 + 2)
#define                                 T4CS2_bit           BANKMASK(T4CLKCON), 2
// T4CLKCON<T4CS3>
extern volatile __bit                   T4CS3               __at(0x1FD13);	// @ (0x3FA2 * 8 + 3)
#define                                 T4CS3_bit           BANKMASK(T4CLKCON), 3
// T4HLT<T4MODE0>
extern volatile __bit                   T4MODE0             __at(0x1FD08);	// @ (0x3FA1 * 8 + 0)
#define                                 T4MODE0_bit         BANKMASK(T4HLT), 0
// T4HLT<T4MODE1>
extern volatile __bit                   T4MODE1             __at(0x1FD09);	// @ (0x3FA1 * 8 + 1)
#define                                 T4MODE1_bit         BANKMASK(T4HLT), 1
// T4HLT<T4MODE2>
extern volatile __bit                   T4MODE2             __at(0x1FD0A);	// @ (0x3FA1 * 8 + 2)
#define                                 T4MODE2_bit         BANKMASK(T4HLT), 2
// T4HLT<T4MODE3>
extern volatile __bit                   T4MODE3             __at(0x1FD0B);	// @ (0x3FA1 * 8 + 3)
#define                                 T4MODE3_bit         BANKMASK(T4HLT), 3
// T4HLT<T4MODE4>
extern volatile __bit                   T4MODE4             __at(0x1FD0C);	// @ (0x3FA1 * 8 + 4)
#define                                 T4MODE4_bit         BANKMASK(T4HLT), 4
// T4CON<T4ON>
extern volatile __bit                   T4ON                __at(0x1FD07);	// @ (0x3FA0 * 8 + 7)
#define                                 T4ON_bit            BANKMASK(T4CON), 7
// T4CON<T4OUTPS0>
extern volatile __bit                   T4OUTPS0            __at(0x1FD00);	// @ (0x3FA0 * 8 + 0)
#define                                 T4OUTPS0_bit        BANKMASK(T4CON), 0
// T4CON<T4OUTPS1>
extern volatile __bit                   T4OUTPS1            __at(0x1FD01);	// @ (0x3FA0 * 8 + 1)
#define                                 T4OUTPS1_bit        BANKMASK(T4CON), 1
// T4CON<T4OUTPS2>
extern volatile __bit                   T4OUTPS2            __at(0x1FD02);	// @ (0x3FA0 * 8 + 2)
#define                                 T4OUTPS2_bit        BANKMASK(T4CON), 2
// T4CON<T4OUTPS3>
extern volatile __bit                   T4OUTPS3            __at(0x1FD03);	// @ (0x3FA0 * 8 + 3)
#define                                 T4OUTPS3_bit        BANKMASK(T4CON), 3
// T4HLT<T4PSYNC>
extern volatile __bit                   T4PSYNC             __at(0x1FD0F);	// @ (0x3FA1 * 8 + 7)
#define                                 T4PSYNC_bit         BANKMASK(T4HLT), 7
// T4RST<T4RSEL0>
extern volatile __bit                   T4RSEL0             __at(0x1FD18);	// @ (0x3FA3 * 8 + 0)
#define                                 T4RSEL0_bit         BANKMASK(T4RST), 0
// T4RST<T4RSEL1>
extern volatile __bit                   T4RSEL1             __at(0x1FD19);	// @ (0x3FA3 * 8 + 1)
#define                                 T4RSEL1_bit         BANKMASK(T4RST), 1
// T4RST<T4RSEL2>
extern volatile __bit                   T4RSEL2             __at(0x1FD1A);	// @ (0x3FA3 * 8 + 2)
#define                                 T4RSEL2_bit         BANKMASK(T4RST), 2
// T4RST<T4RSEL3>
extern volatile __bit                   T4RSEL3             __at(0x1FD1B);	// @ (0x3FA3 * 8 + 3)
#define                                 T4RSEL3_bit         BANKMASK(T4RST), 3
// T4RST<T4RSEL4>
extern volatile __bit                   T4RSEL4             __at(0x1FD1C);	// @ (0x3FA3 * 8 + 4)
#define                                 T4RSEL4_bit         BANKMASK(T4RST), 4
// T5CON<T5CKPS0>
extern volatile __bit                   T5CKPS0             __at(0x1FCD4);	// @ (0x3F9A * 8 + 4)
