LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   TMR3H7              __at(0x1FD2F);	// @ (0x3FA5 * 8 + 7)
#define                                 TMR3H7_bit          BANKMASK(TMR3H), 7
// PIE6<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x1CCB6);	// @ (0x3996 * 8 + 6)
#define                                 TMR3IE_bit          BANKMASK(PIE6), 6
// PIR6<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x1CD36);	// @ (0x39A6 * 8 + 6)
#define                                 TMR3IF_bit          BANKMASK(PIR6), 6
// IPR6<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x1CC36);	// @ (0x3986 * 8 + 6)
#define                                 TMR3IP_bit          BANKMASK(IPR6), 6
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x1FD20);	// @ (0x3FA4 * 8 + 0)
#define                                 TMR3L0_bit          BANKMASK(TMR3L), 0
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x1FD21);	// @ (0x3FA4 * 8 + 1)
#define                                 TMR3L1_bit          BANKMASK(TMR3L), 1
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x1FD22);	// @ (0x3FA4 * 8 + 2)
#define                                 TMR3L2_bit          BANKMASK(TMR3L), 2
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x1FD23);	// @ (0x3FA4 * 8 + 3)
#define                                 TMR3L3_bit          BANKMASK(TMR3L), 3
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x1FD24);	// @ (0x3FA4 * 8 + 4)
#define                                 TMR3L4_bit          BANKMASK(TMR3L), 4
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x1FD25);	// @ (0x3FA4 * 8 + 5)
#define                                 TMR3L5_bit          BANKMASK(TMR3L), 5
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x1FD26);	// @ (0x3FA4 * 8 + 6)
#define                                 TMR3L6_bit          BANKMASK(TMR3L), 6
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x1FD27);	// @ (0x3FA4 * 8 + 7)
#define                                 TMR3L7_bit          BANKMASK(TMR3L), 7
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x1CE0B);	// @ (0x39C1 * 8 + 3)
#define                                 TMR3MD_bit          BANKMASK(PMD1), 3
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x1FD30);	// @ (0x3FA6 * 8 + 0)
#define                                 TMR3ON_bit          BANKMASK(T3CON), 0
// PIE7<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x1CCB8);	// @ (0x3997 * 8 + 0)
#define                                 TMR4IE_bit          BANKMASK(PIE7), 0
// PIR7<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x1CD38);	// @ (0x39A7 * 8 + 0)
#define                                 TMR4IF_bit          BANKMASK(PIR7), 0
// IPR7<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x1CC38);	// @ (0x3987 * 8 + 0)
#define                                 TMR4IP_bit          BANKMASK(IPR7), 0
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x1CE0C);	// @ (0x39C1 * 8 + 4)
#define                                 TMR4MD_bit          BANKMASK(PMD1), 4
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x1FD07);	// @ (0x3FA0 * 8 + 7)
#define                                 TMR4ON_bit          BANKMASK(T4CON), 7
// SMT1TMRL<TMR5>
extern volatile __bit                   TMR5                __at(0x1F895);	// @ (0x3F12 * 8 + 5)
#define                                 TMR5_bit            BANKMASK(SMT1TMRL), 5
// PIE8<TMR5GIE>
extern volatile __bit                   TMR5GIE             __at(0x1CCC7);	// @ (0x3998 * 8 + 7)
#define                                 TMR5GIE_bit         BANKMASK(PIE8), 7
// PIR8<TMR5GIF>
extern volatile __bit                   TMR5GIF             __at(0x1CD47);	// @ (0x39A8 * 8 + 7)
#define                                 TMR5GIF_bit         BANKMASK(PIR8), 7
// IPR8<TMR5GIP>
extern volatile __bit                   TMR5GIP             __at(0x1CC47);	// @ (0x3988 * 8 + 7)
#define                                 TMR5GIP_bit         BANKMASK(IPR8), 7
// TMR5H<TMR5H0>
extern volatile __bit                   TMR5H0              __at(0x1FCC8);	// @ (0x3F99 * 8 + 0)
#define                                 TMR5H0_bit          BANKMASK(TMR5H), 0
// TMR5H<TMR5H1>
extern volatile __bit                   TMR5H1              __at(0x1FCC9);	// @ (0x3F99 * 8 + 1)
#define                                 TMR5H1_bit          BANKMASK(TMR5H), 1
// TMR5H<TMR5H2>
extern volatile __bit                   TMR5H2              __at(0x1FCCA);	// @ (0x3F99 * 8 + 2)
#define                                 TMR5H2_bit          BANKMASK(TMR5H), 2
// TMR5H<TMR5H3>
extern volatile __bit                   TMR5H3              __at(0x1FCCB);	// @ (0x3F99 * 8 + 3)
#define                                 TMR5H3_bit          BANKMASK(TMR5H), 3
// TMR5H<TMR5H4>
extern volatile __bit                   TMR5H4              __at(0x1FCCC);	// @ (0x3F99 * 8 + 4)
#define                                 TMR5H4_bit          BANKMASK(TMR5H), 4
// TMR5H<TMR5H5>
extern volatile __bit                   TMR5H5              __at(0x1FCCD);	// @ (0x3F99 * 8 + 5)
#define                                 TMR5H5_bit          BANKMASK(TMR5H), 5
// TMR5H<TMR5H6>
extern volatile __bit                   TMR5H6              __at(0x1FCCE);	// @ (0x3F99 * 8 + 6)
#define                                 TMR5H6_bit          BANKMASK(TMR5H), 6
// TMR5H<TMR5H7>
extern volatile __bit                   TMR5H7              __at(0x1FCCF);	// @ (0x3F99 * 8 + 7)
#define                                 TMR5H7_bit          BANKMASK(TMR5H), 7
// PIE8<TMR5IE>
extern volatile __bit                   TMR5IE              __at(0x1CCC6);	// @ (0x3998 * 8 + 6)
#define                                 TMR5IE_bit          BANKMASK(PIE8), 6
// PIR8<TMR5IF>
extern volatile __bit                   TMR5IF              __at(0x1CD46);	// @ (0x39A8 * 8 + 6)
#define                                 TMR5IF_bit          BANKMASK(PIR8), 6
// IPR8<TMR5IP>
extern volatile __bit                   TMR5IP              __at(0x1CC46);	// @ (0x3988 * 8 + 6)
#define                                 TMR5IP_bit          BANKMASK(IPR8), 6
// TMR5L<TMR5L0>
extern volatile __bit                   TMR5L0              __at(0x1FCC0);	// @ (0x3F98 * 8 + 0)
#define                                 TMR5L0_bit          BANKMASK(TMR5L), 0
// TMR5L<TMR5L1>
extern volatile __bit                   TMR5L1              __at(0x1FCC1);	// @ (0x3F98 * 8 + 1)
#define                                 TMR5L1_bit          BANKMASK(TMR5L), 1
// TMR5L<TMR5L2>
extern volatile __bit                   TMR5L2              __at(0x1FCC2);	// @ (0x3F98 * 8 + 2)
#define                                 TMR5L2_bit          BANKMASK(TMR5L), 2
// TMR5L<TMR5L3>
extern volatile __bit                   TMR5L3              __at(0x1FCC3);	// @ (0x3F98 * 8 + 3)
#define                                 TMR5L3_bit          BANKMASK(TMR5L), 3
// TMR5L<TMR5L4>
extern volatile __bit                   TMR5L4              __at(0x1FCC4);	// @ (0x3F98 * 8 + 4)
#define                                 TMR5L4_bit          BANKMASK(TMR5L), 4
// TMR5L<TMR5L5>
extern volatile __bit                   TMR5L5              __at(0x1FCC5);	// @ (0x3F98 * 8 + 5)
#define                                 TMR5L5_bit          BANKMASK(TMR5L), 5
// TMR5L<TMR5L6>
extern volatile __bit                   TMR5L6              __at(0x1FCC6);	// @ (0x3F98 * 8 + 6)
#define                                 TMR5L6_bit          BANKMASK(TMR5L), 6
// TMR5L<TMR5L7>
extern volatile __bit                   TMR5L7              __at(0x1FCC7);	// @ (0x3F98 * 8 + 7)
#define                                 TMR5L7_bit          BANKMASK(TMR5L), 7
// PMD1<TMR5MD>
extern volatile __bit                   TMR5MD              __at(0x1CE0D);	// @ (0x39C1 * 8 + 5)
#define                                 TMR5MD_bit          BANKMASK(PMD1), 5
// T5CON<TMR5ON>
extern volatile __bit                   TMR5ON              __at(0x1FCD0);	// @ (0x3F9A * 8 + 0)
#define                                 TMR5ON_bit          BANKMASK(T5CON), 0
// PIE9<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x1CCC8);	// @ (0x3999 * 8 + 0)
#define                                 TMR6IE_bit          BANKMASK(PIE9), 0
// PIR9<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x1CD48);	// @ (0x39A9 * 8 + 0)
#define                                 TMR6IF_bit          BANKMASK(PIR9), 0
// IPR9<TMR6IP>
extern volatile __bit                   TMR6IP              __at(0x1CC48);	// @ (0x3989 * 8 + 0)
#define                                 TMR6IP_bit          BANKMASK(IPR9), 0
// PMD1<TMR6MD>
extern volatile __bit                   TMR6MD              __at(0x1CE0E);	// @ (0x39C1 * 8 + 6)
#define                                 TMR6MD_bit          BANKMASK(PMD1), 6
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x1FCA7);	// @ (0x3F94 * 8 + 7)
#define                                 TMR6ON_bit          BANKMASK(T6CON), 7
// SMT1TMRL<TMR7>
extern volatile __bit                   TMR7                __at(0x1F897);	// @ (0x3F12 * 8 + 7)
#define                                 TMR7_bit            BANKMASK(SMT1TMRL), 7
// SMT1TMRH<TMR8>
extern volatile __bit                   TMR8                __at(0x1F898);	// @ (0x3F13 * 8 + 0)
#define                                 TMR8_bit            BANKMASK(SMT1TMRH), 0
// SMT1TMRH<TMR9>
extern volatile __bit                   TMR9                __at(0x1F899);	// @ (0x3F13 * 8 + 1)
#define                                 TMR9_bit            BANKMASK(SMT1TMRH), 1
// SCANCON0<TRIGEN>
extern volatile __bit                   TRIGEN              __at(0x1CBE6);	// @ (0x397C * 8 + 6)
#define                                 TRIGEN_bit          BANKMASK(SCANCON0), 6
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x1FE10);	// @ (0x3FC2 * 8 + 0)
#define                                 TRISA0_bit          BANKMASK(TRISA), 0
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x1FE11);	// @ (0x3FC2 * 8 + 1)
#define                                 TRISA1_bit          BANKMASK(TRISA), 1
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x1FE12);	// @ (0x3FC2 * 8 + 2)
#define                                 TRISA2_bit          BANKMASK(TRISA), 2
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x1FE13);	// @ (0x3FC2 * 8 + 3)
#define                                 TRISA3_bit          BANKMASK(TRISA), 3
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x1FE14);	// @ (0x3FC2 * 8 + 4)
#define                                 TRISA4_bit          BANKMASK(TRISA), 4
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x1FE15);	// @ (0x3FC2 * 8 + 5)
#define                                 TRISA5_bit          BANKMASK(TRISA), 5
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0x1FE16);	// @ (0x3FC2 * 8 + 6)
#define                                 TRISA6_bit          BANKMASK(TRISA), 6
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0x1FE17);	// @ (0x3FC2 * 8 + 7)
#define                                 TRISA7_bit          BANKMASK(TRISA), 7
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0x1FE18);	// @ (0x3FC3 * 8 + 0)
#define                                 TRISB0_bit          BANKMASK(TRISB), 0
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x1FE19);	// @ (0x3FC3 * 8 + 1)
#define                                 TRISB1_bit          BANKMASK(TRISB), 1
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x1FE1A);	// @ (0x3FC3 * 8 + 2)
#define                                 TRISB2_bit          BANKMASK(TRISB), 2
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x1FE1B);	// @ (0x3FC3 * 8 + 3)
#define                                 TRISB3_bit          BANKMASK(TRISB), 3
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x1FE1C);	// @ (0x3FC3 * 8 + 4)
#define                                 TRISB4_bit          BANKMASK(TRISB), 4
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x1FE1D);	// @ (0x3FC3 * 8 + 5)
#define                                 TRISB5_bit          BANKMASK(TRISB), 5
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x1FE1E);	// @ (0x3FC3 * 8 + 6)
#define                                 TRISB6_bit          BANKMASK(TRISB), 6
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x1FE1F);	// @ (0x3FC3 * 8 + 7)
#define                                 TRISB7_bit          BANKMASK(TRISB), 7
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x1FE20);	// @ (0x3FC4 * 8 + 0)
#define                                 TRISC0_bit          BANKMASK(TRISC), 0
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x1FE21);	// @ (0x3FC4 * 8 + 1)
#define                                 TRISC1_bit          BANKMASK(TRISC), 1
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x1FE22);	// @ (0x3FC4 * 8 + 2)
#define                                 TRISC2_bit          BANKMASK(TRISC), 2
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x1FE23);	// @ (0x3FC4 * 8 + 3)
#define                                 TRISC3_bit          BANKMASK(TRISC), 3
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x1FE24);	// @ (0x3FC4 * 8 + 4)
#define                                 TRISC4_bit          BANKMASK(TRISC), 4
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x1FE25);	// @ (0x3FC4 * 8 + 5)
#define                                 TRISC5_bit          BANKMASK(TRISC), 5
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x1FE26);	// @ (0x3FC4 * 8 + 6)
#define                                 TRISC6_bit          BANKMASK(TRISC), 6
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x1FE27);	// @ (0x3FC4 * 8 + 7)
#define                                 TRISC7_bit          BANKMASK(TRISC), 7
// TRISD<TRISD0>
extern volatile __bit                   TRISD0              __at(0x1FE28);	// @ (0x3FC5 * 8 + 0)
#define                                 TRISD0_bit          BANKMASK(TRISD), 0
// TRISD<TRISD1>
extern volatile __bit                   TRISD1              __at(0x1FE29);	// @ (0x3FC5 * 8 + 1)
#define                                 TRISD1_bit          BANKMASK(TRISD), 1
// TRISD<TRISD2>
extern volatile __bit                   TRISD2              __at(0x1FE2A);	// @ (0x3FC5 * 8 + 2)
#define                                 TRISD2_bit          BANKMASK(TRISD), 2
// TRISD<TRISD3>
extern volatile __bit                   TRISD3              __at(0x1FE2B);	// @ (0x3FC5 * 8 + 3)
#define                                 TRISD3_bit          BANKMASK(TRISD), 3
// TRISD<TRISD4>
extern volatile __bit                   TRISD4              __at(0x1FE2C);	// @ (0x3FC5 * 8 + 4)
#define                                 TRISD4_bit          BANKMASK(TRISD), 4
// TRISD<TRISD5>
extern volatile __bit                   TRISD5              __at(0x1FE2D);	// @ (0x3FC5 * 8 + 5)
#define                                 TRISD5_bit          BANKMASK(TRISD), 5
// TRISD<TRISD6>
extern volatile __bit                   TRISD6              __at(0x1FE2E);	// @ (0x3FC5 * 8 + 6)
#define                                 TRISD6_bit          BANKMASK(TRISD), 6
// TRISD<TRISD7>
extern volatile __bit                   TRISD7              __at(0x1FE2F);	// @ (0x3FC5 * 8 + 7)
#define                                 TRISD7_bit          BANKMASK(TRISD), 7
// TRISE<TRISE0>
extern volatile __bit                   TRISE0              __at(0x1FE30);	// @ (0x3FC6 * 8 + 0)
#define                                 TRISE0_bit          BANKMASK(TRISE), 0
// TRISE<TRISE1>
extern volatile __bit                   TRISE1              __at(0x1FE31);	// @ (0x3FC6 * 8 + 1)
#define                                 TRISE1_bit          BANKMASK(TRISE), 1
// TRISE<TRISE2>
extern volatile __bit                   TRISE2              __at(0x1FE32);	// @ (0x3FC6 * 8 + 2)
#define                                 TRISE2_bit          BANKMASK(TRISE), 2
// SMT1STAT<TS>
extern volatile __bit                   TS                  __at(0x1F902);	// @ (0x3F20 * 8 + 2)
#define                                 TS_bit              BANKMASK(SMT1STAT), 2
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x1F60D);	// @ (0x3EC1 * 8 + 5)
#define                                 TSEN_bit            BANKMASK(FVRCON), 5
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x1F60C);	// @ (0x3EC1 * 8 + 4)
#define                                 TSRNG_bit           BANKMASK(FVRCON), 4
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x1CEF0);	// @ (0x39DE * 8 + 0)
#define                                 TUN0_bit            BANKMASK(OSCTUNE), 0
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x1CEF1);	// @ (0x39DE * 8 + 1)
#define                                 TUN1_bit            BANKMASK(OSCTUNE), 1
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x1CEF2);	// @ (0x39DE * 8 + 2)
#define                                 TUN2_bit            BANKMASK(OSCTUNE), 2
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x1CEF3);	// @ (0x39DE * 8 + 3)
#define                                 TUN3_bit            BANKMASK(OSCTUNE), 3
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x1CEF4);	// @ (0x39DE * 8 + 4)
#define                                 TUN4_bit            BANKMASK(OSCTUNE), 4
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x1CEF5);	// @ (0x39DE * 8 + 5)
#define                                 TUN5_bit            BANKMASK(OSCTUNE), 5
// SPI1TWIDTH<TWIDTH0>
extern volatile __bit                   TWIDTH0             __at(0x1E8C0);	// @ (0x3D18 * 8 + 0)
#define                                 TWIDTH0_bit         BANKMASK(SPI1TWIDTH), 0
// SPI1TWIDTH<TWIDTH1>
extern volatile __bit                   TWIDTH1             __at(0x1E8C1);	// @ (0x3D18 * 8 + 1)
#define                                 TWIDTH1_bit         BANKMASK(SPI1TWIDTH), 1
// SPI1TWIDTH<TWIDTH2>
extern volatile __bit                   TWIDTH2             __at(0x1E8C2);	// @ (0x3D18 * 8 + 2)
#define                                 TWIDTH2_bit         BANKMASK(SPI1TWIDTH), 2
// PIE1<TX1IE>
extern volatile __bit                   TX1IE               __at(0x1CC8C);	// @ (0x3991 * 8 + 4)
#define                                 TX1IE_bit           BANKMASK(PIE1), 4
// PIR1<TX1IF>
extern volatile __bit                   TX1IF               __at(0x1CD0C);	// @ (0x39A1 * 8 + 4)
#define                                 TX1IF_bit           BANKMASK(PIR1), 4
// IPR1<TX1IP>
extern volatile __bit                   TX1IP               __at(0x1CC0C);	// @ (0x3981 * 8 + 4)
#define                                 TX1IP_bit           BANKMASK(IPR1), 4
// SPI1TXB<TXB0>
extern volatile __bit                   TXB0                __at(0x1E888);	// @ (0x3D11 * 8 + 0)
#define                                 TXB0_bit            BANKMASK(SPI1TXB), 0
// PIE3<TXB0IE>
extern volatile __bit                   TXB0IE              __at(0x1CC9A);	// @ (0x3993 * 8 + 2)
#define                                 TXB0IE_bit          BANKMASK(PIE3), 2
// SPI1TXB<TXB1>
extern volatile __bit                   TXB1                __at(0x1E889);	// @ (0x3D11 * 8 + 1)
#define                                 TXB1_bit            BANKMASK(SPI1TXB), 1
// PIE3<TXB1IE>
extern volatile __bit                   TXB1IE              __at(0x1CC9B);	// @ (0x3993 * 8 + 3)
#define                                 TXB1IE_bit          BANKMASK(PIE3), 3
// SPI1TXB<TXB2>
extern volatile __bit                   TXB2                __at(0x1E88A);	// @ (0x3D11 * 8 + 2)
#define                                 TXB2_bit            BANKMASK(SPI1TXB), 2
// PIE3<TXB2IE>
extern volatile __bit                   TXB2IE              __at(0x1CC9C);	// @ (0x3993 * 8 + 4)
#define                                 TXB2IE_bit          BANKMASK(PIE3), 4
// SPI1TXB<TXB3>
extern volatile __bit                   TXB3                __at(0x1E88B);	// @ (0x3D11 * 8 + 3)
#define                                 TXB3_bit            BANKMASK(SPI1TXB), 3
// SPI1TXB<TXB4>
extern volatile __bit                   TXB4                __at(0x1E88C);	// @ (0x3D11 * 8 + 4)
#define                                 TXB4_bit            BANKMASK(SPI1TXB), 4
// SPI1TXB<TXB5>
extern volatile __bit                   TXB5                __at(0x1E88D);	// @ (0x3D11 * 8 + 5)
#define                                 TXB5_bit            BANKMASK(SPI1TXB), 5
// SPI1TXB<TXB6>
extern volatile __bit                   TXB6                __at(0x1E88E);	// @ (0x3D11 * 8 + 6)
#define                                 TXB6_bit            BANKMASK(SPI1TXB), 6
// SPI1TXB<TXB7>
extern volatile __bit                   TXB7                __at(0x1E88F);	// @ (0x3D11 * 8 + 7)
#define                                 TXB7_bit            BANKMASK(SPI1TXB), 7
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x1CC9C);	// @ (0x3993 * 8 + 4)
#define                                 TXBNIE_bit          BANKMASK(PIE3), 4
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x1CD1C);	// @ (0x39A3 * 8 + 4)
#define                                 TXBNIF_bit          BANKMASK(PIR3), 4
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x1CC1C);	// @ (0x3983 * 8 + 4)
#define                                 TXBNIP_bit          BANKMASK(IPR3), 4
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x1CC8C);	// @ (0x3991 * 8 + 4)
#define                                 TXIE_bit            BANKMASK(PIE1), 4
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x1CD0C);	// @ (0x39A1 * 8 + 4)
#define                                 TXIF_bit            BANKMASK(PIR1), 4
// SPI1CON2<TXR>
extern volatile __bit                   TXR                 __at(0x1E8B1);	// @ (0x3D16 * 8 + 1)
#define                                 TXR_bit             BANKMASK(SPI1CON2), 1
// SPI1INTE<TXUIE>
extern volatile __bit                   TXUIE               __at(0x1E8D9);	// @ (0x3D1B * 8 + 1)
#define                                 TXUIE_bit           BANKMASK(SPI1INTE), 1
// SPI1INTF<TXUIF>
extern volatile __bit                   TXUIF               __at(0x1E8D1);	// @ (0x3D1A * 8 + 1)
#define                                 TXUIF_bit           BANKMASK(SPI1INTF), 1
// U1CON0<U1ABDEN>
extern volatile __bit                   U1ABDEN             __at(0x1EF96);	// @ (0x3DF2 * 8 + 6)
#define                                 U1ABDEN_bit         BANKMASK(U1CON0), 6
// U1UIR<U1ABDIE>
extern volatile __bit                   U1ABDIE             __at(0x1EFC2);	// @ (0x3DF8 * 8 + 2)
#define                                 U1ABDIE_bit         BANKMASK(U1UIR), 2
// U1UIR<U1ABDIF>
