LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   U1ABDIF             __at(0x1EFC6);	// @ (0x3DF8 * 8 + 6)
#define                                 U1ABDIF_bit         BANKMASK(U1UIR), 6
// U1ERRIE<U1ABDOVE>
extern volatile __bit                   U1ABDOVE            __at(0x1EFD5);	// @ (0x3DFA * 8 + 5)
#define                                 U1ABDOVE_bit        BANKMASK(U1ERRIE), 5
// U1ERRIR<U1ABDOVF>
extern volatile __bit                   U1ABDOVF            __at(0x1EFCD);	// @ (0x3DF9 * 8 + 5)
#define                                 U1ABDOVF_bit        BANKMASK(U1ERRIR), 5
// U1CON0<U1BRGS>
extern volatile __bit                   U1BRGS              __at(0x1EF97);	// @ (0x3DF2 * 8 + 7)
#define                                 U1BRGS_bit          BANKMASK(U1CON0), 7
// U1CON1<U1BRKOVR>
extern volatile __bit                   U1BRKOVR            __at(0x1EF99);	// @ (0x3DF3 * 8 + 1)
#define                                 U1BRKOVR_bit        BANKMASK(U1CON1), 1
// U1CON2<U1C0EN>
extern volatile __bit                   U1C0EN              __at(0x1EFA3);	// @ (0x3DF4 * 8 + 3)
#define                                 U1C0EN_bit          BANKMASK(U1CON2), 3
// U1ERRIE<U1CERIE>
extern volatile __bit                   U1CERIE             __at(0x1EFD4);	// @ (0x3DFA * 8 + 4)
#define                                 U1CERIE_bit         BANKMASK(U1ERRIE), 4
// U1ERRIR<U1CERIF>
extern volatile __bit                   U1CERIF             __at(0x1EFCC);	// @ (0x3DF9 * 8 + 4)
#define                                 U1CERIF_bit         BANKMASK(U1ERRIR), 4
// PIE3<U1EIE>
extern volatile __bit                   U1EIE               __at(0x1CC9D);	// @ (0x3993 * 8 + 5)
#define                                 U1EIE_bit           BANKMASK(PIE3), 5
// PIR3<U1EIF>
extern volatile __bit                   U1EIF               __at(0x1CD1D);	// @ (0x39A3 * 8 + 5)
#define                                 U1EIF_bit           BANKMASK(PIR3), 5
// IPR3<U1EIP>
extern volatile __bit                   U1EIP               __at(0x1CC1D);	// @ (0x3983 * 8 + 5)
#define                                 U1EIP_bit           BANKMASK(IPR3), 5
// U1ERRIE<U1FERIE>
extern volatile __bit                   U1FERIE             __at(0x1EFD3);	// @ (0x3DFA * 8 + 3)
#define                                 U1FERIE_bit         BANKMASK(U1ERRIE), 3
// U1ERRIR<U1FERIF>
extern volatile __bit                   U1FERIF             __at(0x1EFCB);	// @ (0x3DF9 * 8 + 3)
#define                                 U1FERIF_bit         BANKMASK(U1ERRIR), 3
// U1CON2<U1FLO0>
extern volatile __bit                   U1FLO0              __at(0x1EFA0);	// @ (0x3DF4 * 8 + 0)
#define                                 U1FLO0_bit          BANKMASK(U1CON2), 0
// U1CON2<U1FLO1>
extern volatile __bit                   U1FLO1              __at(0x1EFA1);	// @ (0x3DF4 * 8 + 1)
#define                                 U1FLO1_bit          BANKMASK(U1CON2), 1
// PIE3<U1IE>
extern volatile __bit                   U1IE                __at(0x1CC9E);	// @ (0x3993 * 8 + 6)
#define                                 U1IE_bit            BANKMASK(PIE3), 6
// PIR3<U1IF>
extern volatile __bit                   U1IF                __at(0x1CD1E);	// @ (0x39A3 * 8 + 6)
#define                                 U1IF_bit            BANKMASK(PIR3), 6
// IPR3<U1IP>
extern volatile __bit                   U1IP                __at(0x1CC1E);	// @ (0x3983 * 8 + 6)
#define                                 U1IP_bit            BANKMASK(IPR3), 6
// PMD5<U1MD>
extern volatile __bit                   U1MD                __at(0x1CE2C);	// @ (0x39C5 * 8 + 4)
#define                                 U1MD_bit            BANKMASK(PMD5), 4
// U1CON0<U1MODE0>
extern volatile __bit                   U1MODE0             __at(0x1EF90);	// @ (0x3DF2 * 8 + 0)
#define                                 U1MODE0_bit         BANKMASK(U1CON0), 0
// U1CON0<U1MODE1>
extern volatile __bit                   U1MODE1             __at(0x1EF91);	// @ (0x3DF2 * 8 + 1)
#define                                 U1MODE1_bit         BANKMASK(U1CON0), 1
// U1CON0<U1MODE2>
extern volatile __bit                   U1MODE2             __at(0x1EF92);	// @ (0x3DF2 * 8 + 2)
#define                                 U1MODE2_bit         BANKMASK(U1CON0), 2
// U1CON1<U1ON>
extern volatile __bit                   U1ON                __at(0x1EF9F);	// @ (0x3DF3 * 8 + 7)
#define                                 U1ON_bit            BANKMASK(U1CON1), 7
// U1ERRIE<U1PERIE>
extern volatile __bit                   U1PERIE             __at(0x1EFD6);	// @ (0x3DFA * 8 + 6)
#define                                 U1PERIE_bit         BANKMASK(U1ERRIE), 6
// U1ERRIR<U1PERIF>
extern volatile __bit                   U1PERIF             __at(0x1EFCE);	// @ (0x3DF9 * 8 + 6)
#define                                 U1PERIF_bit         BANKMASK(U1ERRIR), 6
// U1FIFO<U1RCIDL>
extern volatile __bit                   U1RCIDL             __at(0x1EFBB);	// @ (0x3DF7 * 8 + 3)
#define                                 U1RCIDL_bit         BANKMASK(U1FIFO), 3
// U1CON2<U1RUNOVF>
extern volatile __bit                   U1RUNOVF            __at(0x1EFA7);	// @ (0x3DF4 * 8 + 7)
#define                                 U1RUNOVF_bit        BANKMASK(U1CON2), 7
// U1FIFO<U1RXBE>
extern volatile __bit                   U1RXBE              __at(0x1EFB9);	// @ (0x3DF7 * 8 + 1)
#define                                 U1RXBE_bit          BANKMASK(U1FIFO), 1
// U1FIFO<U1RXBF>
extern volatile __bit                   U1RXBF              __at(0x1EFB8);	// @ (0x3DF7 * 8 + 0)
#define                                 U1RXBF_bit          BANKMASK(U1FIFO), 0
// U1CON1<U1RXBIMD>
extern volatile __bit                   U1RXBIMD            __at(0x1EF9B);	// @ (0x3DF3 * 8 + 3)
#define                                 U1RXBIMD_bit        BANKMASK(U1CON1), 3
// U1ERRIE<U1RXBKIE>
extern volatile __bit                   U1RXBKIE            __at(0x1EFD2);	// @ (0x3DFA * 8 + 2)
#define                                 U1RXBKIE_bit        BANKMASK(U1ERRIE), 2
// U1ERRIR<U1RXBKIF>
extern volatile __bit                   U1RXBKIF            __at(0x1EFCA);	// @ (0x3DF9 * 8 + 2)
#define                                 U1RXBKIF_bit        BANKMASK(U1ERRIR), 2
// U1CON0<U1RXEN>
extern volatile __bit                   U1RXEN              __at(0x1EF94);	// @ (0x3DF2 * 8 + 4)
#define                                 U1RXEN_bit          BANKMASK(U1CON0), 4
// U1ERRIE<U1RXFOIE>
extern volatile __bit                   U1RXFOIE            __at(0x1EFD1);	// @ (0x3DFA * 8 + 1)
#define                                 U1RXFOIE_bit        BANKMASK(U1ERRIE), 1
// U1ERRIR<U1RXFOIF>
extern volatile __bit                   U1RXFOIF            __at(0x1EFC9);	// @ (0x3DF9 * 8 + 1)
#define                                 U1RXFOIF_bit        BANKMASK(U1ERRIR), 1
// U1FIFO<U1RXIDL>
extern volatile __bit                   U1RXIDL             __at(0x1EFBB);	// @ (0x3DF7 * 8 + 3)
#define                                 U1RXIDL_bit         BANKMASK(U1FIFO), 3
// PIE3<U1RXIE>
extern volatile __bit                   U1RXIE              __at(0x1CC9B);	// @ (0x3993 * 8 + 3)
#define                                 U1RXIE_bit          BANKMASK(PIE3), 3
// PIR3<U1RXIF>
extern volatile __bit                   U1RXIF              __at(0x1CD1B);	// @ (0x39A3 * 8 + 3)
#define                                 U1RXIF_bit          BANKMASK(PIR3), 3
// IPR3<U1RXIP>
extern volatile __bit                   U1RXIP              __at(0x1CC1B);	// @ (0x3983 * 8 + 3)
#define                                 U1RXIP_bit          BANKMASK(IPR3), 3
// U1CON2<U1RXPOL>
extern volatile __bit                   U1RXPOL             __at(0x1EFA6);	// @ (0x3DF4 * 8 + 6)
#define                                 U1RXPOL_bit         BANKMASK(U1CON2), 6
// U1CON1<U1SENDB>
extern volatile __bit                   U1SENDB             __at(0x1EF98);	// @ (0x3DF3 * 8 + 0)
#define                                 U1SENDB_bit         BANKMASK(U1CON1), 0
// U1CON2<U1STP0>
extern volatile __bit                   U1STP0              __at(0x1EFA4);	// @ (0x3DF4 * 8 + 4)
#define                                 U1STP0_bit          BANKMASK(U1CON2), 4
// U1CON2<U1STP1>
extern volatile __bit                   U1STP1              __at(0x1EFA5);	// @ (0x3DF4 * 8 + 5)
#define                                 U1STP1_bit          BANKMASK(U1CON2), 5
// U1FIFO<U1STPMD>
extern volatile __bit                   U1STPMD             __at(0x1EFBE);	// @ (0x3DF7 * 8 + 6)
#define                                 U1STPMD_bit         BANKMASK(U1FIFO), 6
// U1FIFO<U1TXBE>
extern volatile __bit                   U1TXBE              __at(0x1EFBD);	// @ (0x3DF7 * 8 + 5)
#define                                 U1TXBE_bit          BANKMASK(U1FIFO), 5
// U1FIFO<U1TXBF>
extern volatile __bit                   U1TXBF              __at(0x1EFBC);	// @ (0x3DF7 * 8 + 4)
#define                                 U1TXBF_bit          BANKMASK(U1FIFO), 4
// U1ERRIE<U1TXCIE>
extern volatile __bit                   U1TXCIE             __at(0x1EFD0);	// @ (0x3DFA * 8 + 0)
#define                                 U1TXCIE_bit         BANKMASK(U1ERRIE), 0
// U1ERRIR<U1TXCIF>
extern volatile __bit                   U1TXCIF             __at(0x1EFC8);	// @ (0x3DF9 * 8 + 0)
#define                                 U1TXCIF_bit         BANKMASK(U1ERRIR), 0
// U1CON0<U1TXEN>
extern volatile __bit                   U1TXEN              __at(0x1EF95);	// @ (0x3DF2 * 8 + 5)
#define                                 U1TXEN_bit          BANKMASK(U1CON0), 5
// PIE3<U1TXIE>
extern volatile __bit                   U1TXIE              __at(0x1CC9C);	// @ (0x3993 * 8 + 4)
#define                                 U1TXIE_bit          BANKMASK(PIE3), 4
// PIR3<U1TXIF>
extern volatile __bit                   U1TXIF              __at(0x1CD1C);	// @ (0x39A3 * 8 + 4)
#define                                 U1TXIF_bit          BANKMASK(PIR3), 4
// IPR3<U1TXIP>
extern volatile __bit                   U1TXIP              __at(0x1CC1C);	// @ (0x3983 * 8 + 4)
#define                                 U1TXIP_bit          BANKMASK(IPR3), 4
// U1ERRIE<U1TXMTIE>
extern volatile __bit                   U1TXMTIE            __at(0x1EFD7);	// @ (0x3DFA * 8 + 7)
#define                                 U1TXMTIE_bit        BANKMASK(U1ERRIE), 7
// U1ERRIR<U1TXMTIF>
extern volatile __bit                   U1TXMTIF            __at(0x1EFCF);	// @ (0x3DF9 * 8 + 7)
#define                                 U1TXMTIF_bit        BANKMASK(U1ERRIR), 7
// U1CON2<U1TXPOL>
extern volatile __bit                   U1TXPOL             __at(0x1EFA2);	// @ (0x3DF4 * 8 + 2)
#define                                 U1TXPOL_bit         BANKMASK(U1CON2), 2
// U1FIFO<U1TXWRE>
extern volatile __bit                   U1TXWRE             __at(0x1EFBF);	// @ (0x3DF7 * 8 + 7)
#define                                 U1TXWRE_bit         BANKMASK(U1FIFO), 7
// U1CON1<U1WUE>
extern volatile __bit                   U1WUE               __at(0x1EF9C);	// @ (0x3DF3 * 8 + 4)
#define                                 U1WUE_bit           BANKMASK(U1CON1), 4
// U1UIR<U1WUIF>
extern volatile __bit                   U1WUIF              __at(0x1EFC7);	// @ (0x3DF8 * 8 + 7)
#define                                 U1WUIF_bit          BANKMASK(U1UIR), 7
// U1FIFO<U1XON>
extern volatile __bit                   U1XON               __at(0x1EFBA);	// @ (0x3DF7 * 8 + 2)
#define                                 U1XON_bit           BANKMASK(U1FIFO), 2
// U2CON0<U2ABDEN>
extern volatile __bit                   U2ABDEN             __at(0x1EED6);	// @ (0x3DDA * 8 + 6)
#define                                 U2ABDEN_bit         BANKMASK(U2CON0), 6
// U2UIR<U2ABDIE>
extern volatile __bit                   U2ABDIE             __at(0x1EF02);	// @ (0x3DE0 * 8 + 2)
#define                                 U2ABDIE_bit         BANKMASK(U2UIR), 2
// U2UIR<U2ABDIF>
extern volatile __bit                   U2ABDIF             __at(0x1EF06);	// @ (0x3DE0 * 8 + 6)
#define                                 U2ABDIF_bit         BANKMASK(U2UIR), 6
// U2ERRIE<U2ABDOVE>
extern volatile __bit                   U2ABDOVE            __at(0x1EF15);	// @ (0x3DE2 * 8 + 5)
#define                                 U2ABDOVE_bit        BANKMASK(U2ERRIE), 5
// U2ERRIR<U2ABDOVF>
extern volatile __bit                   U2ABDOVF            __at(0x1EF0D);	// @ (0x3DE1 * 8 + 5)
#define                                 U2ABDOVF_bit        BANKMASK(U2ERRIR), 5
// U2CON0<U2BRGS>
extern volatile __bit                   U2BRGS              __at(0x1EED7);	// @ (0x3DDA * 8 + 7)
#define                                 U2BRGS_bit          BANKMASK(U2CON0), 7
// U2CON1<U2BRKOVR>
extern volatile __bit                   U2BRKOVR            __at(0x1EED9);	// @ (0x3DDB * 8 + 1)
#define                                 U2BRKOVR_bit        BANKMASK(U2CON1), 1
// U2ERRIE<U2CERIE>
extern volatile __bit                   U2CERIE             __at(0x1EF14);	// @ (0x3DE2 * 8 + 4)
#define                                 U2CERIE_bit         BANKMASK(U2ERRIE), 4
// U2ERRIR<U2CERIF>
extern volatile __bit                   U2CERIF             __at(0x1EF0C);	// @ (0x3DE1 * 8 + 4)
#define                                 U2CERIF_bit         BANKMASK(U2ERRIR), 4
// PIE6<U2EIE>
extern volatile __bit                   U2EIE               __at(0x1CCB4);	// @ (0x3996 * 8 + 4)
#define                                 U2EIE_bit           BANKMASK(PIE6), 4
// PIR6<U2EIF>
extern volatile __bit                   U2EIF               __at(0x1CD34);	// @ (0x39A6 * 8 + 4)
#define                                 U2EIF_bit           BANKMASK(PIR6), 4
// IPR6<U2EIP>
extern volatile __bit                   U2EIP               __at(0x1CC34);	// @ (0x3986 * 8 + 4)
#define                                 U2EIP_bit           BANKMASK(IPR6), 4
// U2ERRIE<U2FERIE>
extern volatile __bit                   U2FERIE             __at(0x1EF13);	// @ (0x3DE2 * 8 + 3)
#define                                 U2FERIE_bit         BANKMASK(U2ERRIE), 3
// U2ERRIR<U2FERIF>
extern volatile __bit                   U2FERIF             __at(0x1EF0B);	// @ (0x3DE1 * 8 + 3)
#define                                 U2FERIF_bit         BANKMASK(U2ERRIR), 3
// U2CON2<U2FLO0>
extern volatile __bit                   U2FLO0              __at(0x1EEE0);	// @ (0x3DDC * 8 + 0)
#define                                 U2FLO0_bit          BANKMASK(U2CON2), 0
// U2CON2<U2FLO1>
extern volatile __bit                   U2FLO1              __at(0x1EEE1);	// @ (0x3DDC * 8 + 1)
#define                                 U2FLO1_bit          BANKMASK(U2CON2), 1
// PIE6<U2IE>
extern volatile __bit                   U2IE                __at(0x1CCB5);	// @ (0x3996 * 8 + 5)
#define                                 U2IE_bit            BANKMASK(PIE6), 5
// PIR6<U2IF>
extern volatile __bit                   U2IF                __at(0x1CD35);	// @ (0x39A6 * 8 + 5)
#define                                 U2IF_bit            BANKMASK(PIR6), 5
// IPR6<U2IP>
extern volatile __bit                   U2IP                __at(0x1CC35);	// @ (0x3986 * 8 + 5)
#define                                 U2IP_bit            BANKMASK(IPR6), 5
// PMD5<U2MD>
extern volatile __bit                   U2MD                __at(0x1CE2D);	// @ (0x39C5 * 8 + 5)
#define                                 U2MD_bit            BANKMASK(PMD5), 5
// U2CON0<U2MODE0>
extern volatile __bit                   U2MODE0             __at(0x1EED0);	// @ (0x3DDA * 8 + 0)
#define                                 U2MODE0_bit         BANKMASK(U2CON0), 0
// U2CON0<U2MODE1>
extern volatile __bit                   U2MODE1             __at(0x1EED1);	// @ (0x3DDA * 8 + 1)
#define                                 U2MODE1_bit         BANKMASK(U2CON0), 1
// U2CON0<U2MODE2>
extern volatile __bit                   U2MODE2             __at(0x1EED2);	// @ (0x3DDA * 8 + 2)
#define                                 U2MODE2_bit         BANKMASK(U2CON0), 2
// U2CON1<U2ON>
extern volatile __bit                   U2ON                __at(0x1EEDF);	// @ (0x3DDB * 8 + 7)
#define                                 U2ON_bit            BANKMASK(U2CON1), 7
// U2ERRIE<U2PERIE>
extern volatile __bit                   U2PERIE             __at(0x1EF16);	// @ (0x3DE2 * 8 + 6)
#define                                 U2PERIE_bit         BANKMASK(U2ERRIE), 6
// U2ERRIR<U2PERIF>
extern volatile __bit                   U2PERIF             __at(0x1EF0E);	// @ (0x3DE1 * 8 + 6)
#define                                 U2PERIF_bit         BANKMASK(U2ERRIR), 6
// U2FIFO<U2RCIDL>
extern volatile __bit                   U2RCIDL             __at(0x1EEFB);	// @ (0x3DDF * 8 + 3)
#define                                 U2RCIDL_bit         BANKMASK(U2FIFO), 3
// U2CON2<U2RUNOVF>
extern volatile __bit                   U2RUNOVF            __at(0x1EEE7);	// @ (0x3DDC * 8 + 7)
#define                                 U2RUNOVF_bit        BANKMASK(U2CON2), 7
// U2FIFO<U2RXBE>
extern volatile __bit                   U2RXBE              __at(0x1EEF9);	// @ (0x3DDF * 8 + 1)
#define                                 U2RXBE_bit          BANKMASK(U2FIFO), 1
// U2FIFO<U2RXBF>
extern volatile __bit                   U2RXBF              __at(0x1EEF8);	// @ (0x3DDF * 8 + 0)
#define                                 U2RXBF_bit          BANKMASK(U2FIFO), 0
// U2CON1<U2RXBIMD>
extern volatile __bit                   U2RXBIMD            __at(0x1EEDB);	// @ (0x3DDB * 8 + 3)
#define                                 U2RXBIMD_bit        BANKMASK(U2CON1), 3
// U2ERRIE<U2RXBKIE>
extern volatile __bit                   U2RXBKIE            __at(0x1EF12);	// @ (0x3DE2 * 8 + 2)
#define                                 U2RXBKIE_bit        BANKMASK(U2ERRIE), 2
// U2ERRIR<U2RXBKIF>
extern volatile __bit                   U2RXBKIF            __at(0x1EF0A);	// @ (0x3DE1 * 8 + 2)
#define                                 U2RXBKIF_bit        BANKMASK(U2ERRIR), 2
// U2CON0<U2RXEN>
extern volatile __bit                   U2RXEN              __at(0x1EED4);	// @ (0x3DDA * 8 + 4)
#define                                 U2RXEN_bit          BANKMASK(U2CON0), 4
// U2ERRIE<U2RXFOIE>
extern volatile __bit                   U2RXFOIE            __at(0x1EF11);	// @ (0x3DE2 * 8 + 1)
#define                                 U2RXFOIE_bit        BANKMASK(U2ERRIE), 1
// U2ERRIR<U2RXFOIF>
extern volatile __bit                   U2RXFOIF            __at(0x1EF09);	// @ (0x3DE1 * 8 + 1)
#define                                 U2RXFOIF_bit        BANKMASK(U2ERRIR), 1
// U2FIFO<U2RXIDL>
extern volatile __bit                   U2RXIDL             __at(0x1EEFB);	// @ (0x3DDF * 8 + 3)
#define                                 U2RXIDL_bit         BANKMASK(U2FIFO), 3
// PIE6<U2RXIE>
extern volatile __bit                   U2RXIE              __at(0x1CCB2);	// @ (0x3996 * 8 + 2)
#define                                 U2RXIE_bit          BANKMASK(PIE6), 2
// PIR6<U2RXIF>
extern volatile __bit                   U2RXIF              __at(0x1CD32);	// @ (0x39A6 * 8 + 2)
#define                                 U2RXIF_bit          BANKMASK(PIR6), 2
// IPR6<U2RXIP>
extern volatile __bit                   U2RXIP              __at(0x1CC32);	// @ (0x3986 * 8 + 2)
#define                                 U2RXIP_bit          BANKMASK(IPR6), 2
// U2CON2<U2RXPOL>
extern volatile __bit                   U2RXPOL             __at(0x1EEE6);	// @ (0x3DDC * 8 + 6)
#define                                 U2RXPOL_bit         BANKMASK(U2CON2), 6
// U2CON1<U2SENDB>
extern volatile __bit                   U2SENDB             __at(0x1EED8);	// @ (0x3DDB * 8 + 0)
#define                                 U2SENDB_bit         BANKMASK(U2CON1), 0
// U2CON2<U2STP0>
extern volatile __bit                   U2STP0              __at(0x1EEE4);	// @ (0x3DDC * 8 + 4)
#define                                 U2STP0_bit          BANKMASK(U2CON2), 4
// U2CON2<U2STP1>
extern volatile __bit                   U2STP1              __at(0x1EEE5);	// @ (0x3DDC * 8 + 5)
#define                                 U2STP1_bit          BANKMASK(U2CON2), 5
// U2FIFO<U2STPMD>
extern volatile __bit                   U2STPMD             __at(0x1EEFE);	// @ (0x3DDF * 8 + 6)
#define                                 U2STPMD_bit         BANKMASK(U2FIFO), 6
// U2FIFO<U2TXBE>
extern volatile __bit                   U2TXBE              __at(0x1EEFD);	// @ (0x3DDF * 8 + 5)
#define                                 U2TXBE_bit          BANKMASK(U2FIFO), 5
// U2FIFO<U2TXBF>
extern volatile __bit                   U2TXBF              __at(0x1EEFC);	// @ (0x3DDF * 8 + 4)
#define                                 U2TXBF_bit          BANKMASK(U2FIFO), 4
// U2ERRIE<U2TXCIE>
extern volatile __bit                   U2TXCIE             __at(0x1EF10);	// @ (0x3DE2 * 8 + 0)
#define                                 U2TXCIE_bit         BANKMASK(U2ERRIE), 0
// U2ERRIR<U2TXCIF>
extern volatile __bit                   U2TXCIF             __at(0x1EF08);	// @ (0x3DE1 * 8 + 0)
#define                                 U2TXCIF_bit         BANKMASK(U2ERRIR), 0
// U2CON0<U2TXEN>
extern volatile __bit                   U2TXEN              __at(0x1EED5);	// @ (0x3DDA * 8 + 5)
#define                                 U2TXEN_bit          BANKMASK(U2CON0), 5
// PIE6<U2TXIE>
extern volatile __bit                   U2TXIE              __at(0x1CCB3);	// @ (0x3996 * 8 + 3)
#define                                 U2TXIE_bit          BANKMASK(PIE6), 3
// PIR6<U2TXIF>
extern volatile __bit                   U2TXIF              __at(0x1CD33);	// @ (0x39A6 * 8 + 3)
#define                                 U2TXIF_bit          BANKMASK(PIR6), 3
// IPR6<U2TXIP>
extern volatile __bit                   U2TXIP              __at(0x1CC33);	// @ (0x3986 * 8 + 3)
#define                                 U2TXIP_bit          BANKMASK(IPR6), 3
// U2ERRIE<U2TXMTIE>
extern volatile __bit                   U2TXMTIE            __at(0x1EF17);	// @ (0x3DE2 * 8 + 7)
#define                                 U2TXMTIE_bit        BANKMASK(U2ERRIE), 7
// U2ERRIR<U2TXMTIF>
extern volatile __bit                   U2TXMTIF            __at(0x1EF0F);	// @ (0x3DE1 * 8 + 7)
#define                                 U2TXMTIF_bit        BANKMASK(U2ERRIR), 7
// U2CON2<U2TXPOL>
extern volatile __bit                   U2TXPOL             __at(0x1EEE2);	// @ (0x3DDC * 8 + 2)
#define                                 U2TXPOL_bit         BANKMASK(U2CON2), 2
// U2FIFO<U2TXWRE>
extern volatile __bit                   U2TXWRE             __at(0x1EEFF);	// @ (0x3DDF * 8 + 7)
#define                                 U2TXWRE_bit         BANKMASK(U2FIFO), 7
// U2CON1<U2WUE>
extern volatile __bit                   U2WUE               __at(0x1EEDC);	// @ (0x3DDB * 8 + 4)
#define                                 U2WUE_bit           BANKMASK(U2CON1), 4
// U2UIR<U2WUIF>
extern volatile __bit                   U2WUIF              __at(0x1EF07);	// @ (0x3DE0 * 8 + 7)
#define                                 U2WUIF_bit          BANKMASK(U2UIR), 7
// U2FIFO<U2XON>
extern volatile __bit                   U2XON               __at(0x1EEFA);	// @ (0x3DDF * 8 + 2)
#define                                 U2XON_bit           BANKMASK(U2FIFO), 2
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x1FE50);	// @ (0x3FCA * 8 + 0)
#define                                 ULPWUIN_bit         BANKMASK(PORTA), 0
// ADUTHL<UTH0>
extern volatile __bit                   UTH0                __at(0x1F700);	// @ (0x3EE0 * 8 + 0)
#define                                 UTH0_bit            BANKMASK(ADUTHL), 0
// ADUTHL<UTH1>
extern volatile __bit                   UTH1                __at(0x1F701);	// @ (0x3EE0 * 8 + 1)
#define                                 UTH1_bit            BANKMASK(ADUTHL), 1
// ADUTHH<UTH10>
extern volatile __bit                   UTH10               __at(0x1F70A);	// @ (0x3EE1 * 8 + 2)
#define                                 UTH10_bit           BANKMASK(ADUTHH), 2
// ADUTHH<UTH11>
