LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
extern volatile __bit                   UTH11               __at(0x1F70B);	// @ (0x3EE1 * 8 + 3)
#define                                 UTH11_bit           BANKMASK(ADUTHH), 3
// ADUTHH<UTH12>
extern volatile __bit                   UTH12               __at(0x1F70C);	// @ (0x3EE1 * 8 + 4)
#define                                 UTH12_bit           BANKMASK(ADUTHH), 4
// ADUTHH<UTH13>
extern volatile __bit                   UTH13               __at(0x1F70D);	// @ (0x3EE1 * 8 + 5)
#define                                 UTH13_bit           BANKMASK(ADUTHH), 5
// ADUTHH<UTH14>
extern volatile __bit                   UTH14               __at(0x1F70E);	// @ (0x3EE1 * 8 + 6)
#define                                 UTH14_bit           BANKMASK(ADUTHH), 6
// ADUTHH<UTH15>
extern volatile __bit                   UTH15               __at(0x1F70F);	// @ (0x3EE1 * 8 + 7)
#define                                 UTH15_bit           BANKMASK(ADUTHH), 7
// ADUTHL<UTH2>
extern volatile __bit                   UTH2                __at(0x1F702);	// @ (0x3EE0 * 8 + 2)
#define                                 UTH2_bit            BANKMASK(ADUTHL), 2
// ADUTHL<UTH3>
extern volatile __bit                   UTH3                __at(0x1F703);	// @ (0x3EE0 * 8 + 3)
#define                                 UTH3_bit            BANKMASK(ADUTHL), 3
// ADUTHL<UTH4>
extern volatile __bit                   UTH4                __at(0x1F704);	// @ (0x3EE0 * 8 + 4)
#define                                 UTH4_bit            BANKMASK(ADUTHL), 4
// ADUTHL<UTH5>
extern volatile __bit                   UTH5                __at(0x1F705);	// @ (0x3EE0 * 8 + 5)
#define                                 UTH5_bit            BANKMASK(ADUTHL), 5
// ADUTHL<UTH6>
extern volatile __bit                   UTH6                __at(0x1F706);	// @ (0x3EE0 * 8 + 6)
#define                                 UTH6_bit            BANKMASK(ADUTHL), 6
// ADUTHL<UTH7>
extern volatile __bit                   UTH7                __at(0x1F707);	// @ (0x3EE0 * 8 + 7)
#define                                 UTH7_bit            BANKMASK(ADUTHL), 7
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0x1F708);	// @ (0x3EE1 * 8 + 0)
#define                                 UTH8_bit            BANKMASK(ADUTHH), 0
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0x1F709);	// @ (0x3EE1 * 8 + 1)
#define                                 UTH9_bit            BANKMASK(ADUTHH), 1
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0x1F7E6);	// @ (0x3EFC * 8 + 6)
#define                                 UTHR_bit            BANKMASK(ADSTAT), 6
// ADCON1<VCFG11>
extern volatile __bit                   VCFG11              __at(0x1F7CD);	// @ (0x3EF9 * 8 + 5)
#define                                 VCFG11_bit          BANKMASK(ADCON1), 5
// VREGCON<VREGPM>
extern volatile __bit                   VREGPM              __at(0x1CE89);	// @ (0x39D1 * 8 + 1)
#define                                 VREGPM_bit          BANKMASK(VREGCON), 1
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0x1CAE4);	// @ (0x395C * 8 + 4)
#define                                 WDTCS0_bit          BANKMASK(WDTCON1), 4
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0x1CAE5);	// @ (0x395C * 8 + 5)
#define                                 WDTCS1_bit          BANKMASK(WDTCON1), 5
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0x1CAE6);	// @ (0x395C * 8 + 6)
#define                                 WDTCS2_bit          BANKMASK(WDTCON1), 6
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x1CAD9);	// @ (0x395B * 8 + 1)
#define                                 WDTPS0_bit          BANKMASK(WDTCON0), 1
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x1CADA);	// @ (0x395B * 8 + 2)
#define                                 WDTPS1_bit          BANKMASK(WDTCON0), 2
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x1CADB);	// @ (0x395B * 8 + 3)
#define                                 WDTPS2_bit          BANKMASK(WDTCON0), 3
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x1CADC);	// @ (0x395B * 8 + 4)
#define                                 WDTPS3_bit          BANKMASK(WDTCON0), 4
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x1CADD);	// @ (0x395B * 8 + 5)
#define                                 WDTPS4_bit          BANKMASK(WDTCON0), 5
// WDTPSL<WDTPSCNT0>
extern volatile __bit                   WDTPSCNT0           __at(0x1CAE8);	// @ (0x395D * 8 + 0)
#define                                 WDTPSCNT0_bit       BANKMASK(WDTPSL), 0
// WDTPSL<WDTPSCNT1>
extern volatile __bit                   WDTPSCNT1           __at(0x1CAE9);	// @ (0x395D * 8 + 1)
#define                                 WDTPSCNT1_bit       BANKMASK(WDTPSL), 1
// WDTPSH<WDTPSCNT10>
extern volatile __bit                   WDTPSCNT10          __at(0x1CAF2);	// @ (0x395E * 8 + 2)
#define                                 WDTPSCNT10_bit      BANKMASK(WDTPSH), 2
// WDTPSH<WDTPSCNT11>
extern volatile __bit                   WDTPSCNT11          __at(0x1CAF3);	// @ (0x395E * 8 + 3)
#define                                 WDTPSCNT11_bit      BANKMASK(WDTPSH), 3
// WDTPSH<WDTPSCNT12>
extern volatile __bit                   WDTPSCNT12          __at(0x1CAF4);	// @ (0x395E * 8 + 4)
#define                                 WDTPSCNT12_bit      BANKMASK(WDTPSH), 4
// WDTPSH<WDTPSCNT13>
extern volatile __bit                   WDTPSCNT13          __at(0x1CAF5);	// @ (0x395E * 8 + 5)
#define                                 WDTPSCNT13_bit      BANKMASK(WDTPSH), 5
// WDTPSH<WDTPSCNT14>
extern volatile __bit                   WDTPSCNT14          __at(0x1CAF6);	// @ (0x395E * 8 + 6)
#define                                 WDTPSCNT14_bit      BANKMASK(WDTPSH), 6
// WDTPSH<WDTPSCNT15>
extern volatile __bit                   WDTPSCNT15          __at(0x1CAF7);	// @ (0x395E * 8 + 7)
#define                                 WDTPSCNT15_bit      BANKMASK(WDTPSH), 7
// WDTTMR<WDTPSCNT16>
extern volatile __bit                   WDTPSCNT16          __at(0x1CAF8);	// @ (0x395F * 8 + 0)
#define                                 WDTPSCNT16_bit      BANKMASK(WDTTMR), 0
// WDTTMR<WDTPSCNT17>
extern volatile __bit                   WDTPSCNT17          __at(0x1CAF9);	// @ (0x395F * 8 + 1)
#define                                 WDTPSCNT17_bit      BANKMASK(WDTTMR), 1
// WDTPSL<WDTPSCNT2>
extern volatile __bit                   WDTPSCNT2           __at(0x1CAEA);	// @ (0x395D * 8 + 2)
#define                                 WDTPSCNT2_bit       BANKMASK(WDTPSL), 2
// WDTPSL<WDTPSCNT3>
extern volatile __bit                   WDTPSCNT3           __at(0x1CAEB);	// @ (0x395D * 8 + 3)
#define                                 WDTPSCNT3_bit       BANKMASK(WDTPSL), 3
// WDTPSL<WDTPSCNT4>
extern volatile __bit                   WDTPSCNT4           __at(0x1CAEC);	// @ (0x395D * 8 + 4)
#define                                 WDTPSCNT4_bit       BANKMASK(WDTPSL), 4
// WDTPSL<WDTPSCNT5>
extern volatile __bit                   WDTPSCNT5           __at(0x1CAED);	// @ (0x395D * 8 + 5)
#define                                 WDTPSCNT5_bit       BANKMASK(WDTPSL), 5
// WDTPSL<WDTPSCNT6>
extern volatile __bit                   WDTPSCNT6           __at(0x1CAEE);	// @ (0x395D * 8 + 6)
#define                                 WDTPSCNT6_bit       BANKMASK(WDTPSL), 6
// WDTPSL<WDTPSCNT7>
extern volatile __bit                   WDTPSCNT7           __at(0x1CAEF);	// @ (0x395D * 8 + 7)
#define                                 WDTPSCNT7_bit       BANKMASK(WDTPSL), 7
// WDTPSH<WDTPSCNT8>
extern volatile __bit                   WDTPSCNT8           __at(0x1CAF0);	// @ (0x395E * 8 + 0)
#define                                 WDTPSCNT8_bit       BANKMASK(WDTPSH), 0
// WDTPSH<WDTPSCNT9>
extern volatile __bit                   WDTPSCNT9           __at(0x1CAF1);	// @ (0x395E * 8 + 1)
#define                                 WDTPSCNT9_bit       BANKMASK(WDTPSH), 1
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0x1CAD8);	// @ (0x395B * 8 + 0)
#define                                 WDTSEN_bit          BANKMASK(WDTCON0), 0
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0x1CAFA);	// @ (0x395F * 8 + 2)
#define                                 WDTSTATE_bit        BANKMASK(WDTTMR), 2
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0x1CAFB);	// @ (0x395F * 8 + 3)
#define                                 WDTTMR0_bit         BANKMASK(WDTTMR), 3
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0x1CAFC);	// @ (0x395F * 8 + 4)
#define                                 WDTTMR1_bit         BANKMASK(WDTTMR), 4
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0x1CAFD);	// @ (0x395F * 8 + 5)
#define                                 WDTTMR2_bit         BANKMASK(WDTTMR), 5
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0x1CAFE);	// @ (0x395F * 8 + 6)
#define                                 WDTTMR3_bit         BANKMASK(WDTTMR), 6
// WDTTMR<WDTTMR4>
extern volatile __bit                   WDTTMR4             __at(0x1CAFF);	// @ (0x395F * 8 + 7)
#define                                 WDTTMR4_bit         BANKMASK(WDTTMR), 7
// WDTCON1<WDTWINDOW0>
extern volatile __bit                   WDTWINDOW0          __at(0x1CAE0);	// @ (0x395C * 8 + 0)
#define                                 WDTWINDOW0_bit      BANKMASK(WDTCON1), 0
// WDTCON1<WDTWINDOW1>
extern volatile __bit                   WDTWINDOW1          __at(0x1CAE1);	// @ (0x395C * 8 + 1)
#define                                 WDTWINDOW1_bit      BANKMASK(WDTCON1), 1
// WDTCON1<WDTWINDOW2>
extern volatile __bit                   WDTWINDOW2          __at(0x1CAE2);	// @ (0x395C * 8 + 2)
#define                                 WDTWINDOW2_bit      BANKMASK(WDTCON1), 2
// PCON0<WDTWV>
extern volatile __bit                   WDTWV               __at(0x1FF85);	// @ (0x3FF0 * 8 + 5)
#define                                 WDTWV_bit           BANKMASK(PCON0), 5
// WDTCON1<WINDOW0>
extern volatile __bit                   WINDOW0             __at(0x1CAE0);	// @ (0x395C * 8 + 0)
#define                                 WINDOW0_bit         BANKMASK(WDTCON1), 0
// WDTCON1<WINDOW1>
extern volatile __bit                   WINDOW1             __at(0x1CAE1);	// @ (0x395C * 8 + 1)
#define                                 WINDOW1_bit         BANKMASK(WDTCON1), 1
// WDTCON1<WINDOW2>
extern volatile __bit                   WINDOW2             __at(0x1CAE2);	// @ (0x395C * 8 + 2)
#define                                 WINDOW2_bit         BANKMASK(WDTCON1), 2
// SMT1CON0<WPOL>
extern volatile __bit                   WPOL                __at(0x1F8F4);	// @ (0x3F1E * 8 + 4)
#define                                 WPOL_bit            BANKMASK(SMT1CON0), 4
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0x1D208);	// @ (0x3A41 * 8 + 0)
#define                                 WPUA0_bit           BANKMASK(WPUA), 0
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0x1D209);	// @ (0x3A41 * 8 + 1)
#define                                 WPUA1_bit           BANKMASK(WPUA), 1
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0x1D20A);	// @ (0x3A41 * 8 + 2)
#define                                 WPUA2_bit           BANKMASK(WPUA), 2
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0x1D20B);	// @ (0x3A41 * 8 + 3)
#define                                 WPUA3_bit           BANKMASK(WPUA), 3
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0x1D20C);	// @ (0x3A41 * 8 + 4)
#define                                 WPUA4_bit           BANKMASK(WPUA), 4
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0x1D20D);	// @ (0x3A41 * 8 + 5)
#define                                 WPUA5_bit           BANKMASK(WPUA), 5
// WPUA<WPUA6>
extern volatile __bit                   WPUA6               __at(0x1D20E);	// @ (0x3A41 * 8 + 6)
#define                                 WPUA6_bit           BANKMASK(WPUA), 6
// WPUA<WPUA7>
extern volatile __bit                   WPUA7               __at(0x1D20F);	// @ (0x3A41 * 8 + 7)
#define                                 WPUA7_bit           BANKMASK(WPUA), 7
// WPUB<WPUB0>
extern volatile __bit                   WPUB0               __at(0x1D288);	// @ (0x3A51 * 8 + 0)
#define                                 WPUB0_bit           BANKMASK(WPUB), 0
// WPUB<WPUB1>
extern volatile __bit                   WPUB1               __at(0x1D289);	// @ (0x3A51 * 8 + 1)
#define                                 WPUB1_bit           BANKMASK(WPUB), 1
// WPUB<WPUB2>
extern volatile __bit                   WPUB2               __at(0x1D28A);	// @ (0x3A51 * 8 + 2)
#define                                 WPUB2_bit           BANKMASK(WPUB), 2
// WPUB<WPUB3>
extern volatile __bit                   WPUB3               __at(0x1D28B);	// @ (0x3A51 * 8 + 3)
#define                                 WPUB3_bit           BANKMASK(WPUB), 3
// WPUB<WPUB4>
extern volatile __bit                   WPUB4               __at(0x1D28C);	// @ (0x3A51 * 8 + 4)
#define                                 WPUB4_bit           BANKMASK(WPUB), 4
// WPUB<WPUB5>
extern volatile __bit                   WPUB5               __at(0x1D28D);	// @ (0x3A51 * 8 + 5)
#define                                 WPUB5_bit           BANKMASK(WPUB), 5
// WPUB<WPUB6>
extern volatile __bit                   WPUB6               __at(0x1D28E);	// @ (0x3A51 * 8 + 6)
#define                                 WPUB6_bit           BANKMASK(WPUB), 6
// WPUB<WPUB7>
extern volatile __bit                   WPUB7               __at(0x1D28F);	// @ (0x3A51 * 8 + 7)
#define                                 WPUB7_bit           BANKMASK(WPUB), 7
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0x1D308);	// @ (0x3A61 * 8 + 0)
#define                                 WPUC0_bit           BANKMASK(WPUC), 0
// WPUC<WPUC1>
extern volatile __bit                   WPUC1               __at(0x1D309);	// @ (0x3A61 * 8 + 1)
#define                                 WPUC1_bit           BANKMASK(WPUC), 1
// WPUC<WPUC2>
extern volatile __bit                   WPUC2               __at(0x1D30A);	// @ (0x3A61 * 8 + 2)
#define                                 WPUC2_bit           BANKMASK(WPUC), 2
// WPUC<WPUC3>
extern volatile __bit                   WPUC3               __at(0x1D30B);	// @ (0x3A61 * 8 + 3)
#define                                 WPUC3_bit           BANKMASK(WPUC), 3
// WPUC<WPUC4>
extern volatile __bit                   WPUC4               __at(0x1D30C);	// @ (0x3A61 * 8 + 4)
#define                                 WPUC4_bit           BANKMASK(WPUC), 4
// WPUC<WPUC5>
extern volatile __bit                   WPUC5               __at(0x1D30D);	// @ (0x3A61 * 8 + 5)
#define                                 WPUC5_bit           BANKMASK(WPUC), 5
// WPUC<WPUC6>
extern volatile __bit                   WPUC6               __at(0x1D30E);	// @ (0x3A61 * 8 + 6)
#define                                 WPUC6_bit           BANKMASK(WPUC), 6
// WPUC<WPUC7>
extern volatile __bit                   WPUC7               __at(0x1D30F);	// @ (0x3A61 * 8 + 7)
#define                                 WPUC7_bit           BANKMASK(WPUC), 7
// WPUD<WPUD0>
extern volatile __bit                   WPUD0               __at(0x1D388);	// @ (0x3A71 * 8 + 0)
#define                                 WPUD0_bit           BANKMASK(WPUD), 0
// WPUD<WPUD1>
extern volatile __bit                   WPUD1               __at(0x1D389);	// @ (0x3A71 * 8 + 1)
#define                                 WPUD1_bit           BANKMASK(WPUD), 1
// WPUD<WPUD2>
extern volatile __bit                   WPUD2               __at(0x1D38A);	// @ (0x3A71 * 8 + 2)
#define                                 WPUD2_bit           BANKMASK(WPUD), 2
// WPUD<WPUD3>
extern volatile __bit                   WPUD3               __at(0x1D38B);	// @ (0x3A71 * 8 + 3)
#define                                 WPUD3_bit           BANKMASK(WPUD), 3
// WPUD<WPUD4>
extern volatile __bit                   WPUD4               __at(0x1D38C);	// @ (0x3A71 * 8 + 4)
#define                                 WPUD4_bit           BANKMASK(WPUD), 4
// WPUD<WPUD5>
extern volatile __bit                   WPUD5               __at(0x1D38D);	// @ (0x3A71 * 8 + 5)
#define                                 WPUD5_bit           BANKMASK(WPUD), 5
// WPUD<WPUD6>
extern volatile __bit                   WPUD6               __at(0x1D38E);	// @ (0x3A71 * 8 + 6)
#define                                 WPUD6_bit           BANKMASK(WPUD), 6
// WPUD<WPUD7>
extern volatile __bit                   WPUD7               __at(0x1D38F);	// @ (0x3A71 * 8 + 7)
#define                                 WPUD7_bit           BANKMASK(WPUD), 7
// WPUE<WPUE0>
extern volatile __bit                   WPUE0               __at(0x1D408);	// @ (0x3A81 * 8 + 0)
#define                                 WPUE0_bit           BANKMASK(WPUE), 0
// WPUE<WPUE1>
extern volatile __bit                   WPUE1               __at(0x1D409);	// @ (0x3A81 * 8 + 1)
#define                                 WPUE1_bit           BANKMASK(WPUE), 1
// WPUE<WPUE2>
extern volatile __bit                   WPUE2               __at(0x1D40A);	// @ (0x3A81 * 8 + 2)
#define                                 WPUE2_bit           BANKMASK(WPUE), 2
// WPUE<WPUE3>
extern volatile __bit                   WPUE3               __at(0x1D40B);	// @ (0x3A81 * 8 + 3)
#define                                 WPUE3_bit           BANKMASK(WPUE), 3
// NVMCON1<WR>
extern volatile __bit                   WR                  __at(0x1CF29);	// @ (0x39E5 * 8 + 1)
#define                                 WR_bit              BANKMASK(NVMCON1), 1
// I2C1PIE<WR1IE>
extern volatile __bit                   WR1IE               __at(0x1EBD4);	// @ (0x3D7A * 8 + 4)
#define                                 WR1IE_bit           BANKMASK(I2C1PIE), 4
// I2C1PIR<WR1IF>
extern volatile __bit                   WR1IF               __at(0x1EBCC);	// @ (0x3D79 * 8 + 4)
#define                                 WR1IF_bit           BANKMASK(I2C1PIR), 4
// I2C2PIE<WR2IE>
extern volatile __bit                   WR2IE               __at(0x1EB24);	// @ (0x3D64 * 8 + 4)
#define                                 WR2IE_bit           BANKMASK(I2C2PIE), 4
// I2C2PIR<WR2IF>
extern volatile __bit                   WR2IF               __at(0x1EB1C);	// @ (0x3D63 * 8 + 4)
#define                                 WR2IF_bit           BANKMASK(I2C2PIR), 4
// NVMCON1<WREN>
extern volatile __bit                   WREN                __at(0x1CF2A);	// @ (0x39E5 * 8 + 2)
#define                                 WREN_bit            BANKMASK(NVMCON1), 2
// NVMCON1<WRERR>
extern volatile __bit                   WRERR               __at(0x1CF2B);	// @ (0x39E5 * 8 + 3)
#define                                 WRERR_bit           BANKMASK(NVMCON1), 3
// SMT1STAT<WS>
extern volatile __bit                   WS                  __at(0x1F901);	// @ (0x3F20 * 8 + 1)
#define                                 WS_bit              BANKMASK(SMT1STAT), 1
// SMT1WIN<WSEL0>
extern volatile __bit                   WSEL0               __at(0x1F918);	// @ (0x3F23 * 8 + 0)
#define                                 WSEL0_bit           BANKMASK(SMT1WIN), 0
// SMT1WIN<WSEL1>
extern volatile __bit                   WSEL1               __at(0x1F919);	// @ (0x3F23 * 8 + 1)
#define                                 WSEL1_bit           BANKMASK(SMT1WIN), 1
// SMT1WIN<WSEL2>
extern volatile __bit                   WSEL2               __at(0x1F91A);	// @ (0x3F23 * 8 + 2)
#define                                 WSEL2_bit           BANKMASK(SMT1WIN), 2
// SMT1WIN<WSEL3>
extern volatile __bit                   WSEL3               __at(0x1F91B);	// @ (0x3F23 * 8 + 3)
#define                                 WSEL3_bit           BANKMASK(SMT1WIN), 3
// SMT1WIN<WSEL4>
extern volatile __bit                   WSEL4               __at(0x1F91C);	// @ (0x3F23 * 8 + 4)
#define                                 WSEL4_bit           BANKMASK(SMT1WIN), 4
// CRCXORL<X1>
extern volatile __bit                   X1                  __at(0x1CB31);	// @ (0x3966 * 8 + 1)
#define                                 X1_bit              BANKMASK(CRCXORL), 1
// CRCXORH<X10>
extern volatile __bit                   X10                 __at(0x1CB3A);	// @ (0x3967 * 8 + 2)
#define                                 X10_bit             BANKMASK(CRCXORH), 2
// CRCXORH<X11>
extern volatile __bit                   X11                 __at(0x1CB3B);	// @ (0x3967 * 8 + 3)
#define                                 X11_bit             BANKMASK(CRCXORH), 3
// CRCXORH<X12>
extern volatile __bit                   X12                 __at(0x1CB3C);	// @ (0x3967 * 8 + 4)
#define                                 X12_bit             BANKMASK(CRCXORH), 4
// CRCXORH<X13>
extern volatile __bit                   X13                 __at(0x1CB3D);	// @ (0x3967 * 8 + 5)
#define                                 X13_bit             BANKMASK(CRCXORH), 5
// CRCXORH<X14>
extern volatile __bit                   X14                 __at(0x1CB3E);	// @ (0x3967 * 8 + 6)
#define                                 X14_bit             BANKMASK(CRCXORH), 6
// CRCXORH<X15>
extern volatile __bit                   X15                 __at(0x1CB3F);	// @ (0x3967 * 8 + 7)
#define                                 X15_bit             BANKMASK(CRCXORH), 7
// CRCXORL<X2>
extern volatile __bit                   X2                  __at(0x1CB32);	// @ (0x3966 * 8 + 2)
#define                                 X2_bit              BANKMASK(CRCXORL), 2
// CRCXORL<X3>
extern volatile __bit                   X3                  __at(0x1CB33);	// @ (0x3966 * 8 + 3)
#define                                 X3_bit              BANKMASK(CRCXORL), 3
// CRCXORL<X4>
extern volatile __bit                   X4                  __at(0x1CB34);	// @ (0x3966 * 8 + 4)
#define                                 X4_bit              BANKMASK(CRCXORL), 4
// CRCXORL<X5>
extern volatile __bit                   X5                  __at(0x1CB35);	// @ (0x3966 * 8 + 5)
#define                                 X5_bit              BANKMASK(CRCXORL), 5
// CRCXORL<X6>
extern volatile __bit                   X6                  __at(0x1CB36);	// @ (0x3966 * 8 + 6)
#define                                 X6_bit              BANKMASK(CRCXORL), 6
// CRCXORL<X7>
extern volatile __bit                   X7                  __at(0x1CB37);	// @ (0x3966 * 8 + 7)
#define                                 X7_bit              BANKMASK(CRCXORL), 7
// CRCXORH<X8>
extern volatile __bit                   X8                  __at(0x1CB38);	// @ (0x3967 * 8 + 0)
#define                                 X8_bit              BANKMASK(CRCXORH), 0
// CRCXORH<X9>
extern volatile __bit                   X9                  __at(0x1CB39);	// @ (0x3967 * 8 + 1)
#define                                 X9_bit              BANKMASK(CRCXORH), 1
// PIE1<ZCDIE>
extern volatile __bit                   ZCDIE               __at(0x1CC89);	// @ (0x3991 * 8 + 1)
#define                                 ZCDIE_bit           BANKMASK(PIE1), 1
// PIR1<ZCDIF>
extern volatile __bit                   ZCDIF               __at(0x1CD09);	// @ (0x39A1 * 8 + 1)
#define                                 ZCDIF_bit           BANKMASK(PIR1), 1
// ZCDCON<ZCDINTN>
extern volatile __bit                   ZCDINTN             __at(0x1F618);	// @ (0x3EC3 * 8 + 0)
