LDG-Electronics/AT-600ProIIv2/src/peripherals/pic18f47k42 .h
#define                                 ZCDINTN_bit         BANKMASK(ZCDCON), 0
// ZCDCON<ZCDINTP>
extern volatile __bit                   ZCDINTP             __at(0x1F619);	// @ (0x3EC3 * 8 + 1)
#define                                 ZCDINTP_bit         BANKMASK(ZCDCON), 1
// IPR1<ZCDIP>
extern volatile __bit                   ZCDIP               __at(0x1CC09);	// @ (0x3981 * 8 + 1)
#define                                 ZCDIP_bit           BANKMASK(IPR1), 1
// PMD2<ZCDMD>
extern volatile __bit                   ZCDMD               __at(0x1CE10);	// @ (0x39C2 * 8 + 0)
#define                                 ZCDMD_bit           BANKMASK(PMD2), 0
// ZCDCON<ZCDOUT>
extern volatile __bit                   ZCDOUT              __at(0x1F61D);	// @ (0x3EC3 * 8 + 5)
#define                                 ZCDOUT_bit          BANKMASK(ZCDCON), 5
// ZCDCON<ZCDPOL>
extern volatile __bit                   ZCDPOL              __at(0x1F61C);	// @ (0x3EC3 * 8 + 4)
#define                                 ZCDPOL_bit          BANKMASK(ZCDCON), 4
// ZCDCON<ZCDSEN>
extern volatile __bit                   ZCDSEN              __at(0x1F61F);	// @ (0x3EC3 * 8 + 7)
#define                                 ZCDSEN_bit          BANKMASK(ZCDCON), 7
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1FEC2);	// @ (0x3FD8 * 8 + 2)
#define                                 ZERO_bit            BANKMASK(STATUS), 2
// PCON0<nBOR>
extern volatile __bit                   nBOR                __at(0x1FF80);	// @ (0x3FF0 * 8 + 0)
#define                                 nBOR_bit            BANKMASK(PCON0), 0
// PCON1<nMEMV>
extern volatile __bit                   nMEMV               __at(0x1FF89);	// @ (0x3FF1 * 8 + 1)
#define                                 nMEMV_bit           BANKMASK(PCON1), 1
// PCON0<nPOR>
extern volatile __bit                   nPOR                __at(0x1FF81);	// @ (0x3FF0 * 8 + 1)
#define                                 nPOR_bit            BANKMASK(PCON0), 1
// PCON0<nRI>
extern volatile __bit                   nRI                 __at(0x1FF82);	// @ (0x3FF0 * 8 + 2)
#define                                 nRI_bit             BANKMASK(PCON0), 2
// PCON0<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0x1FF83);	// @ (0x3FF0 * 8 + 3)
#define                                 nRMCLR_bit          BANKMASK(PCON0), 3
// PCON0<nRWDT>
extern volatile __bit                   nRWDT               __at(0x1FF84);	// @ (0x3FF0 * 8 + 4)
#define                                 nRWDT_bit           BANKMASK(PCON0), 4
// PCON0<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0x1FF85);	// @ (0x3FF0 * 8 + 5)
#define                                 nWDTWV_bit          BANKMASK(PCON0), 5

#endif // _PIC18F47K42_H_
